[{"name":"What do we find out there?","description":" Last week, we made some resurrection and chosen one plot hooks, so it seems fitting that for this batch of mysteries we visit the supernatural and the strange. The plot hooks themselves suggest a way in which the story could move forward. In contrast, a mystery should lead the story astray. There need not be clear direction as to where a mystery may be heading. The mystery doesn\u0027t necessarily have to be solvable at all, but it should be interesting enough to appeal to some PCs. I\u0027ll post a few examples."},{"name":"Ghost in the Brewery","description":" The monks swear there is a helpful ghost lurking in the brewery. They attempted to drive it out twice before, only to have dozens of barrels of ale drained as they aged."},{"name":"The Dancing Stars","description":" For centuries astronomers have watched the Red Wanderer and the Morning Maiden as they cross the sky. This year, their paths would cross for the first time in record. For the last six months, they have ceased to follow their expected paths and have been turning circles around each other."},{"name":"The Whispering Cave","description":" Up in Simon\u0027s Pass through the mountains, there is a cave that is said to whisper the names of travelers as they pass. No one who has gone deeper into the cave than the entryway has ever returned."},{"name":"The Old Moon Ship","description":" Every full moon, a ship with red sails is spotted off the coast of Tarrycliff. No one in the village knows whose ship it is."},{"name":"The Reaching Meadow","description":" Deep in the Haunted Forest there is a small clearing along the road covered in what at first appears to be tall grass. On your approach, you\u0027ll see that what you took for grass is in fact a patch of hundreds of long, thin tentacles, gently swaying together as if caught in a breeze."},{"name":"A Singular Duet","description":" There is a singer named Bertram who often performs in the Customs Plaza by day and at the Cat and Goat in the evenings who sings the loveliest duets, taking on both the high-pitch and the low-pitch parts, making both voices harmonize from his golden throat at once. When asked how he manages both the low and the high parts, Bertram insists with a smile that he doesn\u0027t sing the low parts, his infernal master does. If you ask to speak to his infernal master, Bertram laughs and lightly says, \"What master?\""},{"name":"The Fey Baker","description":" The best bakery in the city by far is The Faery\u0027s Child, an idyllic little affair on an out-of-the-way back alley. They\u0027ve got a little something for everyone, it seems. The proprietor, a lean, middle-aged elven man, is perfectly warm and welcoming, and only too happy to hand out samples to new customers. There\u0027s just one problem: nobody has ever seen anyone deliver supplies to make the baked goods he sells."},{"name":"The Day of Jubilee","description":" For one day every fifty years, every piece of currency and every gemstone in the country begins to rapidly transmute itself. Diamonds become turquoise become rubies become quartz; gold coins become coppers, which turn into platinum pieces. Trade becomes either impossible or completely possible; the more conservative merchants will close their doors to avoid being taken in, while the risk-takers will speculate and gather as many of the rapidly changing coins and jewels as possible. At the stroke of midnight, however, the transformations stop. Many a beggar has been made a rich man by the contents of his alms cup... and vice-versa."},{"name":"The Invisible Boatmobile","description":" Smack in the middle of a bustling town square is a place where nobody seems to walk--because there\u0027s a ship there. At least, it feels like a ship; while one can feel the planks and grip the anchor chain, to all observing eyes, the thing is invisible. The fact that it stands straight up while on land is a somewhat lesser miracle."},{"name":"Sister Goldenhair","description":" Tales tell that the king\u0027s daughter has the most beautiful golden hair. Tales are right; her hair is actually made of spun gold. Needless to say, she is kept under lock and key in the castle, and every ounce of shed or cut hair is whisked away to the treasury before you can say \"exploitation.\" One evening, a member of the party receives a letter by raven, pleading for rescue. There is no signature, but inside the folded paper are three strands of the finest gold."},{"name":"A Tailor\u0027s Secret","description":" A renowned purveyor of bespoke ettersilk clothing owns a four-way mirror that reflects only the most flattering angles and poses. Lately however, some customers report seeing long-lost relatives lurking behind their reflections, aggressively wielding long knives."},{"name":"Lights in the Belfry","description":" The tower of an abandoned church has regular nocturnal visitors that make no secret of their comings and goings, but the local village is hesitant at best to acknowledge it."},{"name":"Fifteen Souls of Silver","description":" Soon after receiving shipment of soul silver jewelry, the scale in Pyfford\u0027s Fyne Goods gained a new, unlabeled dial that only seems to change when used by certain members of the community, most of whom seem just as baffled by the addition as Dame Pyfford herself."},{"name":"The Gloam in the Loam","description":" A farmer digging for peat in the moors near his farm finds a buried door that opens into the parlor of a shady vampire-staffed gambling house a continent away."},{"name":"Unwinking","description":" After smoke from a forest fire turns the sun and moon blood red, local children start to mark ashy third eyes on their foreheads and will only speak in whispers."},{"name":"Mine, all mine!","description":" On the anniversary of a devastating cave-in, the runecog ore carts that had been lost within the mine trundle up from the deep, overladen with blood-stained ore."},{"name":"Innkeeper\u0027s Daughter","description":" Hrothman Togg is a pious man if there ever was one, and he keeps a clean establishment that caters to Clerics, Paladins, and other men (and occasionally women) of the cloth. Imagine his surprise when his daughter, a beautiful young woman, reveals that she\u0027s pregnant, and she doesn\u0027t know who the father is. Even more concerning to the community, however, is that up to a few days ago, Hrothman Togg didn\u0027t have a daughter."},{"name":"The Help","description":" A wealthy baroness has accused her staff of stealing the silver, and the local guard has been called in to handle the matter. What starts as suspicion quickly becomes confusion when it becomes apparent that the entire staff - supposedly nearly three hundred people - is actually one man in a vast array of costumes."},{"name":"A Plague of their Own","description":" And now for the puns! When the local women\u0027s Turnipball team grows ill right before a big game, their coach (and manager) is at wit\u0027s end. After a truly inspired pep talk, he gets them onto the field... but within minutes both teams are doubled over in pain. Now most of the league is sick, and the men\u0027s teams are refusing to play."},{"name":"One Cue Over the Cuckoo\u0027s Nest","description":" A small time hustler comes into possession of a staff that greatly increases his prowess in just about everything, especially billiards. Unfortunately for him, the staff is sentient, lawful good, and loudly repeats private conversations at the least convenient times."},{"name":"Chum Like it Hot","description":" (Part of) a missing nobleman turns up at fishmonger\u0027s quay after a particularly large tuna disgorges his signet ring, still worn on a severed finger. The bereaved family requests it back, and after a short period of mourning, the nobleman\u0027s son is named as the head of the house. Spectators at the event can\u0027t help but notice that the son now sports six fingers on his right hand, one of which is sickly white, pale, and wears the family signet."},{"name":"Sleepless in Sea Cattle","description":" A poleman on a garbage barge is swept into the river during a flash flood, and is saved by an aggregation of manatees. Now, several weeks later, he feels a strange urge to bathe in the brackish water of the bay, eat aquatic plant life, and headbutt boats. Even worse, his normally athletic physique is quickly becoming rotund, and his skin has become a rather unattractive gray."},{"name":"Oh Danny","description":" The moaning woman by the fountain that everyone walks past has a drawing of a young boy\u0027s face. It\u0027s her boy, Danny, and he\u0027s missing. Everyone has given up hope on finding him since he disappeared, but not her. This boy is everything to her, and now her husband, daughter, and best friend all won\u0027t speak to her anymore. Why?"},{"name":"The Hunter of the Wood","description":" The Baron of these lands set a Hunter to the task of ridding hid hunting wood of a terrible thing that has killed those unfortunate enough to happen across it. Some are found with terrible teeth marks, others with wide, horrible gashes. Many are never seen again. And the Hunter has been gone for three weeks."},{"name":"The Lies We Tell Ourselves","description":" The civil war between the Knights of this land and their forefathers, a paladinic order of tyrannical good, was only a Generation ago. But why can\u0027t anyone remember it clearly, or speak about it in detail? Do they fear plainly saying it, or have they really forgotten such a thing? How could they have naturally forgetten?"},{"name":"The Lost Battle","description":" The PCs come across a recent battlefield. Long enough ago that most of the bodies are gone, but arms and armour still litter the ground. However, none of the locals know about any battle, there are no stories about it, and the coats of arms and banners are unknown in the area."},{"name":"The Boatman","description":" Once a year a strange hooded figure poles a boat onto a certain dock. There is always one person who goes over to board it. Witnesses might say they looked afraid, relieved, or befuddled. The boat leaves, and that person is never seen again."},{"name":"The Ghost Dragon","description":" An apparition of a huge dragon appears whenever there is a lunar eclipse. It acts out the same scene each time - a titanic battle against an unseen foe. Finally it comes to rest at an abandoned plot of land where there are some ruins, and nothing grows."},{"name":"The Vagabond Merchant","description":" There are stories of a merchant you meet on the road, with a covered wagon decorated in painted vines and scenes of frolicking pixies. The merchant offers you a sale of a wondrous item, then, whether you buy or no, will ride on, vanishing when you look away for a moment, although you can still hear the hooves of the horse. Bad luck comes to those who see the merchant; if they buy, the item will doom them, if they don\u0027t, they find themselves in a situation where only that item would have saved them. Some say there is something you can say to the merchant that will make them leave you in peace."},{"name":"The Lost Prince","description":" The Crown Prince has vanished from his rooms at the palace. Nobody saw him leave, and no divination has found a trace, either of him or foul play. The only thing left was an exotic rose not from this continent and a note saying \"We must talk\" in elegant handwriting."},{"name":"The Best Pies","description":" The baker in town makes the best pies. The best. Everyone loves his pies. When people ask for his recipe, he just taps his nose and winks. Why are his pies so good?"},{"name":"This Isn\u0027t Mine","description":" One of the PCs wakes up one morning with a stone in their shoe. The stone turns out to be a flawless diamond, with the hint of something glinting in its depths. From time to time, people will come up to the PCs claiming the diamond is stolen, but when they see it they will go pale, give it back, and it isn\u0027t the diamond they were looking for."},{"name":"Blood Skies","description":" The skies turn blood red one night, as if blood were flowing over the dome of the sky. Everyone is talking about it for months later, even monsters who would otherwise simply attack the party."},{"name":"The Bunyip","description":" The local children have a communal imaginary friend, it seems. The \"Bunyip\" lives in a local ox-bow lake, in a small piece of abandoned ground near the village. The Bunyip occasionally takes the children to his underwater house, they say, and gives them presents. The presents appear to be sea-shells, which is odd, given the sea is many miles away."},{"name":"The Maw","description":" There is a local cave - not particularly mysterious until now. People used to shelter in it from the rain, or camp there when travelling to the next town. However, yesterday it suddenly changed into a carved likeness of an unknown monster with a huge, gaping maw. The locals would quite like the PCs to investigate."},{"name":"The Tower In The Thicket","description":" There is a forest of impenetrable Blood-Thorns. On dark moonless nights, what appears to be lights in a tower can be seen, about a mile into the thicket, on a hill."},{"name":"Death Coins","description":" Last night, all the portraits of the current king on all the coins of the realm changed to a hideous shrieking skull. Even the dies in the mint changed."},{"name":"Strange Harvest","description":" The day before Harvest Day, one field in the village appears to harvest itself overnight. It\u0027s always a different field, and seems random. No matter how careful a guard is placed, one field is always harvested without anyone seeing how or who."},{"name":"Draconic Surprise","description":" Every dragon or draconic creature seems surprised to see one of the PCs. No matter what they were doing, as soon as they see that PC they will start, and look at them with astonishment. \"It can\u0027t be...\""},{"name":"The Blinking Signal","description":" At noon everyday for one week of the year, a bright light can be seen blinking at the top of a cliff miles away. It looks like a reflection, but nobody knows what\u0027s causing it."},{"name":"The Sleep of Youth","description":" At the same time every afternoon, every child in this small village becomes incredibly lethargic for ten minutes or so. It is possible to keep them awake, but they all try to sleep the duration. The town has grown used to the effect and treats it as part of daily life."},{"name":"Old Snarefoot","description":" Deep in the woods, a creature is rumored to subsist entirely off of unwary travelers that it catches with its worn rope hands. According to the locals, there was an overzealous hangman many years ago, but no one knew what became of him when he was accused of treason."},{"name":"Autumn Down","description":" In the fall, trees in the King\u0027s Forest lose their leaves. Instead of standing bare, however, they grow fluffy grey down, then luxurious feathers as the winter progresses. It has been this way for centuries."},{"name":"Snake Oil","description":" Rekbar Otis is one of the land\u0027s greatest merchants. He has sold sand to camels, ice to vikings, and now, he\u0027s trying to con the good people of Randrenvale out of their gold with a miracle tincture. This time, it seems like it could be the real deal..."},{"name":"Bard\u0027s Pass","description":" None who come through the Bard\u0027s Pass, the only route between two mountain villages, emerge unchanged. Every living being that comes through the pass leaves with a newfound appreciation for music and a freshly tuned lute."},{"name":"The Spirals That Follow","description":" Out of the blue, dark red spirals appear wherever the players are. They seem to be organic in nature, twitching, breathing, sometimes even screaming. Their sudden appearance only seems to be noticed by the players, though. The pillars seem to have a weird effect on townsfolk and other figures around though. Nobody seems to be willing to acknowledge their existence, even when interacting without. \"Okay, so you\u0027re seeing the pillars, right?\" \"Yes.\" \"And you\u0027re still saying they don\u0027t exist?\" \"... Yes\""},{"name":"The Cave","description":" Next to a small town there is a cave that leads deep, deep into the hills. What lays at it\u0027s very depths is unknown, however, as seemingly every twist and turn people make them end up outside again, leaving through the very entrance they came in through."},{"name":"The Element of Surprise","description":" There is a cathedral where a mythical creature resides. Some say it\u0027s a living anvil, with teeth and a tongue that devour every adventure that nears, others claim it\u0027s a demon possessing the shadow of however enters, to kill it\u0027s owners. In all reality, it\u0027s a Suprise Elemental, a monster that without form, without reason. Only appearing when nobody is expecting it, always in the form that\u0027s least expected."},{"name":"The Siren Song of the Crypt","description":" Rumors of hauntingly beautiful music carrying through the night have been cropping up around the town crypt. All of the townspeople who claim to have heard it seem happy to discuss their lovely new nighttime lullaby."},{"name":"The Fighters","description":" Recently brawls at the local tavern have increased in their frequency and ferocity. People once known to be jovial, mellow, or sad drunks now turn on their friends with abandon at night. Curiously, people known to have a temple while drinking have now simmered down, and all involved seem unaffected during their daily lives, aside from nursing their fresh injuries."},{"name":"The Foresters\u0027 Plenty","description":" The town\u0027s loggers refuse to travel more than a league into the forest, but the lumber they return with is far too dense to be young growth, and it burns with an unusual ferocity. They\u0027ve been following the same logging trails for as long as anyone can remember, and refuse to show them to outsiders."},{"name":"The Weirding Well","description":" There is a well in the ruins of a town in a nearby glade. Legends and folktales abound about the strange sights and sounds around the well, and the countless brave souls who went to investigate only to return empty handed."},{"name":"Call for Justice","description":" Every night following the burial of a poor soul who died under questionable circumstances, a shrill but source-less cry for justice rings through the graveyard until the wee hours of the morning."},{"name":"The Circle of Feasting","description":" The party happens upon a fairy ring in the forest. Since there are no actual Fey around, it seems to be simply a curiosity. Should anyone attempt to eat or drink within the circle, however, they will find that their food and drink has become cuisine fit for the most decadent of banquets. Upon leaving the circle, however, the food leaves a bitter, ashen taste in their mouths."},{"name":"The Hills of Jars","description":" Just under the rolling, grassy hills of Sucia Isle, a series of vast, labyrinthine warrens and warehouses waits. The stonework walls, ceilings, and floors appear to be ancient and caked with dust. Filling the tens and hundreds of rooms within the hills are large, earthenware jars, lined up by the thousands, their clay lids sealed with wax. The entrances and exits to these underground storehouses are warded with powerful glyphs, which have long since faded and gone dark with the ages."},{"name":"Silence is Golden","description":" This object is peculiar, taking the shape of a rolled ring of some strange, silvery material. At first glance, there is no immediate way to unroll it, but with adequate investigation, the end can be found, and the substance unrolled from the rest. The silver strips can be torn away with little effort, and will adhere to most dry surfaces, though they have no other effect."},{"name":"The Tree of Runes","description":" Deep beneath the earth, far removed from the most remote dwarven strongholds of the Shadowspire Mountains, there is a tree. Green and flourishing despite the lack of sun, the tree\u0027s roots reach deep and wide, breaking the cavern floor. Each of the tree\u0027s leaves bears a symbol that greatly resembles a rune in the Dwarven alphabet."},{"name":"New Tricks","description":" While hunting in the deep forest, a Ranger\u0027s dire wolf companion has unearthed a fossilized femur bone of prodigious size that oozes dark red liquid when touched."},{"name":"Treasure\u0027s Quandary","description":" A collector\u0027s prize relic has been publicly proved a forgery, but that hasn\u0027t stopped a zealous cleric from demanding it be \u0027returned\u0027 to the temple from which it was \u0027stolen\u0027."},{"name":"Ninety Lives","description":" The neighbor\u0027s patch-furred, scarred old tom enjoys bringing the ravaged bodies of mice, rabbits and the occasional mimic spawnling to the steps of the outhouse, where the likelihood of meeting a bare foot in the middle of the night is at it\u0027s greatest. Lately, however, his prizes have included documents in foreign languages, gaudy jewelry, and the signet ring of a long-dead duke."},{"name":"Sideways Time","description":" A Wizard of some renown claims to have (re)discovered a new school of magic, but is unwilling to disclose any more until someone can prove that he isn\u0027t dead."},{"name":"Serpent\u0027s Feather","description":" The snakes that nest in the barren cliffs that skirt the Northern edge of the great desert are renowned for the deadly potency of their venom, and have been milked for generations in semi-religious ceremonies by Kobold mystics, who then sell vials of the stuff to the highest bidder on the shadow market. Lately, however, various cells in the loose network of assassin\u0027s guilds have reported that the last shipment of venom isn\u0027t nearly as effective as it once was, and a few incredibly thorough practitioners of the murderous arts have been overheard suggesting that it might actually have restorative powers."},{"name":"Love the Bomb","description":" In the quiet hamlet of Llywenshire, the well in the central square has served as the hub for the community for as long as anyone can remember. But after a sore-pocked and disease-ridden stranger clambered from its depths, shouting at anyone who would listen that \u0027SHE HAS AWOKEN\u0027 and \u0027THE END IS NIGH!\u0027, the villagers have begun to express concern."},{"name":"The Bronze Candlestick","description":" There is an old bronze candlestick on the mantle in the Rose Room at the Freewind Mage\u0027s Academy. Without fail, every morning, the caretaker finds the burnt stub of a candle in the bronze candlestick, even when there have been no guests in the Rose Room, and it has been locked all night. The caretaker has attempted to dispose of the bronze candlestick, but somehow it finds its way back to the room."},{"name":"The Hopping Raven","description":" Upon the gravestone of the beloved witch Lady Pinewall who succumbed to the blood plague, a raven hops up and down. When anyone approaches, the bird squawks \"SPEARS!\" and flies off, only to return once the coast is clear."},{"name":"The Golden Cherry","description":" At the center of the Royal Gardens is an old cherry tree that produces wonderful, sweet red cherries. In the history of the tree, it has produced a golden cherry three times. The first time, the prince who picked and ate the cherry died in battle the following morning. The second time, the kitchen maid who picked and ate the cherry died of a bad belly. The third time, the stable boy who picked the cherry and fed it to the pigs fell to his death from a hay loft that very night."},{"name":"The Pig in the Chimney","description":" At Garvil the Greenbeard\u0027s house, you\u0027ll hear an occasional squealing of a pig. The sound seems to be coming from his old stone chimney, but Garvil eats no meat and has never owned a pig. Sunny weather, stormy weather, crackling fire, or cold hearth, the squealing sound comes and goes as it pleases."},{"name":"The Sun God\u0027s Feasthall","description":" Way out in the desert in the ruins of the ancient city of Haz Alaf, there is a large stone table with stone benches still in its place in the feasthall of the Sun God. At noon on the day of the summer solstice every year, the table in the feasthall is filled with a traditional feast—pears and dates, figs and lentils, roast fox, buzzard\u0027s soup, braised drake, camel\u0027s milk cheese, toasted crickets, fried scorpions, honeyed wine, and mild tea. Ever since the discovery of the miracle, hundreds of pilgrims make the dangerous journey to Haz Alaf every late spring to witness the miracle."},{"name":"The Black Castle","description":" A black castle stands on the outskirts of a small town with strange customs regarding the dead, those that die are revered (think cattle in india). Word is the castle started out as nothing more than a pebble but has grown almost organically and they are willing to buy both the living and the dead for unknown reasons."},{"name":"Circle of unhappiness","description":" A round clearing in the middle of a vast forest. Nothing lay within, no grass, no trees, nothing but a single flower. Those entering will be faced with extreme dread and unhappiness to the point where they feel life no longer holds meaning for them. Even animals instinctively stay away."},{"name":"Jar of Many Faces","description":" A clay pot sits on the shelf, the visage inscribed on the jar stares back at you with an angry grimace. When next you glance in the pot\u0027s direction, you notice it\u0027s no longer frowning at you, but grinning."},{"name":"Ring of Many Moods","description":" Embedded in this small golden band is a single gem. When unworn, the gem is a pearly white. When worn, the gem shifts to one of many colours, ranging from the palest blue to jet black."},{"name":"The Unfound Door","description":" A door stands upright in the middle of a field, only visible from head-on. There is no frame or anything else to suggest it should be able to stand upright. When looked at from any other angle, it simply isn\u0027t there and may be passed through. The knob is locked and will not open for anyone."},{"name":"Boiling Bog","description":" A large pool of water within a marsh is bubbling and boiling and steaming for no discernible reason. Strangely, the water is cool to the touch."},{"name":"Well Of Black Water","description":" This strange well sits atop a hill. The water within is clear and inviting, but once a bucket is dipped into the well, the water within is turned black as tar and greasy, utterly undrinkable."},{"name":"Icebrick Tower","description":" In the middle of the scorching wastelands stands a tower of shimmering clear ice carved into the form of bricks. No matter how hot it is out, the ice will never melt, even though it always seems to be shimmering with melt water."},{"name":"A Clear Circlet","description":" In the Archbishop\u0027s parlor, on a mantle of dark wood, stands a circlet of beaten rose-gold. Across it stretches a translucent film similar to soapy water. Several of his guests have sworn they saw glimpses of strange lands, otherworldly places and in one case their own bedchamber inside it, but the Archbishop has never seen anything."},{"name":"What strange things have these brave warriors seen?","description":" In the anticipation on the eve of battle, one\u0027s mind might start playing tricks. After the confusion and gore of a pitched battle, who is to say that the strange tales told by the men and women who fought are not true? In a fantasy setting, some knights, sellswords, barbarian warriors, and common soldiers may forget most of the experience of a battle. But, sometimes, something will stick in the mind of one of these warriors, something unusual or out-of-place on the battlefield... The mystery doesn\u0027t necessarily have to be solvable at all, but it should be interesting enough to appeal to some PCs. I\u0027ll post a few examples."},{"name":"The Swan Among the Reeds","description":" While scouting the low hillocks and puddles of the Ravensmarsh on the eve of battle, I came upon a swan who told me to leave this place before dawn. Had I heeded the advice, I might still have two hands and be able to do honest work."},{"name":"The Child-Saint","description":" On the killing fields in the battle of Gundar\u0027s Pass, I fould myself trapped beneath my dying horse. My leg was badly broken and our lines were breaking. I was saying a prayer for my wife and sons when a child dressed in gold lifted my horse and told me, \"Go. Live.\""},{"name":"The Wriggling Plague","description":" When the wild men came down on Fort Whitewood, we were ill-prepared to withstand a long siege. I led a sortie out to burn their supplies before their force had complete encircled us. I came upon two scouts on foot who I quickly dispatched with my sword. Where their intestines ought to have spilled from their bellies came wriggling black feelers. The things came wriggling toward me. I am not proud of it, but I rode hard south. Something was wrong with those savages, and I did not to wait around in the fort for it to get to us."},{"name":"The Dead Laugh","description":" I had sold my sword to the Prince of Jalak, and I was with a boarding party on one of the warships attempting to break the Easterlings\u0027 blockade. A fireball blasted the deck on which I stood, and sent me hurtling into the sea. As I drifted, floating on a piece of the broken ship, the dead floated past me. They were laughing. All of them. Easterlings, Sandfolk, other foreign mercenaries. I\u0027ll never forget their smiles, and the sound of their mocking laughter."},{"name":"The Pink Sky","description":" You do know that during the Battle of Gwyllam\u0027s Crossing, the midday sky went from overcast grey to pink. My comrades saw it too. After the enemy was defeated, the sky went back to grey. It was the damnedest thing."},{"name":"The Whippish Beard","description":" We were on patrol, and we ended up skirmishing with a Bearmitt hunting party. A dwarf in our party fell and lost his axe while tangling with one of their hairier warriors. I swear to the gods I saw his beard, long and braided, uncoil itself, grab the axe from where it lay—several yards away!—like a fracking tentacle, and smash that Bearmitt savage in the skull."},{"name":"Death has a Familiar Face","description":" The commander decided to launch the attack at dawn. Before the sun\u0027s rays even crested the top of Hollow Hill, we rode towards the enemy encampment. We did not find a single living soul there. Fires were still burning. Swords and shields were still on their racks. Even the horses had disappeared. It seemed as if they had all vanished like a breath on the wind. The Count had hired a cabal of wizards to partake in the siege of Whitewalls and the men were wary of them. We don\u0027t like them lot who work for coin you see. They thought they\u0027d break down the gate with their chanting and their rituals, and this whole campaign would have be over in a week if they had. But as they stood in their chalk circle mumbling, one of the incanters dropped limp. Maybe it was a lucky arrow from the battlements, none of us saw it. But as soon as the man in robes hit the ground a shape wrapped in shadows rose from the circle. They tried to run, but that thing was faster. It gutted them all before vanishing. You should have seen the Count\u0027s face, not that we were cheering either I\u0027ll tell you that. I rushed towards the soldier, but as I struck him down, he wasn\u0027t there anymore. Instead there was my wife, my mace embedded in her skull. She was holding little Callum in her arms. I swear it, it\u0027s true, and just as true I ran away like the Seven Devils were chasing me."},{"name":"She who walked among us","description":" It was just after the clash of the armies, we fought at the front at about 5-1, but we fought like the lions we wore on our banners. When I went down after the horse knocked me over I saw the lady, in full battle gear with a long sword in hand, just walking through the fighting masses, dodging with a small wicked grin of satisfaction. Nobody ever saw her they swore to me, but I know what I saw as clear as you lot standing in front of me."},{"name":"The one left behind","description":" By all accounts I should have been dead (revealing two large scars on his chest) that day. I had fallen, I saw my brothers and the other fallen on the other side, waiting for the Valkyries to take us away. I saw them come and take my brothers and enemies alike, but they left me standing, next day I woke up on the battlefield between all the bodies and gore with cursing scavengers looting my body."},{"name":"The raven and the fox","description":" Everyone knows bad omens when they see them, a murder of crows following you or a red sunset at the eve of a battle. But a raven and black fox watch us that day when our supply caravan was ambushed on the road. It followed us all day, and old Huck warned us that we should take the longer road. And than they vanished from sight, not five minutes later the enemy was upon us, but I am the only one to tell the tale now."},{"name":"The Wardancers","description":" I have seen many a\u0027unit fall under our feet, crushed by our prowess and experience. But never will I forget the day we stood against the Elves of Shinmaer with their slim curved swords, we laughed and taunted their troups and their leather laced armor. But they just ran at us, without a sound, and they danced between us on unheard music like leafs on the winds of winter, and they shredded and tore through our ranks leaving nothing in their wake but falling soldiers and red-stained grass. We won that day, but for no gold in the world would I do that again."},{"name":"Parting words","description":" I ran a man through with such force that my hilt met his chest and we came face to face. He stared at me with a grin and whispered \"Excellent thrust, Calleb\" before he fell dead in the stream. How did he know my name?"},{"name":"Wrong Door","description":" In the heat of the chaos outside the siege of Castle Grendon, I saw a burst of light and wind not 20 paces away from me. A glowing circle appeared in the middle of the battlefield and a wizard, a halfling, an armored dwarf, and a half orc stepped through it. The wizard glanced around quickly before yelling \"Whoa! Whoops! Hold on..\" and pushing the other three back through the sparkling rift. The magical anomaly disappeared. I was so stunned I almost got my head taken off."},{"name":"Stephen the Streaker","description":" Did I ever tell you about Stephen Bagge? When that string bean, twig of a man joined our platoon I thought he\u0027d never live past his first skirmish. But, at the start of the Gordinia Woods battle, he sheds all his armor til he\u0027s just standin\u0027 there nude with his sword in hand. He charged into the fray and came out soaked in blood but untouched and through his breeches back on. The other lads made fun of him, called him names, said the only reason he survived all those battles was the enemy hesitating at the sight of him long enough to get cut down. But I saw him fight at Kaylor plains ... that boy moved with unnatural speed and skill..."},{"name":"THE MARSH MEN","description":" From the marshes they rose. All of the fallen. They shambled towards our regiment in haphazard organizations. So shocked was my regiment that we were torn apart. To this day I\u0027ll never forget the look of my warrior\u0027s faces as I fled."},{"name":"IN THE HILLS IT HUNTED","description":" The general had told me and my regiment to scout the Iron Hills. The morning was crisp and early, but the heat of the sun removed any chance of respite in the cold morning. We had been told to be on a lookout for a missing patrol, so naturally we were on edge. It was then, when the mists swirled before a low rise we saw it. An enormous beast, humanoid in posture, but a great goat head replaced what human features would be atop its broad shoulders. It bellowed at our patrol, and as it charged towards us, hefting a bloodied axe, I recognized the head of Rommel, my mothers cousin swinging on a belt tied to the beasts bulk, alongside members of the missing patrol. We never stood a chance, I survived only because I crawled into a ditch and hid, as my friends were torn apart."},{"name":"NO RETURN","description":" Yes dearie. My son, Jorgan, was drafted into the army some two moons ago. It was during the harvest festival that the visions began. During my sleep I watched my son do battle against the Northmen. Last night, he rode into the mists. He didn\u0027t return."},{"name":"bold","description":" \u003cli\u003eTo get bold you put two \u0027*\u0027 stars on either side. Like so:\u003c/li\u003e\n \u003d\u003d\u003d\u003d\u003e * * bold stuff * *"},{"name":"The Night Battle","description":" It was the last fight of the Greenseer Rebellion. Finally got those damn rebels to stand still and give a fair fight. We got our lines dressed at noon, and we advanced. There wasn\u0027t a cloud in the sky. Then, in the middle of the fight, I thought I saw smoke. I wondered if their camp was afire, but it was off to the flanks, not behind their lines. The cloud grew and grew, until it blotted out the sun, and we were in the dark. Then the cloud came down, further and further. And then it was amongst us - and it was bats. Thousands and thousands and thousands. All flying around us, the whole battle. Then, just as quick, they flew away, leaving the sky blue again. Strangest thing."},{"name":"The Lights","description":" I was on guard duty one night. We were on manoeuvres, but there wasn\u0027t an enemy anywhere near. So I was a bit surprised to see torches out there in the dark. Called the commander, and he raised the alert, so we formed up and got ready to receive a charge. The torches came closer and closer until they broke cover - and there was nothing there. No torches, no people, just the lights. The lights passed through our lines. Right through us. Corporal Gripes says he heard their footsteps, and I swear I felt the heat from one of the torches, but not a man saw a thing but the lights."},{"name":"The Battle of the Mists","description":" Ah, honoured master! Will you not sit with me and have a pipe? Yes, yes, just here. Achmed! Lazy boy! Bring my honoured guest a drink! You ask about The Battle of the Mists? Ah, honoured master, there is a tale to chill the blood, even on a day like today where the heat bears down. The dogs of the Berber Emirate needed to be taught to respect their true masters, so the armies of the Calphate were mustered. I was a humble Captain, commanding a mere one hundred lancers. Ah, I know my form is no longer of the dashing warrior I once was. But once, I was lithe and strong, and pleasing to the eyes of many a young beauty. The curs sought to hide from our wrath near the Bone Hills, but we stole a march on them and had them before us. Beautiful country for a horseman, honoured master. Flat and wide and just begging for a glorious charge. And who were we to deny? Yes, Achmed, the dates! I always have dates for the noon meal! And some for my guest! But as we trotted forwards, a strange mist arose. Nothing have I seen like it in all my days. The mists came, and enveloped us all. We could still hear their barbarous war-cries, and so we continued. But when the mists lifted, the plains were empty. From all around us, the cries of the Berbers, but no sign of them could be seen. They shouted that they could not see us, that we were cowards who had fled them, but they were the ones who had vanished. And then I saw a terrible thing. Many have called me a liar for my tale, but may the Prophet (peace be upon him) strike me down should I give tongue to a falsehood. A hundred great chariots sped across the plains, faster than the swiftest horse. But no horses pulled these great metal chariots. No wheels I saw, just dust. And a great tube, like the trunk of an elephant held outstretched before them. And the tubes spat fire! With a crash like that of thunder! I felt the great roar pass through my very body, and my horse reared. I crashed to the earth, and when I looked up, I was amongst the Berber rabble one more. They had been mown down like wheat and were routing before us, so none took notice of my fall. I looked about, and saw nothing of the monstrous chariots. None of my men - brave warriors all - ever spoke of that day. We were honoured for our part in a great victory, although truth be told not one of us wet our blades. I see doubt in your eyes, honoured master, and yet I swear by all that is, and by the truth of the Book that all befell as I have told you."},{"name":"The Battle of Dragons","description":" You\u0027ve never seen a dragon. Well, six I\u0027ve seen. Six more that I ever wish I\u0027d seen, if truth be told. I was a soldier once. Marched with the King against his brother when he tried for the throne. It was a cold day, and the Prince\u0027s army had found us and gave battle. Messy fight it was, with all of us mixed up with each other, tough hand-to-hand work. And then the shadow came over us. I looked up - and saw wings spread as wide as a ships sails. Massive red bugger it was. Flew over us, and landed to the side of the battle. And then another, shining like a copper penny, flew down. And another, green like the treetops. Then one gold, one silver, one black as night. They perched all around the battle, like they was watching us, or guarding us or herding. I dunno. They just sat there. Then they roared, and it was like they were trying to tear the air apart with their voices. The din shook the air in my lungs. Were they shouting at us? Or at each other? I don\u0027t know. Then, they stopped. It was so silent. And then they few away. We looked at each other - King\u0027s men, Prince\u0027s men - and we went back to our lines. nobody wanted to fight any more that day."},{"name":"The War Nobody Won","description":" The war wasn\u0027t just bloody, it was horror made flesh. Five armies? Six? Who could tell, with the alliances breaking and binding and breaking again. A sea of death, where the waves could barely hear themselves speak. When the survivors woke, they woke to desolation. Generals and kings slain, homes burned, whole cities annihilated. There was no victor... and if there was, they never stepped forward to take command. All that remained was charred chaos and bodies. Nobody knows who finally put a stop to the fighting."},{"name":"La Victoire","description":" \"I survived every cavalry charge and archer barrage that they sent up to us on top of Carver Hill. And every time, I swear I saw that same soldier. I know, because of his eyes. Blue, like bits of glowing lightning. Every time, I killed him, but he kept coming back. Sometimes... sometimes I think he still might.\""},{"name":"Oathbreaker","description":" Fifteen years ago, he ran when he swore to fight, and his king paid the price. He refuses to defend himself, despite how far he fell to save himself. Unless... that wasn\u0027t the reason?"},{"name":"The Plains of Glass","description":" The prophet stood on the stony outcrop overlooking the battle, and held out one interdictory hand. I still remember the sound of screeching and shattering as our weapons turned to glass in our hands."},{"name":"For Nitka","description":" Throughout all the variations of sound in the universe, there is a melody that, if played upon a certain instrument, tuned to a certain off-key, played at a certain pace, will kill everybody who listened to it from start to finish. The papers the song was written too are titled, \"For Nitka,\" but whoever Nitka is or who the author of the composition was is of great mystery now. If you plug your ears while listening to the song, or should you begin listening to it too late or begin listening too early, then your life will be spared. The song has only been performed once, and that was at a piano recital in the mansion of the family who claimed that an ancestor of their wrote it. One who\u0027d been listening but left to use the latrine returned just in time to hear the end of the song and witness as everybody, including the player, suddenly fell over dead. \"It wasn\u0027t even that bad of a song,\" the survivor claimed."},{"name":"The Pillars","description":" There are only three forests in the world where you will find a clearing of trees, where atop stand seven white marble pillars arranged in a circle. The pillars have existed on that hilltop longer than anyone can remember and there are no records of its construction and no nation can confidently make claim. As to what the pillars were erected for is a mystery. There are no bones in the dirt and there are no bloodstains on the stone. There are no articles to be found anywhere in the area. There are no other structures within miles of the pillars, and there are no deliberate paths leading to them. Yet people still find the pillars to sleep there. People who sleep in the circle of the pillars always have lucid dreams, which some will try to interpret as prophetic. Ceremonies to invoke for accurate dreams have changed throughout the centuries, but the dreams are always vague and weird. Sometimes, however, once in a generation, there will be a person who sleeps in the center of the circle of pillars and will awake recounting to have wandered through a great library, reading books about lost nations and civilizations, then awaking with a perfect memory of the experience."},{"name":"The Coward in the Cave","description":" I was in my seventeenth it eighteenth year, I remember, when I was on the front lines for the first time. My mind was racing with the thoughts of my father and mother, and just before we marched, I broke formation. I ran and ran, until I came across a nearby cave. I ducked in there and hid for what seemed a half day. When I came out, though, the battlefield was spotless. The camps, I could see, had only just begun to be set up, as though I had gone back three days. I ran as fast as I could from there, back to my parents\u0027 homestead."},{"name":"War of the Woods","description":" There used to be a keep wedged in a valley, near the the great river. One either side of the keep were great forests. One day, the sovereign ordered for the villagers to evacuate, fearing a great force would soon come to eradicate his people. The next month, the wildlife in the forest seemed to storm the the valley, and many who did not leave were caught in the mayhem. The survivors left as fast and fled as far as possible. Their stories say that the forest denizens were more interested in goring one another, and that the animals were painted in blue and red, like warring armies."},{"name":"Thunderstruck","description":" We were pinned. Trapped on the cliff, an army to the south, and the storming ocean to the north. With no way out, our commander had decided that we make out last stand there. We charged, ready to meet our gods. I saw the whites of the enemy\u0027s eyes, felt his hot breath in the cold rain. As I lunged forward with my pike, lightning struck in the center of the battlefield. The flash was so bright, all I could see for the next minute was white light and vague, spinning shapes. As I came to, every man in the opposing army had fallen dead, yet no man of ours had been touched. Something saved us that day; it stole our glory from us."},{"name":"The Battlefield Saint","description":" It was going terribly. We had been inspired by our mighty and virtuous cause; every man was willing to die it. But everything that could go wrong did. Our standard bearer was struck down within minutes of first contact. The enemy had large mobile ballistas, and their vast swaths of archers rained arrows like a deadly hail. I myself remember the pain of an axe in my side, followed by a huge barista bolt piercing not only my chest, but also the chest of a fellow comrade behind me. Before I died, I only remember seeing a man in white standing atop the distant hill above the chaos. Then darkness. The next thing, I feel a warmth inside of me. I felt at peace. And I woke up, face down in the grass, black and red blood painted across the green canvas of the meadow. I looked at my injuries to find them missing, and searched the horizon back toward the hill. The figure in white was shining with brilliance, and I could feel my breath escape my lungs in awe. Then, with a flash of blue, a ring of energy burst across the landscape, and the figure vanished in a puff of smoke."},{"name":"Behind the Dune","description":" The sand i was standing on was damp and soaked with blood, suprisingly i saw no dead bodies. I prepared to cross the dune front of, but i wish i wouldnt have crossed it, because what i saw standing on top of that dune was strange and disturbing."},{"name":"The humming oak tree","description":" We were sitting around the camp fire preparing to rest for the night. When i suddenly saw something strange in the dark. It was a dim light moving rapidly in the dark. I tried to follow it but it vanished after several yards. When i tried find the location the light vanished i found an oak tree. Strangle there was coming a humming noise from inside the tree, i swung my handaxe at the tree and then a bright flash of light appeared."},{"name":"The Raising of the Fallen","description":" The battle went well for us. We thought that victory was at hand. Then their necromancers started raising the fallen to fight anew. It\u0027s hard enough to fight a soldier who feels nor pain nor fear, but it became harder still when they started raising the fallen from among our own ranks."},{"name":"The Battle of Ninegrave","description":" The battle went well for us. We could see victory at hand, until their necromancers approached the front. The fallen began to rise. Dead-eyed and resolute they advanced. It\u0027s hard enough to fight against soldiers who feel neither pain nor fear, and harder still when the corpse you strike down was once a friend."},{"name":"The Shimmering Vale","description":" I know not why it was called the Shimmering Vale. When we crossed through it the air tasted of ash and the wind kicked up dust devils at our feet. The horses died first. Then the men began to sicken. They withered, fluids would not take hold in them, yet they did not die. Pale and parched we had to leave them behind. As we slept they marched closer, moaning for water. As we fled they called out, pleading for mercy. As we weakened those who could not keep up were abandoned. I do not imagine the ends they met were dignified. They refused to lie beneath the ground. When the remnants of the company crested the mountains at the other end of the valley we did not stop. We did not talk of where we would go or what had happened. As one, we deserted. Some were captured and hung, but most returned home and have yet to leave. I know that I shan\u0027t."},{"name":"The Red Border","description":" On the hills I stand, looking down upon the long line of ground stained red. The other nation stands across from us, staring down the same valley. It is now I remember his words.. \"I saw my friends die, I saw my comrades fall, I saw the enemy defeated, and yet we were told to run. Everyday after I came back, looking for my friends, looking to make a grave. All I could find were their weapons and the ground, stained, soaking pure red. Fools. They can\u0027t see the omen, and won\u0027t leave the border be...\""},{"name":"The Honorary Swordsmen who won\u0027t let the dead die","description":" They all know her, in the middle of war she walks the battlefield without fear. Despite wanting for death, she is bound by her honor. The same honor that caused her to pick up her blade. When she locks swords with someone who can hold their own, their fight, their sounds cause those around them to quiet. As they stand in awe, the two warriors duel - an honorable duel. She tells them, \"Duel me with fairness, if I lose I will grant you unquestionable power.\" \"And if you win?\" \"Then pledge to me your service, in life and death.\" And so they duel. They say she has not lost, they know she still holds power they cannot dare approach. They all know her, when the battle is lost she walks forward on the battlefield without fear. As she stares down the armies, a comrade notices a weariness on her face. She draws her sword, and so springs forth from the ground the fallen that have lost to her. Each great warrior, all whom have pledged their service, in life, or death."},{"name":"The Will-o-Wisp\u0027s Call","description":" The call of the wisp has always about on the battlefield, calling to the strays as a guide. That night though, before we could even fight, they took half the army with them without a sound."},{"name":"The Charm Plague","description":" The whole of the army, each soldier, beginning at the front line and spreading out like fire in a field of dry grass, began to turn on their kinsmen. Brothers in arms, so many long years at each others sides, thick as thieves, now savagely eviscerating each other. A very clever wizard had toiled away in his workshop for many months devising this charm. It was an amendment to something known in arcane circles as Dominate Monster, commonly used to take command of a monsters mind and give it direction against it\u0027s will. The wizard had constructed a method by which the spell could cast itself. When a mind is charmed by this spell, the creature immediately turns to all in it\u0027s vicinity and casts the spell on them before turning ruthlessly aggressive and killing all in his sight. By this method the spell spreads virally throughout the army. The wizard, clever as he was, didn\u0027t not anticipate that the telepathic link between himself and the affected minds would be two-way. It can hardly be imagined the mental anguish and terror to which he succumbed as he felt one thousand minds worth of rage and regret."}]