[{"name":"Brad the Bard","genderRaceOccupation":"Male Human Troubadour","description":" A prancing ponce whose lyrical beauty is beyond compare But for the nonce let\u0027s dwell on his quest for booty so rare His lust for princesses and queens and such ladies fair Landed him in prison five years ago - he yet rots in there!"},{"name":"Ebeneezer Meckinschmit","genderRaceOccupation":"Male Gnome Mad Traveling Wizard","description":" An old mad mage with a crazy accent. He travels in a wagon that looks splashed in dozens of paints, The wagon can magically open up on the side to create a market stall, complete with counter and a small set of stairs. Ebeneezer sells magical items, but always with a twist. Example: ring of detect fire, range: touch. He travels all across the land, and his wagon will occasionally shoot out fireworks."},{"name":"Wine Barrelshy","genderRaceOccupation":"Male Human Politician","description":" A portly man with a knack for wining and dining with all of the city-elite. He is excellent at making friends and connecting people with other people. Well-known for solving the diplomatic standoff between a raven, four rival blacksmiths, and a large kettle of mutton stew. Despite his schmoozing, he has never tasted alcohol. He always acts like he is drinking it before pouring it discretely down his maroon-colored sleeves."},{"name":"Elyss Iland","genderRaceOccupation":"Female Elf Recordkeeper","description":" Handles the welcoming of all newcomers to the Elvish lands and ensures that documentation is in order. Keeps meticulous records to the point of insanity, ie. Jerome\u0027s family biscuit recipe and Thurn\u0027s desire to have tree-limbs for arms. She is the source of the best gossip due to the collision of many backgrounds and personalities. Will often \"strongly advise\" that newcomers offer gratuity in the form of spoons - she has quite the collection."},{"name":"Thall\u0027um Pineleg","genderRaceOccupation":"Male Dwarf Craftsman","description":" Injured in the dwarven mines at a young age, Thall\u0027um has permanent need for a wooden crutch. One end of his crutch is functional as a pickaxe, so he leans against the rock and picks with one arm. He is ambidextrous and a lover of symmetry; he will mine with both arms equally so as not to be disproportionate. His companion is a small, mute canary."},{"name":"Ronny Jainclout","genderRaceOccupation":"Male Human Weather-Enthusiast","description":" Born in a heavy rainstorm, Ronny has always loved the mightiest of Nature\u0027s squalls. Wears a tiny kettle on the top of his hat to collect rainwater - a drink he finds superior to all else. Terrible at small-talk because his idea of riveting conversation is what other people consider dull. Spends hours at a time staring longingly up at the sky before hastily scrawling out inaccurate weather predictions."},{"name":"Q","genderRaceOccupation":"The crow may fly but does not speak, No secrets pour from silent beak...\"","description":" Has an iron medieval plague-mask attached to his face, covering up long scars and awful burns - payment for committing arson. Can only speak in sing-songy rhymes: Plagued with bouts of fear and dementia and will often sit down and rock himself gently until his sanity is restored. Has acute memory loss which makes him a terrible candidate for acting. Instead, he helps the other entertainers in his troupe with various tasks and chores."},{"name":"Reepa Featherlite","genderRaceOccupation":"Female Elf Repossession Agent","description":" A discrete \"Repo-Woman\" who reacquires goods through silent thievery. Often employed by the self-righteous elitists who tell long-winded stories of how they gained their wealth. If objects were gained illegally, she...takes the burden off their weak shoulders. She steals from the rich and gives to herself. It\u0027s the thought that counts after all, right? Along with her big-ticket items, she always tries to repossess sewing materials for her up-and-coming vintage money-purse business, \"Featherlite Purses: So light you won\u0027t even know it\u0027s there!\""},{"name":"Rodencha Kinsly","genderRaceOccupation":"Female Human Baker","description":" Absolutely LOVES cheese; can\u0027t get enough of the stuff. Incorporates it into nearly all of her recipes including apple pies, salads, and salmon bake. Is generally shy \u0026 timid. She doesn\u0027t like attention and will scurry away at the first sign of social interaction. Quite wary of wizards and magic-dealers in particular. Especially after she was inadvertently part of a wizard\u0027s mind-swap experiments. In other news, the experiment may have been partially successful and she may think that she\u0027s a mouse."},{"name":"The Amazing Prosto!","genderRaceOccupation":"Male Human Magician","description":" Wanders between towns and shares his magical talents with the world. His interest in magic peaked when his uncle pulled a coin from behind his ear. How did he do that?! Has a slight speech impediment, but it does not detract from his charismatic approach to wowing his audience with doves, rabbits, and paper bouquets. He humbly requests that parents refrain from speaking during his performances, since the reason of adults will ruin the experience for his target audience."},{"name":"Gurglak Goggleschmitt","genderRaceOccupation":"Male Orc Artificer","description":" Use hands. Smash big stuff. Make small stuff from big stuff crumbs. Gurglak happy. Smash small stuff. Hands too big. Can\u0027t make no more stuff. Gurglak sad. Find new stuff."},{"name":"Ogrim Battlestroke","genderRaceOccupation":"Male Dwarf Mercenary","description":" Stereotypical warrior dwarf complete with expertly-forged armor and fearsome warhammer. Offers his services to all armies, with his preference being exotic and distant lands. Wakes up before sunrise on the day of battle, breaks out his canvas, and paints stunningly-detailed landscapes of the scene prior to being forever marred by blood and destruction. He sends these paintings back to his mother who thinks that he is merely a world-traveler who wishes to share his journeys with his only family."},{"name":"Golly the Gambibbler","genderRaceOccupation":"Male Human Linthijaz","description":" Golly galumphs presently board he once brillig, tromping on loofus made twisty by twill, to trill at a boohome for russets and dogherous burbles."},{"name":"Russel Folnhir","genderRaceOccupation":"Male Dragonborn Chef","description":" Large among the largest of Dragonborn, mightier than warriors, quicker than thieves, and smarter than scholars, Russel\u0027s ambitions lie solidly in the kitchen. He\u0027s often questioned about his peculiar life, that of choosing to be a chef rather than act on what appear to be a divine set of natural talents and opportunities. Russel is better than most at what he tries, but does not care to do anything but cook. He makes a decent sum from his job at a small town\u0027s community mess hall, though a lot of his work is done for free out of the love of doing it. Has a halfling wife named Margaret, who works part time as a lumberjack."},{"name":"Sifvilgyplidiven the Unpronounceable","genderRaceOccupation":"Male Human-ish Wizard","description":" Sifvilgyplidiven doesn\u0027t remember much of his parents, Tyghroiulmborttsmn and Yyyalianmmhjahtyrhba, but knows that his name has some greater meaning. He lives a simple life in an underground home beneath his pet project, a self-sufficient haberdashery catering mainly to the sale of hats. Despite being a wizard he is unable to do much beyond basic tricks, but knows more about obscure rituals and spells than anyone. He will teach travelers these things, but only if they can pronounce his name. Those who succeed also get a discount on hats."},{"name":"John Smith","genderRaceOccupation":"Male Human Commoner","description":" John constantly feels like the background character of a good book. His best friends Rydgar and Thorgrin the God Slayer seem exciting, living adventurous lives. In comparison, he\u0027s content with the simple 9-5 bustle of his medium sized town, his average home, and his hobbies. He collects coins of historical value, and has a large collection that he\u0027s quite proud of. John is so normal that he almost feels out of place. But then, how normal can he be? If normal is a barbarian devil killer, then isn\u0027t John abnormal? But that doesn\u0027t seem right. He is normal, it\u0027s the world that\u0027s strange! John wrestles with these thoughts often."},{"name":"Mepis Soutan","genderRaceOccupation":"Female Half-Elf Journalist","description":" Journalism isn\u0027t exactly the most respected career paths in the world, but it\u0027s exciting. Mepis got her start writing for The Copper Pape writing about the unimportant nonsense of small town life such as which blacksmith was hammering who\u0027s codpieces. She caught a big break after securing an exclusive interview with Pelor, somewhat breaching her ethics policies by bribing him with the famous muffins of a local chef Russel Folnhir. She\u0027s now a columnist for The Astral Quill, and has been trying to secure an interview with someone that will take her career to the next level."},{"name":"Eubor Westmin","genderRaceOccupation":"Undead Arms Dealer","description":" Eubor was once a person of some description, turned undead by some necromancer of some other description. He doesn\u0027t care for the particulars. Upon being raised, Eubor found that being an undead minion wasn\u0027t for him so he left to pursue other options. He now makes a living by taking weapons from dungeons, battlefields, etc and selling them. It\u0027s not a noble living, nor a living at all for Eubor, but it occupies eternity."},{"name":"Yulmon Taed","genderRaceOccupation":"Male Human Author","description":" Yulmon occupies his time writing short stories, as well as occasional re-imaginings of folklore. His first book, The Boy and the Sweet +4 Shortsword was a big hit, giving him the fanbase to leave his miserable job as a haberdasher and write full time. He mainly sells his stories to The Astral Quill. Right now he\u0027s working on his first novel, A Game of Fancy Chairs."},{"name":"Hirai Doyle","genderRaceOccupation":"Male Child Detective?","description":" Hirai is a child who calls himself a detective, and seems to possess intelligence and skills unlike any child should have. He also looks remarkably similar to a teenage detective from the area who went missing the same day the boy appeared, though with some glasses. This is of course just a coincidence, obviously. He frequently gets into dangerous situations, left to save the day using various gadgets created for him by his elderly gnome friend, Instructor Christie Herschel."},{"name":"Daven Frealor","genderRaceOccupation":"Male Human Actor","description":" Daven is an actor, that much is simple. His real last name is Radtaie, but he changed it as there was already an actor named Daven Radtaie and there are rules to this business. He\u0027s considered semi-famous, holding a lot of minor roles in the big plays and some major roles in the smaller ones. His upcoming gig, standing in for a larger actor who quit acting to pursue a career in haberdashing, could be what he needs to break into the big leagues. His acting\u0027s fine, but he\u0027s just a bit too dramatic at times. If you want more detail, Mepis Soutan once reviewed his performance in Undeath of a Salesman."},{"name":"Dot","genderRaceOccupation":"Male and Female Human Twins","description":" Pip and Dot are male and female, respectfully, and are identical twins. As kids it was cute, but as they grew older their interests diverged and now they just get on each other\u0027s nerves. Pip is an enchanter, and Dot is a ranger. Both are highly respected by those around them, and both are proper and well mannered. Put them together and they argue like children. Without having talked to each other in years, they each met and married one of a set of twins, Tim and Tammy, with similar circumstances and none of the four knowing anything about the situation. Coincidentally, Pip and Dot\u0027s older brother Jon is good friends with Tim and Tammy\u0027s older sister Jane, having met outside the situation. That first family reunion was a confusing one."},{"name":"Bryce Bladewalker","genderRaceOccupation":"Male. Human druid. Serial Killer.","description":" Favourite saying: The only thing I\u0027ll trust a woman to do is stay dead. Personality: A real go-getter, he can\u0027t stand laziness. Alcoholic. Widowed. Important memories: His wife, leaving him for a wizard whose every need was attended by magical servants. Strangling that wizard with his bear hands. An alcohol-fuelled haze of pain and regret."},{"name":"Laura Midsommer","genderRaceOccupation":"Female Human Basket-weaver","description":" She sits outside on clear days, weaving. With subtle yet somehow striking auburn hair, and a face rounded but fine. \"The Jewel of the town\" she was described. She is however as cold to others as the north wind."},{"name":"Stonebeard","genderRaceOccupation":"Male Dwarf Mason","description":" \"Stonebeard\" not going by his birth name due to a contempt for his father who is considered \"A lousy drunkard\" even among dwarfs. Due to this he has a unusual fondness of \"family values\" and has a strong moral code. He travels around the human cities offering his extensive knowledge on stonework."},{"name":"Antonio Pyre","genderRaceOccupation":"Male Human Acolyte","description":" Acolytes are often seen as unsociable to regular folk. Antonio is a man of common tastes, which has left him unable to gain higher status in his church. He would spend his evenings drinking and whoring. His sins should not be taken for complacency in religion, in his sinful conquests he would take the lowest of the low into the arms of god."},{"name":"Evylin Silverwind","genderRaceOccupation":"Female Elf(?) Adviser-to-the-king","description":" A beautiful elf with silver hair flowing to her ankles. She is rarely seen far from the king, the few that have spoken too her see her as unusual. She is mostly unversed in human culture, unusual for anyone living in the heart of a human city."},{"name":"Stron Leather-Arm","genderRaceOccupation":"Male Half-Orc Butcher","description":" Stron is a brazen fellow, harsh of word and sharp of tongue. Many distrust him as a half-orc, his profession does not help public opinion. While many butchers do not care much for the final product, Stron is a true gourmet, not cut of meat is too fine for his taste. He shares this only with his more friendly customers."},{"name":"Sapphire","genderRaceOccupation":"Female Human Prostitute/Spy","description":" Many prostitutes in the slums are driven to it by lack of options. Sapphire however has carved her own path from day one, she was a sharp young lady, too good for a brothel, but she was happy with it. After a few years, she knew how eager men (and some women) were to spill their guts. The lesson Sapphire learned was playing with politics was much more profitable."},{"name":"Marrak Sunstone","genderRaceOccupation":"Male Human Arena-Fighter","description":" A man skilled in the martial arts is not uncommon, but one that can work a crowd so well is. A strong distinguished jawline and an even stronger voice. He is known for fighting with a falchion and sling, rather than the more common sword and shield."},{"name":"Biri Bluebarrel","genderRaceOccupation":"Female Halfling Brewer","description":" From a long line of famous brewers, Biri is no less skilled. The fine blue-tinted ale her family is named for however is like poison to her tongue. Biri is cursed to never enjoy her gifts. She is loved by many, and despite not drinking makes any party lively."},{"name":"Thalar Yet","genderRaceOccupation":"Female Dragonborn Wandering Teacher","description":" Thalar always found an odd love of humans, interested in their quarrels and struggles. She alone has become almost a legend travelling from village to village, every one left better off for it. She was taught well while young possessing great knowledge in healing, agriculture and combat. Thalar\u0027s love of humans even lead to her discarding the name of her clan for a name that humans found easier to say."},{"name":"Skarrak Sunlight","genderRaceOccupation":"Male Tiefling Priest","description":" Masochist, is the one word that comes to mind when people speak of Skarrak. He is hated for his appearance, yet he retains a paragon of honor, virtue and piety. Through great pain he has removed his horns, over years cut away his tail. A man wounded in mind, some pity him above all others. (Phew 10, I should probably stop now)"},{"name":"Sarim Marshwalker","genderRaceOccupation":"Male Half-Orc Ranger","description":" Lives on the edge of the swamplands, and will act as a guide for any who can pay a fair tariff. Though outwardly gruff, he can be fairly pleasant. That is, unless you ask about his scars... The last group to pass that way still haven\u0027t been found."},{"name":"Ravn Erickson","genderRaceOccupation":"Male Human Bard","description":" Old man Ravn has a tale for every night of the year, and knows more songs than there are stars in the sky. He wonders the northlands in search of heroes and adventurers to question, and will happily allow a road-weary party to share his fire in exchange for their story. His sage advice has more than once saved kingdoms from collapse, and is a welcome guest at any lord\u0027s dwelling."},{"name":"Winna","genderRaceOccupation":"Female Human Barmaid","description":" Though she seems dim at first, young Winna is as sharp as a razor. She knows all the comings and goings in town, and rumour has it she knows the leaders of the Thieves Guild. Woe betide any who would raise a hand to her."},{"name":"Valdi Galanodel","genderRaceOccupation":"Female Elf Ranger","description":" A strong but paranoid leader, Valdi is fiercely protective of both her land and her kin. She views outsiders with vehement disdain, and rarely allows trespassers on her land to pass unchallenged. Her pride has led to friction with the nearby human and dwarf settlements, and both are becoming increasingly concerned by her readiness to slay any who put so much as a toe across her borders."},{"name":"Lord Kristian Fiermann","genderRaceOccupation":"Male Human Lord","description":" As corrupt as they come, Lord Fiermann sees himself a strong and capable man, though in fact his strength comes from his wife and her family, whose ambition far outstrips his. He frequently raises taxes to support his wife\u0027s \"projects\", and turns a blind eye to the numerous missing villagers who seem to wind up in his dungeons. He won\u0027t have anything to do with dark magic, though it is clear his wife is secretly attempting to summon demons to further her own goals."},{"name":"Jackson Stern","genderRaceOccupation":"Male Human Miscreant","description":" Everyone in town knows Jackson, forever in trouble with the Town Guard. He\u0027s a troubled boy, and his petty crimes are going to see him hung. He strives to be the best thief this side of the Eastern Sea, but is so clumsy he mostly ends up causing minor damage to properties instead, before failing to steal anything before the Town Guard turns up to drag him back to the cell in the barracks. They joke he should be paying them rent."},{"name":"Father Osmund","genderRaceOccupation":"Male Human Cleric (War Domain)","description":" Old Father Osmund is a devout racist. Though he outwardly strives to \"better the world\", he is zealous to the point of fanaticism. He can be found wherever there is a human lord looking to stamp out a local non-human community, or otherwise spends his time persecuting non-human members of society. He seeds rumours, sometimes even planting incriminating evidence in dwellings, before offering to be the one to deal with them once the mob is roused."},{"name":"Tess D\u0027Orvic","genderRaceOccupation":"Female Human Sorcerer","description":" Tess is the epitome of bad luck. Though she is one of the strongest sorcerers in the land, her art rarely manifests itself in the way she intends. She\u0027s on the run now, after that time she agreed to help deal with a ghost in the town cemetery, only to accidentally disturb all the other resting souls into haunting the town. When she reported to the council, so deep was her anxiety that her wild magic flared once again, and now none of them can talk, except to make farm animal noises. The price on her head is quite large these days."},{"name":"Asher","genderRaceOccupation":"Male Human Rogue","description":" No job is too grim for Asher - for the right price he\u0027ll do almost anything. And he is good at what he does. Once the fee is paid, you won\u0027t see him again until the job is done. Don\u0027t expect him to stay quiet about it though. A few ales and he\u0027ll tell anyone anything."},{"name":"Kydd","genderRaceOccupation":"Female(?) Human(?) Child(?)","description":" No-one knows anything about Kydd\u0027s origins. She is only ever seen before a town suffers a cataclysmic event, and stories of her appearances go back centuries. There have only been two occasions where she has spoken, and the persons to which she spoke became heroes of legend. No town has ever survived longer than 24 hours after she appears there. Perhaps she is the cause, or merely a warning?"},{"name":"Estragon Morrins","genderRaceOccupation":"Mysterious Gnome Merchant","description":" A middle-aged man who feigns madness and sells an incredibly powerful poison known to cause septicemia which is in fact ditchwater."},{"name":"Old Greg","genderRaceOccupation":"Generic Old Guy","description":" Greg is a generic old guy who sits in the corner of the tavern and occasionally shouts \u0027Lord Sprinkleton? Ah, not many people know the story of Lord Sprinkleton these days\u0027. Unfortunately, he doesn\u0027t know all that much. He will only ever recount his childhood on the farm and explain vaguely relevant elven and dwarfish conspiracies because he is violently racist."},{"name":"Rod Osmington","genderRaceOccupation":"Angry Merchant","description":" Rod has just escaped a troubled relationship with his father, in which his father decided to give him his full inheritance in chickens and land. Rod is now seeking people who will trade chickens for chicken food or actual money, and is therefore first seen leading thirty chickens or so. He does not like talking about it and will be gruff to any that ask why he has so many chickens."},{"name":"John the cat","genderRaceOccupation":"A Cat","description":" John is a cat, who will follow the party around. Flip a coin: Heads, he\u0027s the familiar of a suitably powerful wizard. Tails, he\u0027s literally just a cat. He is exceptionally stupid, and will often run off to stupid places. If the party decides to follow him around, he will consistently get them into trouble by biting important people, running away to secret bandit hideouts, and attacking the wizard\u0027s spellbook."},{"name":"Triggart Darkfeather","genderRaceOccupation":"Tengu, Merchant","description":" I dont have time to do the Ten but Ill toss a few in here. Two of whom I played before starting DMing, Ive found them useful as NPCs because I like them. Small and pale and a great desire to be evil. Sometimes sides with good for his own later benefit. Wanted nothing more than to become a Lich god. Hated good Necromancers more than anything in the world. Hated his father for cruel magical experiments. VERY strong hatred of anything evil. Able to detect alignments, worshiped a troll god. Used a sword that was too big for him and was way smarter than him. After his people were killed he was raised from infancy by a gang of human thieves. Believed himself for a long time to be human, thinks everyone sees him as human. He often thinks he needs to explain to people that he isnt human. Because he was raised by humans he behaves like a human and not an elf. Mildly racist against any other race. See\u0027s Tengu as inherintly superior. Loves shiny things. Makes no bones about using other races for his own benefit. This is all I have time for. Id love to do more but maybe Ill comment again later if I can."},{"name":"Thurnaz \"Stormchaser\" Gathakanathi","genderRaceOccupation":"Male Goliath Cleric (Tempest Domain)","description":" He always felt an affinity for foul weather, so one day he left his family and followed the storms around the mountains. One day, he came across a shrine below a statue of a storm god, with a chest. The chest contained armour, robes and weapons, all marked with the sign of the storm (lightning bolts, wind and clouds). He believes that the storm spirits chose him for great things."},{"name":"Keranth Arbright","genderRaceOccupation":"Male Human Wizard","description":" Keranth is about 68 years old, has a heavily lined face and long white hair and a short beard. He tells people this: He has spent the majority of his life on purely theoretical studies of the arcane, and has recently sold his house to go travelling. The truth is this: He is a necromancer, whose spellbook is his own flesh. Spells are tattooed onto his body using the blood of innocents as ink. The main hint of this is that he does not have a spellbook. He is a generally kindly fellow with a cheerful attitude to life, whenever in company."},{"name":"Jeorg Spravahich","genderRaceOccupation":"Male Orc Weaponsmith","description":" Some people, upon entering the weaponsmiths trade, settle for reliability and a steady income by manufacturing swords, axes, shields, the usual. Not Jeorg. Jeorg specialises in experimental seige weaponry, with emphasis on \"mental\". Ballistae which fire smaller ballistae, giant crossbows which fire metal shrapnel in almost every direction, trebuchets with a range of several kilometers but fall apart every time you fire them, he makes them all. And as he watches the test-shots, he laughs a deep hearty laugh that hints at the insanity within. (Based on this guy.)"},{"name":"Yuguhhurukk Rachhanahhach","genderRaceOccupation":"Male Gnome Barbarian","description":" It is not exactly certain that his name really is \"Yuguhhurukk Rachhanahhach\", everyone simply assumes that it is because that is what he introduces himself as. His speech is distorted, however, by the ritual piercings of a member of his tribe who is on a Blood Quest. This piercing takes the form of a relatively large iron bar passing through both cheeks, impaling the tounge in passing, with symbols of his god on the end of each bar, holding it in place. He also abhors writing, making communication all but impossible. He has settled in the countryside far from his homeland, as some unknown incident has erased his memory of the details of Blood Quest, he only remembers that he is on one, and that the bar may not be removed before it is complete. His speech is incomprehensible. For example, \"Can you direct me to the nearest tavern?\" becomes \"Chlaag urghh urechh ee oo aa eggaech aggerrr?\""},{"name":"Kimberly Parish","genderRaceOccupation":"Female Vampire Innkeeper","description":" Kimberly tends a bar in a dive town, and yet somehow the bar patrons are unusually quiet and docile once through the doors. Unlike any other inn in town, disputes are settled calmly, fights are unheard of, and lewd behaviour is nonexistent. This may have something to do with the covered bite marks on the patrons shoulders, and what may be hidden behind the scarf Kimberly keeps wrapped around her neck."},{"name":"Vonrick the Valient","genderRaceOccupation":"Male Human Paladin/Knight","description":" Vonrick is the quinessential knight; he is tall, strongly-built and honourable as well as charming. He only hopes that none find out his gifts with the sword and lance came as a deal with a demon. The price was the life of his own brother, who Vonrick led to the lake and drowned as a young teen."},{"name":"Old Obert","genderRaceOccupation":"Male Human Wizard","description":" While Obert is pushing 100 years of age, he will vehemently argue any claims that his abilities are dwindling. He spends most of his time alone in his tower outside of the village, trying to perfect a spell he had dreamed of years ago."},{"name":"Peter of the Old Order","genderRaceOccupation":"Male Human Cleric","description":" Under his cream-coloured cloak and old roughspun tunic and with his gentle way of speaking, one may confuse Peter as a man against violence. However, he is a recruiter for one of the strongest military-churches in the land and had no qualms against wielding his hammer against those he sees as sinners."},{"name":"Sir Michael Mill","genderRaceOccupation":"Male Human Sword-fighting instructor","description":" Michael showed great promise with the sword in his youth, and was even knighted for his efforts in battle. However, at the age of 21, he stepped in a bear trap. The foot became infected and it was amputed. He now trains the younger boys in his town on swordplay."},{"name":"\"Lute\"","genderRaceOccupation":"Male halfling Bard","description":" A travelling singer and lute-player, simply known as \"Lute\". He chooses to follow adventuring parties for inspiration for new songs."},{"name":"Ella \"Nightstinger\"","genderRaceOccupation":"Female Half-elf Archer/Hunter","description":" Growing up as a Half-Elf in a Human village can be difficult enough, especially when one wants to become the first female hunter. However, her ability to hunt at night has earned her the respect of the others."},{"name":"Keltrin","genderRaceOccupation":"Female Human Warlock","description":" Cloaked in blacks and reds, Keltrin always seeks out new cities to perform her dark magic. For a price, one can borrow her skills, but there is no knowing when your payment will be finished."},{"name":"Quiet Ben","genderRaceOccupation":"Male Human Bodyguard","description":" Three things make Ben the outstanding bodyguard that he is: his bear-like stature, his loyalty to his employer and the day his father cut his tongue out for humiliating him in front of a Prince."},{"name":"Maggie Bluestream","genderRaceOccupation":"Female Half-Elf birdkeeper","description":" Maggie is a Half-Elf. She understands that there are those in this world who do not take kindly to species-mixing. Her brother had warned her as much before he was captured in a raid when they were young. She has cut off the points to her ears, takes in the sun as much as she can, and plays the fool when she hears Elvish being spoken. She dresses herself in Human clothing, and has stopped practising any customs from her childhood. She has been put in charge of the messenger-pigeons for the Baron, and prays that one day she finds Elves contacting him, so she may try to find a home with people more accepting."},{"name":"Khyban","genderRaceOccupation":"Female Dragonborn General","description":" Khyban was never meant to become a General. She had six brothers, all of them strong and capable of command. It was Khyban\u0027s lot to work with potions, or inter-clan diplomacy, or to help raise the younglings of her brothers. Dragonborn clans don\u0027t often look kindly on those who reject the role given to them. But when a Dragonborn returns home one night displaying the severed head of a Hill Giant, before they have even fully reached adulthood, it is impossible to ignore them. Khyban knows how to reward captains and soldiers who please her in battle. Displeasing Khyban rarely happens now."},{"name":"Sir Annory Garfield","genderRaceOccupation":"Male Human Captain","description":" Though his family name does carry importance in the kingdom, there isn\u0027t a knight who thinks Annory has earned the respect himself. Sir Annory has notoriously been part of battles that were already largely won, or were an easy victory. He has always requested to be stationed near less-troublesome areas. However, none of this works to lessen his arrogance, and he will inflate his achievements in battle whenever his honour is questioned."},{"name":"Darber Claytop","genderRaceOccupation":"Male Dwarf Diplomat","description":" Darber is perhaps the only famous Dwarf in the kingdom who didn\u0027t earn such fame with a weapon. His crowning achievement thus far has been his negotiations with Karg the Big. Karg was an Orc chieftan who had grown his war pack large enough to threaten the city. However, using his snakelike tongue, Darber was able to stave off the Orc invasion for four full days; enough time for reinforcement cavalry to arrive and smash the Orc host. Darber now works within the city as a highly-respected ambassador."},{"name":"Captain Bobbla of the Cerulean Shadow","genderRaceOccupation":"Female Halfling Pirate","description":" When she is in the company of other pirate captains, Bobbla will brag that her ship hasn\u0027t needed to seek a shore in over eight years. Her success with ship-raiding has been such that the sea provides all the treasure she needs. She leads her crew of Halflings in the long, blue-painted ship known as the Cerulean Shadow. If Bobbla wishes to remain unseen in a shadow, she will do so. If she desires that her ship remain unseen in broad daylight, it too will do so. No non-Halfling have ever survived once they step on Bobbla\u0027s ship, so the secret to the boat\u0027s stealth remains a mystery."},{"name":"Gretchen Farseer","genderRaceOccupation":"Female Human Soothsayer","description":" Gretchen was once a talented seer for her marshland clan. She had correctly predicted bandit raids, locust swarms, plague, lightning storms and even wars. Her predictions have saved her clan innumerable times, and for this she has been treated with great reverence within her clan. It is a shame that her talents have dwindled with her advanced age, however. It has been four years since she has claimed to see anything but the supposedly incoming \"ocean of fire\"."},{"name":"Elena Redlegs","genderRaceOccupation":"Female Human Goblin Queen","description":" Goblins attacker her village. Her daughter was killed in the raid by a Goblin chieftan. She begged her king for help, but none was provided. So she took her kitchen knife, sneaked into the Goblin cave, somehow found the sleeping chieftan and took his head. She was found soaked in his blood, and carrying his head. For this, the Goblins kneeled to her and proclaimed her the new chieftan. For the past two years, Elena has led raids with her ever-growing Goblin clan on her former king\u0027s outposts for revenge of his inaction."},{"name":"Handsome Andre","genderRaceOccupation":"Male Human creeper","description":" I can offer some that were discontinued from previous campaigns that I liked: An expert marksman who could thread a needle with an arrow at 100 yards despite only being 13 years old. Will no doubt be a legend in years to come. Very shy and has unfortunate bumfluff. Physically quite weak, and cannot finish a sentence without his voice cracking. Once was nearly killed by an Owlbear. Well known in his small town for bringing home large game from hunts with expert killing blows. Andre is a 1/10 ugly creepy dude with a smoking hot 10/10 wife. He was given the ironic nickname \"Handsome\" after he married his extremely attractive and loyal wife who is beloved by the town. Unknown to the townsfolk Andre made a pact to sell his soul to a demon when he was young in order to make his high school crush fall in love with him forever. (In my game he was a warlock but he doesn\u0027t have to be) He was an adventurer for several years, and uses the money he earned to make a living as a patron of local sculptors, masons and painters, paying their living expenses for an extortionate proportion of the profits from their work."},{"name":"Thaemos Leafstrider","genderRaceOccupation":"Male Wood Elf Priest","description":" A handsome elf with golden hair and an uneasy smile. He is sympathetic to those who suffer, but he is very cautious to meddle in others affairs: \"That is nature\u0027s way.\" He is (or was) the caretaker of a sacred place, deep in an ancient forest. He is loathe to share the secrets of that place."},{"name":"Mairiel Moonblossom","genderRaceOccupation":"Female Wood Elf Druid","description":" Long, silky amber hair frames the elf-maiden\u0027s sharp features and deep blue eyes. She lives lonely, even by wood elf standards. She spends most of her days meditating in a remote sacred grove in an ancient forest that is filled with terrors. She knows many secrets of the forest, but the promise of uncovering its deeper secrets can draw her away from her sacred grove."},{"name":"Eloranae Mistdancer","genderRaceOccupation":"Female Wood Elf Ranger","description":" The elf wears a dull cloak clasped beneath her chin with a brooch of swirling crystal; her iridescent green eyes gaze wistfully as her platinum hair flutters gently in the wind. Eloranae has been walking to the ends of the world, looking for what few wood elves remain. She is the last of her house and carries an immense sorrow behind her eyes. She is a true friend, but unleash\u0027s an incredible fury upon her enemies, sometimes waiting decades or centuries before the opportune moment to take revenge."},{"name":"Corian Leafstrider","genderRaceOccupation":"Male Wood Elf Scout","description":" The blonde elf tosses his hair over his shoulder and stifles his laugh long enough to take a swallow of wine from the skin that hangs about his neck. When set on a task, Corian will carry it out with unerring determination; his family sometimes jokingly chide him as \"Half-Elven,\" suggesting he may carry the blood of men within him. When not on a specific mission, Corian is a merry companion; keeping company mostly with men and halflings in the travelers\u0027 camps in the forest or at the travelers\u0027 along the road. His family, especially his brother, thinks Corian is a troublemaker; the truth is Corian feels the sadness and loss that others do, perhaps more sharply, and he drinks and makes-merry so as not to be consumed by the gloom."},{"name":"Cirthoeil II of House Darkwater","genderRaceOccupation":"Male Wood Elf King","description":" A muscular elf with golden brown hair and a grim countenance. Cirthoeil has reigned as the King of the Shadowwood for centuries, though few outside his woodland realm have ever heard of him; he is a just ruler among his people, but he is not kind to outsiders. In his youth, he traveled widely and fought bravely against many earthly and otherworldly evils. Possessing no magical gifts of his own, he is especially jealous and suspicious of spellcasters or those who carry items of great magical power with them."},{"name":"Winnie \"The Pixie\" Shoemaker","genderRaceOccupation":"Female Human Harlot","description":" This petite, sleepy-eyed brunette was beautiful once, and she can still enchant: It\u0027s in the way she moves. Winnie has had a hard go of it, she rarely laughs anymore, and no one seems to know where she grew up. She\u0027s been a staple of the taverns and brothels of the River District for years, and she\u0027s notched some impressive tricks into her belt: Fearsome outlaws, well-known ship captains, wealthy merchants, and \"the world\u0027s greatest thief.\" She used to be the life of the party, but the joy of ale and wine have begun to wane, as does her beauty."},{"name":"Aldorn Braxton","genderRaceOccupation":"Male Human Thief","description":" A dark-eyed man with a winning grin scans the room with his keen eyes. Aldorn is a treasure-hunter, a thrill-seeker, an excellent friend to those who will lead him to opportunities for gold and glory. He claims to be the \"world\u0027s greatest thief,\" and he\u0027s well-known in the low districts and in high society alike, though he\u0027s not always welcome in either. Aldorn is quick to draw on his wits and his knife for any who doubt his claims, but he knows when to run: \"The better part of greatness is staying alive.\""},{"name":"\"Hobo\" Tim","genderRaceOccupation":"Male Human Drunk","description":" A portly man with several tattoos mumbles incoherently from under his long, unkempt grey beard. The people of the River District call him \"Tim,\" and he answers, but no one really knows his name (of course, they call him \"Hobo,\" and he answers to that too. He is usually harmless, mumbling about needing coin at passers by; erratically, he will last out with racist tirades, particularly directing them at dwarves. He has been stumbling around the River District for at least fifteen years; although it\u0027s not clear if he even knows who or what he was before then, he does sport an unusual tattoo of a man-spearing-a-shark-eating-a-dragon-eating-a-dwarf."},{"name":"Sir Ayrin Favager","genderRaceOccupation":"Male Human Knight","description":" Sir Ayrin clanks about in his steel armor, carrying a warhammer, a shield, and a holier-than-thou attitude. He grew up as a commoner, a blacksmith\u0027s apprentice, but he was raised up to knighthood after he saved a powerful lord\u0027s son in a skirmish with a rival at a tavern. Sir Ayrin had been proud of his work at the forge; now he\u0027s even prouder of his elevated social rank. He tends to be suspicious that people are cheating him; after being offered the position of knight, he first refused believing the lord\u0027s messenger was mocking him."},{"name":"Ole Moonsen","genderRaceOccupation":"Male Human Sailor","description":" Atop Ole\u0027s big frame sits a red-round head with dark, short-cropped hair, dark stubble of a beard, and watery blue eyes. He has sailed on trading vessels up and down the coast for several years. Ole tends to be forgetful about details, but he\u0027s reliable enough when it comes to the tasks aboard a ship. He loves to share bawdy stories and jokes over some wine or ale, and once he starts drinking, he rarely stops until he\u0027s snoring."},{"name":"Baris Tyrento","genderRaceOccupation":"Male Human Sheepherder","description":" Unshaven and unwashed, Baris stinks of sheep and looks even worse, clad in filthy leathers and a ragged cloak. He owns a few dozen sheep and scrapes a living off sale of wool (and occasionally mutton) that he trades with the merchant caravans that venture far enough north to pass his homestead. Ever since he caught a caravan guard flirting with her, Baris fears that his pretty young wife will leave him for someone more handsome and dashing. Baris was twice before, but each of his previous wives left him childless when she died."},{"name":"Iliana \"Illy\" Portnoir","genderRaceOccupation":"Female Human Assassin","description":" Illy is a beautiful dark-haired woman with a small but athletic frame and lips that were made for kissing. She lies about everything: \"Don\u0027t trust me,\" she coos with a wink. She hires her services (many as they are) out for a steep price, but she always delivers: \"No one does it better than me,\" she says with a sweet smile. Most kills are strictly business, but some kills she enjoys, as she seeks the men who killed her father when she was a girl."},{"name":"Gerwac, the Knowing","genderRaceOccupation":"Male Human Wizard-Headmaster","description":" Few have seen the face of the headmaster of the Steelmoon Academy, but those who have describe him as a thin man with an unsettling gaze. He spends much of his time in the seclusion of his study; on occasion, he visits the school\u0027s library or walks the grounds, wearing a heavy black cloak with a hood drawn about his face. Nothing is known of Gerwac before he founded the school a few decades ago, choosing what is believed to be a haunted mountain for its grounds. His school is as secretive as he is; little is known about the school to those outside it, and it is whispered that the students fear him tremendously."},{"name":"Daek Obskur","genderRaceOccupation":"Male Human Curio-Shopkeeper","description":" The spry old man has silver gray hair and whiskers and ruddy skin stretched across his long hooked nose and the rest of his bony face; he eyes his customers keenly. \"Welcome, welcome! May I collect the dust from your feet? Travelers\u0027 feet are full of interesting sands and lints from far off places—quite useful for magic.\" The old man doesn\u0027t wait for an answer but drops his book and scrambles over the counter to begin collecting dirt from his customers\u0027 feet, collecting it into small glass vials. He is cautious about local laws, but he knows a good customer when he sees one; he raises his voice speaking loud enough that anyone out on the street could hear him, \"Though I don\u0027t know how to do any magic myself.\""},{"name":"Torrek Holdeger","genderRaceOccupation":"Male Dwarf Armorer","description":" The dwarf pensively strokes the long dark brown braid of his beard; his other hand rests atop the hammer strapped to his belt. Torrek is a perfectionist; trained by a master craftsman, his own skill exceeds that of his former mentor. Since becoming a refugee after the destruction of his kingdom, Torrek has been reduced to taking on journeyman work at various forges. Torrek would like to settle some place quiet where he can open his own forge; he hates the city."},{"name":"Torgrim Holdeger","genderRaceOccupation":"Male Dwarf Soldier","description":" The dwarf clad in mail carries a large battleaxe; his long black beard is tidy and combed out straight. Torgrim learned some rudimentary healing skills while serving as a soldier to his king; he never had the patience to study the healing arts properly. Since the goblin horde over-ran his kingdom, Torgrim has taken on a variety of jobs as a mercenary or enforcer. Torgrim is fond of drinking, carousing, and fighting; he enjoys life in the city."},{"name":"Jurk Ironbiter","genderRaceOccupation":"Male Dwarf Berserker","description":" The dwarf seems to be staring at nothing, his auburn beard a wild tangle; then he stares right at you. Jurk\u0027s gaze is unsettling, he rarely speaks, and he is fearless in battle. His grip on sanity slipped after seeing the goblins smash his king\u0027s army and take the king himself. Jurk will fiercely defend the honor of his fallen king at the least provocation."},{"name":"Cirolas Summerstar","genderRaceOccupation":"Male High Elf Storyteller","description":" The lanky, brown-haired elf looks about with his wide green eyes, taking in everything. He knows the histories and songs of many peoples and places, their legends and their endings, and can tell their stories so they are all-at-once epic, personal, comedic, and tragic. He knows how to tell a story, but he also knows how to listen for one: \"And then?\" nodding eagerly. He belongs to an ancient and noble house and is seeking some secret piece of lore."},{"name":"Jelenneth Wintermoon","genderRaceOccupation":"Female High Elf Oracle","description":" The sight of the thin blonde elf with brilliant blue eyes and a faraway gaze fills you with a pang of loss. She has watched the stars for centuries; she knows the doom they foretell and it fills her with sadness. Jelenneth longs to uncover new portents and omens that contradict what she has foreseen. She is often distracted from the most pressing questions by the opportunity to learn something new by following a tangential train of thought."},{"name":"Thrakk, the Chief of the Palefists, Lord of Eastern Horde, Slayer of Men, Eater of Elves","genderRaceOccupation":"Male Orc Warlord","description":" Thrakk is bigger, meaner, and smarter than the other 10,000 orcs of the Eastern Horde; don\u0027t get in his way. He ascended to chief of the Palefist clan at a relatively young age by stabbing the previous chief through the back with his blade, cutting his heart out, and devouring it; ever since, he\u0027s been uniting the Eastern clans through a combination of intimidation, bribery, slaughter, and lies. Thrakk has aspirations to drive the Eastern Horde over the mountains to invade the Western Kingdoms; if he can and if he adds the Northern clans to his horde, he may well conquer the world. If you meet Thrakk, chances are you are already dead and on his dinner plate; if you\u0027re alive, he must see some use for you, and he\u0027ll most likely kill you when that use has expired."},{"name":"Kuranath","genderRaceOccupation":"Male Half-Orc Pit-Fighter","description":" Scars cover much of his nearly hairless head and neck, and he often cradles an oddly shaped brass knuckle in his hand. He enjoys being around people, but he is often silent among them. He is an escaped slave, and he is frightened that his cruel former masters may find him: \"I never stay in one place too long.\" He despises fighting in the pits, but it\u0027s all he\u0027s ever known, and he wins."},{"name":"Lurg","genderRaceOccupation":"Male Half-Orc Thug","description":" The half-orc\u0027s dark eyes dimly follow the fly that has been attracted to his revolting scent, as he lines up to swat it with his club. Lurg is big and stupid, but he can follow simple instructions well enough. He will readily follow anyone who promises him the opportunity to smash things, taking greater satisfaction from this than from anything gold can buy. Lurg is easily distracted by food, and he is particularly fond of wines and pungent cheeses."},{"name":"Gaeryon Vyn Dordevetym","genderRaceOccupation":"Male Human Merchant","description":" The cloth merchant laughs nervously as he wipes the sweat from his brow with a lace-trimmed silk handkerchief. Gaeryon is a member of a wealthy merchant family who owns the exclusive a share of rights to export of the cloth produced by the weavers\u0027 guild in the city. He travels the roads in a yearly cycle with a small cadre of guards and a man-servant, purchasing raw wool from rural sheepherders and bringing them cloth and a handful of other dry goods produced in the city. Gaeryon is friendly but he despises travel: if he had his way, he\u0027d work in the family\u0027s offices and stay at home with his wife and children year-round."},{"name":"Sir Roderick Chansym","genderRaceOccupation":"Male Human Knight","description":" Sir Roderick, handsome, tall, and blonde, stares at you with some of the sweetest blue eyes you\u0027ve ever seen. One of the king\u0027s boldest knights, Sir Roderick has gained renown throughout the realm for his brave deeds. He rose to prominence by winning the princess\u0027s name day tournament: there is a rumor that he harbors a secret love for her. Sir Roderick plays the part of the pure and genteel knight well, but he\u0027s actually quite a rake when he thinks no one from court is watching."},{"name":"Valaerys Nightspear","genderRaceOccupation":"Female Dark Elf Warrior","description":" Silver-haired with sharp features, Valaerys fled from her home in the Underdark after attempting to spirit away a pair of frightened young human girls who had been taken as slaves during a surface raid. Moved by compassion, she managed to help one girl escape, but the other was run down by her former comrades in the attempt. Having been seen in the attempt, she had no choice but to run or to face death, as would have been the punishment meted out by the spider priestess. She and her young companion have been wandering the shadow lands for 15 years now, taking on what small quests they can while avoiding encounters with other dark elves at all cost."},{"name":"Mirmarye \"Mimi\" Sohuster","genderRaceOccupation":"Female Human Assassin","description":" As a young girl, dark elves raided Mimi\u0027s village, kidnapping her and her sister. Mimi escaped with the help of a dark elf warrior, who has since served as her guardian and companion while they wandered the shadow lands as refugees. Growing up on the move and among the rough and the lowly, Mimi became quite good at sneaking, stealing, and knifing her way out of many desperate situations. Mimi has grown to be a beautiful dark-haired young woman, but she is grim and pessimistic, harboring suspicion against strangers, especially human men and all elves, except for her companion."},{"name":"Sister Niradella Tariskoff","genderRaceOccupation":"Female Human Priestess","description":" Hailing from the North, Niradella is the winter fury, the cold wind that cuts to the bone; her icy stare hides the true meaning of her words. Her widowed mother, unable to support her, left her to be raised as an initiate in to the Storm King\u0027s Temple of Winter as a small girl. By the aid of her instructors and her Northern blood, she has grown powerful: well-versed in magical lore, skilled in the healing arts, capable of manipulating the forces of winter, and deadly to the temple\u0027s enemies. Though loyal to the temple\u0027s hierarchy and purposes, Niradella does not know how her father died nor what became of her mother; the chance to uncover these truths could tempt her to break her vows."},{"name":"Thia Gallytuck","genderRaceOccupation":"Female Halfling Innkeeper","description":" A pleasingly plump halfling with a long, dark braid, and a welcoming smile. Thia is a nurturing soul who loves to cook for her guests: They say she makes the best pies this side of the old forest. She runs (or ran) an inn that belonged to her father in a small riverside village. A heartbreaking fate befell her sweetheart, and she sometimes drowns her sorrows in ale."},{"name":"Tom Watters","genderRaceOccupation":"Male Halfling Ferryman","description":" A friendly little chap with an unfortunate scar in the shape of an onion on his left cheek. Watters poles the ferry that serves as the primary crossing for the river at the edge of his village; he enjoys talking to travelers. When he\u0027s not at the ferry, he\u0027s probably out walking the woods--a practice he finds therapeutic since he gave up gambling. He owes a considerable gambling debt to a bandit: Occasionally, the ne\u0027er-do-well presses him to ferry him across the river in the dead of night as a favor."},{"name":"Finnan Wetherwise","genderRaceOccupation":"Male Halfling Pickpocket","description":" The halfling scowls into his mug of ale, bushy brown eyebrows arching over dark brown eyes. Finnan will lift anything of value that is not tied down, and he may even try to take some of those things as well. He is loyal to his friends, but he is not keen on making any new ones. When he spots something valuable, Finnan will brood and stare at it until he can work out how to lift it."},{"name":"Baznar Metalshine","genderRaceOccupation":"Male Halfling Sheriff","description":" The ruddy-faced halfling puffs out his chest and reaches for the shortsword at his belt and marches in your direction. The son of a gardener, his parents named him Barnabas Arthor Tinsparkle at birth; he started calling himself Baznar Metalshine as a youth because he thought it sounded tougher than Barney Tinsparkle. Though generally well-intentioned, Baznar can be a bit of a nosy, self-righteous ass. Baznar knows everything about everyone in the village, but if you call him \"Barney\" you can forget about getting any help from him."},{"name":"Male, Human, Ships Captain","genderRaceOccupation":"Arnold Johnson","description":" He owns the Jolly Sailor a rag-tag ship with a sloppily painted pink stripe with the ships name on it. He has a big blonde bushy beard and a head smooth as a bowling ball, with some sapphire eyes to top it off. He is a jolly fellow who employ a band to play at the helm of ship while his men sing songs as they row. He\u0027s Arnold Johnson merchant extraordinaire."},{"name":"Rick Dane","genderRaceOccupation":"Male Human Wizard","description":" Rick is a very successful, middle-aged wizard. He lives in his own pocket dimesion which resembles a big mansion surrounded by a forest. He lives in the mansion alongside his tamed imp servants. His wife is a kind female djin, who he met while foraging for alchemy ingredients. He fell head over heels for her. In his early days rick was an adventurer. His reputation got him invited to the League Of Extraordinary Adventurer."},{"name":"Sharom Virak","genderRaceOccupation":"Male Human Shopkeeper","description":" Sharom is calm and pensive, his gaze seems attentive but sad like something is missing from his life. Sharom is haunted by the memories of loosing his wife, Parsala in one of the many raids that the town has had to endured. Sharom used to be happy and gleeful, until the day they took his wife. As a shopkeeper, he is patient and tries to explain what things are to adventurers who have never seen certain items. Additionally, Sharom is trying to teach the business to his only son, Shendi."},{"name":"Shendi Virak","genderRaceOccupation":"male human shopkeeper apprentice","description":" Shendi is distracted, oblivious and forgetful. His father has explained him time and time again how much things cost and what they are, and he sometimes forgets. Shendi loves new visitors and will ask them all kinds of questions. Unlike his father, he is charismatic and doesn\u0027t gloom over the loss of his mother as frequently. Shendi is good at names, that much he remembers and if adventurers tell him where they are going, the next time they return he will ask them about their travels and sit and talk with them for a while. Shendi dreams of being an adventurer, and has tried to get his father to teach him how to use the weapons they sell to no avail."},{"name":"Theomund Tarley","genderRaceOccupation":"Male half-Elven drunk tinkerer","description":" Slender half elf in his mid thirties. Patchy beard, unkempt black hair and a dirty straw hat. Wears a sleeveless white shirt, is usually seen carrying around a messenger bag containing all his tinkering tools and a ceramic jug full of moonshine . Keeps himself drunk at most times, swears loudly and often and tends to get himself into trouble at the tavern during his free time."},{"name":"Ragnar Rödhake","genderRaceOccupation":"Male human ex-marauder, now town guard","description":" Large man with long, braided, red hair and a well-kept full beard. Usually seen in his armor walking around town telling people about his past exploits. Slight limp on his left leg due to an injury he sustained in one of his adventures."},{"name":"Byrone Fjorder","genderRaceOccupation":"Male Human River Guide/Priest","description":" A priest to the local River god, Byrone is a kind, albeit gruff, soul with oily skin, dark features and a bushy beard. He always gets you where you need to go, but is rarely hired as some of the priests in his religion are known to drown passengers as sacrifices to the river."},{"name":"Taleros Twinblade","genderRaceOccupation":"Male Human Mercenary","description":" A young, handsome mercenary who wears gold-dyed plate armor and wields two swords at once. He\u0027s a real bravo, but has a caring heart of goldas resplendent as his ridiculous armor beneath it. He\u0027s more of an ass-man."},{"name":"Herra Geralt","genderRaceOccupation":"Female Half-Elf Noblewoman","description":" Her hair is long, black and thick and is always covering her ears. Her elven heritage is hidden from other nobles at all times and she\u0027s ruthless in her efficiency to eliminate anyone who knows her secret. She wears blouses with skin-tight leggings and is seen carrying a stiletto strapped to her thigh wherever she goes."},{"name":"Muran and Nuran Rockbeard","genderRaceOccupation":"Male Dwarf Smiths","description":" Muran and Nuran are identical twins and have opened up a weaponsmith and armorsmith across the street from each other. Muran always tells customer\u0027s that he\u0027s the handsome one and loves to call Nuran an \"old fool\" because he\u0027s about 3 minutes older than him. They love to cause mischief and headache for each other and laugh raucously over a beer or ten about it later, but would do anything to protect the other if it was called for."},{"name":"Tenarus Sinsword","genderRaceOccupation":"Male Tiefling Extremist","description":" Tenarus travels the lands, making trouble for authority and peasants alike in the name of Tiefling racial superiority. He calls for his brothers and sisters to rise up and reclaim the glory they once had. His antics and actions rarely lead to success, and is often arrested. He always shows up again in another town, raising hell, and nobody knows how he always manages to escape."},{"name":"Mara Heskan","genderRaceOccupation":"Female Dragonborn Crusader","description":" Mara is a Paladin of Bahamut, and is actually Biri Bahamin, eldest daughter of the Grand Justicar of a powerful Theocracy. She is on a secret mission to obtain a tome of history pertaining to an ancient cult of Tiamat. She is stoic and serious, but still young and inexperienced. She is sometimes a little ham-handed in keeping her identity straight."},{"name":"Kar Olodak","genderRaceOccupation":"Male Tiefling Clothier","description":" Kar Olodak and his sons Belkul and Oti run a clothing store. Kar Olodak wears dirty clothes that he has been working in, he is a hale but boring man, more focused on his work than conversation or customers. Kar plays the lute in the local band, Mithril Maiden."},{"name":"Darella Runehouse","genderRaceOccupation":"Female Dwarf Blacksmith","description":" Darella Runehouse, noted for her ability to play the drums and a large birthmark on her neck. She is strong and able, but a little absent-minded when she isn’t working. She has a complex network of connections between local towns that she needs a notebook to keep track of. She is also a member of Mithril Maiden."},{"name":"Jam Blackwood","genderRaceOccupation":"Male Goliath Barkeep","description":" A shady, run down bar, the Staggering Spider, is run by an older Goliath names Jam Blackwood. His nose appears to be broken several times over, but he is a strong, but rather uneducated man. Despite his gruff appearance, he is actually great with kids. He also plays the violin for Mithril Maiden."},{"name":"Wal Axehand","genderRaceOccupation":"Male Minotaur Baker","description":" Wal Axehand is an eccentric and energetic Minotaur who runs the local bakery. He is tall and incredibly muscular, and despite his intimidating appearance, he goes about his work with a happy smile and a pleasant and jovial demeanor. At night, he dons leather chaps and sings for the local band, Mithril Maiden."},{"name":"Lora Olyonis","genderRaceOccupation":"Female Human Entrepreneur","description":" Lora runs the Olyonis Carriage Company, a large, multi-city transport company that makes a living transporting people and goods between cities. She is serious and shrewd, but always fair. Her carriages use advanced defensive technology and spells to conceal and protect them."},{"name":"Oleg Olegson","genderRaceOccupation":"Male Human Mayor/Shopkeep","description":" Oleg is a large man, often mistaken for a Goliath in size or Minotaur in hair, but he is incredibly boisterous and kind. He speaks in a thick Russian accent that makes him seem dimwitted and easy to exploit, but he is powerful and intelligent. He lives on the frontier, hoping to rebuild the town of his forefathers that was destroyed in a great war years ago. He always has a business proposal or quest ready for adventurers he considers competent and reliable."},{"name":"Thangardt","genderRaceOccupation":"Male Duergar miner","description":" Thangardt is a dark purple skinned duergar with soot-stained brown miners clothing and a pair of magical goggles that hang around his neck when not worn. The goggles are basically x-ray goggles that can see metal through rock (and other materials). He has the intention of using these newly found goggles to establish a new mining company. He is friendly with anyone that he might want something from, and often chooses to avoid those he doesn\u0027t need anything from."},{"name":"Reginald","genderRaceOccupation":"Male Human Ghost Butler","description":" Reginald is a ghost that haunts an old broken down abandoned mansion on the Rasch estate. The owners of the home have fallen victim to a grizzly murder years ago, and Reginald was also one of the victims. Reginald is completely in denial of that though, and he still acts as the butler (his profession before his demise) and is welcoming of any company that enters the home or grounds. The previous owners, however, aren\u0027t as welcoming..."},{"name":"Vyncis Castow","genderRaceOccupation":"Male Human Politician","description":" Vyncis has worked his way up the political ladder from being just a clerk in the permits office of the city of Alma. Despite only being about 32, he has made his way onto the city council and is a well liked and respected man in the city. He has jet black hair and usually dresses in Maroon robes. Vyncis has many associates, sometimes that obtain information and goods in less reputable ways that Vyncis would care to admit publicly. He uses subterfuge to obtain what he desires, power."},{"name":"Bertrand the Bear","genderRaceOccupation":"Male Bear Hunter","description":" To a degree he is inspired partially by Sir Bearington. Bertrand was a bear that was found abandoned by a dryad named Sylva. He was raised by the dryad and they would converse as he grew up. Sylva taught him the ways of the forest. A group of hunters encountered Bertrand and tried to kill him once. Sylva tried to stop them but ended up being mortally wounded by the hunters. Now Bertrand has an extreme hatred for those that hunt the forest creatures, and he actively hunts the hunters in the woods."},{"name":"Blackie \u0027Lefty\u0027 Smith","genderRaceOccupation":"Male Human Blacksmith","description":" Blackie is an albino blacksmith that has no left hand. He is in the business of selling fake/shoddy specialized weapons to adventurers (such as silvered weapons), then collecting those weapons (and all their other loot) from the dungeon/haunted house/other dangerous area that the adventurers bought the weapons for after they have been killed. Sometimes he\u0027ll act as a catalyst in these situations by following the adventurers and putting them in a position to die."},{"name":"Michael Jorin","genderRaceOccupation":"Male Human Travel Bard","description":" Thikear is the pride of Deln. His wares are sold through the world, and he knows it. He will always remember his own creations no matter the quality. His only goal is to further is own notoriety. Michael travels the known world collecting stories and giving voice to the little known heroes. He is a wanted man for his sexual prowess. Many fathers wish to see him brought down after his dalliances with their daughters."},{"name":"Jorakus Pide","genderRaceOccupation":"Male Human Monk/Cleric","description":" Was once destitute and faithless, worked odd jobs, including sewage. On one cleanup, found an octagonal yellow gem that he believes is the eye of the long-dead god, Kraxos. He is now on a one-man mission to restore the faith of this ancient deity. Travels from town to town, preaching his faith."},{"name":"Ana Englethorn","genderRaceOccupation":"Female Human Swordmistress","description":" Tall and stately, and widely acknowledged as beautiful, Ana Englethorn is not the image of a warrior one might expect of the Swordmistress of Firthring Keep. Yet her skill at arms is not in question, and the Duke entrusts to her the training of all his soldiers and his children. The Duke knew Ana as an adventurer before he came into his title, and rumours abound that with the passing of his wife the rekindling of a past romantic interest may be in the offing. There is no evidence to support the rumour, but gossip has a life of its own. Ana is actually a song dragon named Anazalgara, a secret of which the Duke is well aware."},{"name":"Forthright Hooley","genderRaceOccupation":"Male Human Ombudsman","description":" Forthright likes to tell people that his father believed in openness and honesty, and gave him both a name and a legacy to live up to. He lives in the city-state of [insert name here] where he is appointed ombudsman to the democratically elected council. His job is to see to it that citizens are treated fairly by the council and mediate settlement of any issues. As politicians go he is well-liked and hotly tipped to be appointed to the council itself should he run next term. Forthright claims to have come from elsewhere, but in truth, he is a steel dragon named Farvaskargal."},{"name":"Gardim Hussal","genderRaceOccupation":"Male Human Balladeer","description":" The well-meaning if pompous leader of a troupe of travelling entertainers, Gardim is modestly famous for his ballads, although he is past his prime. Once a rogueish ladies man who caused the ladies in his audience to swoon, he is now portly and balding, and of much less interest. He content himself with his art, his troupe, his memories, and much wine. He treats his troupe like family, and when it comes to his family he is generous with both his time and his trust."},{"name":"Hekkle and Mekkle (real names Horace and Mortimer Fallowfield)","genderRaceOccupation":"Male Halfling Jesters","description":" The two jesters of the Duke of Firthring Keep. Mekkle is cheerful and friendly, the favourite of all the court, especially the Duke\u0027s children. Hekkle, on the other hand, is dour of demanour. However, he is only this way because he\u0027s deeply unhappy, and all because of his brother. Their mother was cursed while they were still in the womb, and as a result Mekkle was born capable of great cruelty and evil. Hekkle doesn\u0027t blame his brother for something that was never his fault, but spends his entire life trying to cover up Mekkle\u0027s secret. He is constantly on the watch to prevent his brother\u0027s actions, or frantically attempting to either undo or conceal his brother\u0027s role in them."},{"name":"Kellis Synastal","genderRaceOccupation":"Female Gnome Secretary","description":" Kellis acts as secretary to Forthright Hooley, and greatly admires both the man and his work ethic. She is a very loyal employee, though it does not appear there is any romantic interest there. She has that stereotypical librarian look going on - hair in a bun, spectacles, and slightly frumpy clothing. Behind this unassuming exterior is an extremely keen mind, not to mention a sharp tongue. Kellis has no time to suffer fools, and will not hesitate to show someone the door if she considers them a time waster. She is a formidable gatekeeper that has thwarted many an individual seeking audience with her boss."},{"name":"Lavisca Lorde (real name Leia Larkin)","genderRaceOccupation":"Female Human Dancer/Spy","description":" Petite, dainty, and stunning, \"Lavisca\" is famed throughout the lands for her graceful and acrobatic dance routines. She travels with the entertainer\u0027s troupe of Gardim Hussal, and is without question the primary reason the troupe is so often invited to perform in courts across the continent. The troupe a perfect cover for her true business. She is a freelance spy, taking the opportunity while at court to go where she does not belong and dig into the secrets of the aristocracy. She can sneak around with the best of them, but most often gains entry into private chambers by a simpler method; flirtation."},{"name":"Manfred Black","genderRaceOccupation":"Male Half-orc Legal Historian","description":" The circumstances of his birth may have been tragic, and even his poorly chosen name acting as a frank reminder of what he is not, but Manfred grew up determined to make something of himself and be seen as a productive member of society. His keen mind eventually earned the attention of noted historian Berholt Black, who adopted and began educating him. Manfred was particularly keen on the law, its history, and its various manifestations in states around the world. He has achieved his dream, and is now seen as one of the foremost authorities on international law."},{"name":"Oskar Udyll","genderRaceOccupation":"Male Human Warrior","description":" Oskar travels with Gardim\u0027s troupe, despite having no particular artistic talent. He was brought on board as a guard after the troupe fell victim to banditry. While they know how to handle themselves, Gardim felt that an experienced warrior would do a lot to make the troupe look a less appealing target. He also trains the troupe\u0027s members, making them more proficient in defending themselves. Despite the troupe\u0027s attempts to make him part of the \"family\", Oskar is by nature taciturn and tends to keep himself to himself. Oskar comes from the Cold North, and complains about weather any warmer than temperate."},{"name":"Randle Wimms","genderRaceOccupation":"Male Half-elf Scribe","description":" Randle learned the art of the scribe in a monastery, but did not have the temperament for the life of a monk. After several masdventures he ended up in [insert city name], working as a forger for the Red Hand crime guild. He enjoys the money but not the risk, and is looking for the first opportunity to escape the city with a big bag of cash."},{"name":"Rodagar Ironthrone","genderRaceOccupation":"Male Dwarf Lutist","description":" Never satisfied with the life he had back home under the mountains, Rodagar never looked back after he moved away. He found a passion for the arts, and is an extremely proficient musician with great technical ability. Rodagar is part of the band who plays for Lavisca\u0027s act, and the first time he ever saw her dance he fell in love."},{"name":"Gavin Burlester","genderRaceOccupation":"Male Human Wizard/Wu Jen/Warmage","description":" An aspiring young mage who believes that magic missile is the greatest spell in existence. A passing mage saved his life with one almost as an afterthought (it was his last 1st-level spell slot), but to Gavin it meant the world. He vowed that he would do whatever it took to learn how to cast magic missile (and only magic missile) as much as possible for the rest of his life. He has a younger brother who\u0027s a failed necromancer, who looks up to him and is trying to make his own mark as an artificer."},{"name":"Devin Burlester","genderRaceOccupation":"Male Human Necromancer/Artificer","description":" Gavin\u0027s younger brother who wanted to learn magic like his older brother could do. Unfortunately, the only one available to teach Devin was an old necromancer in the depths of senility, so poor Devin didn\u0027t get the best education. While trying to animate a cat skeleton for practice outside a neighboring town one day, a female elf druid caught him in the act. Rather than immediately condemn him for his unnatural behavior, the druid offered him a chance to just drop the whole necromancy thing if he couldn\u0027t get the skeleton to animate. He couldn\u0027t, and so the druid connected him with the town artificer, who he is now apprenticed to. His early efforts are poor but he shows some promise."},{"name":"Heaton Thorson","genderRaceOccupation":"Male Human Figher","description":" An extremely short, bearded fighter with a penchant for alcohol. He often gets confused with a dwarf, which makes him extremely upset. His code of honor is overly long and complicated, with rules such as \"Only fight Goblins with a hammer, never a sword.\" Ever since he accidentally burned his family farm down, (\"Never kill a rat swarm with anything but fire\") he\u0027s been travelling, looking to regain some riches."},{"name":"Sir Kagrok the Hairy","genderRaceOccupation":"Male Orc Paladin","description":" The nicest Orc you\u0027re likely to meet, as he is deadly determined to prove to you that orcs can be good people. A bit simple-minded and slow, but far from dumb. Holds honour, virtue and above all mercy in the highest regard, and believes orcs are not beyond redemption. Talks in simple but clear terms."},{"name":"Ketil Brokenose","genderRaceOccupation":"Male half-elf blacksmith","description":" Been in several too many bar fights. Earns a decent living by shoeing horses; spends a lot of it on ale. An honest and good man, who answers insults with a punch. Regularly donates money to the local temple but never attends sermons; he doesn\u0027t want some priest telling him to drink and fight less, and figures a sack of gold every once in a while should keep the gods happy."},{"name":"Rivik the Fox","genderRaceOccupation":"Female halfling ranger","description":" Served as a scout in the army during \u003cinsert war or large scale conflict\u003e. Called Fox due to her stealth, keen senses, and her bright red hair. Literally left the army; one day she simply packed her things (and a few other people\u0027s things, but she left letters of apology) and snuck out of camp to start an adventuring career. Now lives a solitary life of travel and adventuring, living off of hunting and selling animal pelts and finding adventuring work whereever she can."},{"name":"Teresa Greenreeve the Bastard","genderRaceOccupation":"Female half-orc bastard daughter and bard","description":" Bastard daughter of Lord Greenreeve and an orc witch. Likes to boast and sing songs about her nobility and the might of House Greenreeve. Very unhappy with her life as a noblewoman, she struck out on her own to become a bard. Teresa makes a living by singing and casting spells at a tavern far away from Castle Greenreeve."},{"name":"\"Grobby\"","genderRaceOccupation":"Male \"domesticated\" troll farmhand","description":" A born and bred troll, found by two elven farmer kids when he was a lil\u0027 troll. Has a personality not unlike a dog; loves to work and please his masters, who reward him with treats. Very protective of his \"family\", yet doesn\u0027t like to kill people. Extremely helpful and kind, Grobby utilizes his strength and size to great effect at the farm."},{"name":"Tenzai the Lightningmancer","genderRaceOccupation":"Male tiefling druid-evoker","description":" Tenzai is fascinated by powers of destruction, specifically lightning. He lives in a ramshackle tree hut in a great oak tree in the woods where he studies the sky. Somewhat insane from isolation, his solution to most problems is to zap them with lightning. He is both a druid and an evoker wizard, as well as a brilliant scientist."},{"name":"One-eye","genderRaceOccupation":"Female Human Strumpet","description":" Taken from his people at birth by the humans, for they feared this \u0027exalted child\u0027 born of the elves. The elves, to save many sacrificed this one. Tall and hawkish, with a scarred face from years of rebellious actions, he has grown old, the humans who took him long since died of age. He has a photographic memory, he knows what you want, the question is if he cares enough to tell you. Raised in the Daddy-no-daddy orphanage on the outskirts of town One-eye began her life with a name, but since the incident the fuss about that has died down. Now because she\u0027s too old for the orphanage and too spoilt for marriage she walks the streets hoping to have a warm place to sleep at night. She has a massive scar through her left eye-socket is medium height with black hair and \u0027loose clothing\u0027, usually hunched a little and has a lilting eerie charisma to her. (I gots 4 holes, which ya want?)"},{"name":"Yvonne and Erica Strathmoor","genderRaceOccupation":"Female Human Innkeeper","description":" The Strathmoors are elderly innkeepers in kind of a shady part of town. The two mother/daughter and both advanced in age and nearly indistinguishable. No one, without expending some serious energy, has ever seen the two of them at the same time. They are soft spoken and gentle,, and turn a blind eye to the illegal activities happening within their inn."},{"name":"Facescar","genderRaceOccupation":"Male Human Thief","description":" High up on the food chain that is the Daggerford Thieves Guild. Has a scar in the shape of a smiling face, on his face. Speaks with a gravelly voice due to inhaling soot from his youth spent as a chimney sweep. Not above stealing from the poor, but tends to steal from the rich as they have better stuff."},{"name":"Helga Redeye","genderRaceOccupation":"Salty Pig","description":" Is somewhat ill-tempered and ugly, but secretly hopes one day a handsome adventurer will look past her physical flaws and love her for her true personality. Her true personality is that of an obstinate pig."},{"name":"Jennelles Silverstring","genderRaceOccupation":"Gnome Wizard","description":" A slightly crazy, but incredibly smart wizard who helps the party overcome challenges. However, his strategies are often dangerous, excessively complicated, and almost always involve the polymorph spell. He also builds magic items, though they are always questionably useful or sometimes horribly dangerous to use."},{"name":"Ronald the Shield Bearer","genderRaceOccupation":"Male Human Retired Adventurer","description":" A middle-aged possibly older man of a strong build. Ronald is an adventurer of the past generation and went on several heroic adventures. Though retired now he still helps out the adventurers cause. Motivating them with a story of his epic and daring quests, providing a first hand advice on a situation, or even helping defend the group with his signature duel shield style of fighting. If you spot the man carrying two shields ask him for a story he\u0027s sure to entertain you with a great one."},{"name":"Howard Jackal","genderRaceOccupation":"Male Half-Orc Bandit","description":" Howard Jackal for the most part of his life he has been a bandit. While never being successful or even very deadly he has always been a nuisance. His bandit group named the Jackals has fallen more times than people would care to count, but he always reforms it with young enthusiastic men. It seems that he has a terrible ambition of becoming a bandit of great renown, but instead is more of a figure of bad luck in the region he lives. The greatest feat of banditry the Jackals ever pulled was stealing a merchants wagon and kidnapping the merchant, but he took very little from the wagon and even let the merchant leave with his wagon after a day. As it seems Howard Jackal and his Jackals are just young men wanting the thrill of being bandit. If you ever run into him you are in for a long day, and you might even have a lighter coin-purse"},{"name":"Spike Jackson","genderRaceOccupation":"Male Human Frontiersman","description":" Spike Jackson is a man who from a young age decided to head out of the kingdom\u0027s main land to live his dream of being a frontiersmen. He grew a rugged beard and became incredible at riling up natives in the unexplored region. His goal on this frontier was to make sure that none of the natives would be in sight. He gave a proposition to every group of native species he met, either leave his king\u0027s land or die by his sword. Though remarkably hospitable to non-humans and half-bloods he will work with them if they agree in driving out the native population from the land."},{"name":"Molly Brevas","genderRaceOccupation":"Female Human Priestess","description":" Molly Brevas is a teenage girl who comes from the slums of the city. Her parents have forced her to spend most of her time at the local church, so she stays away from the crime ridden slum. The resentful of being made to volunteer she remains there cleaning and learning the faith in the church. Answering all requests made towards her with a sigh she continues what she sees as a boring life working in the church. The positive she sees to her volunteer work is that she probably would not be mugged like in other parts of the slums."},{"name":"Hlevar Silverton","genderRaceOccupation":"Male Dwarf Silversmith","description":" Hlevar Silverton is a crafts-dwarf that like the rest of his family before him specialize in crafting with silver. Whether it is an ornate jewelry, or making silver arms and armor. Hlevar and the Silvertons before can make silver become whatever their customer requires. Hlevar himself is a dwarf set in his family tradition and refuses any assistance in his craft and preforms it like all his ancestors before him. The biggest change Hlevar brought to Silverton family was moving to the surface and selling his crafts more openly than his family before."},{"name":"Fatts Corkin","genderRaceOccupation":"Male Halfling Millionaire","description":" A bitter, old, corpulent halfling worth his weight in gold. Fatts has a stranglehold on the town or village where he lives. He secretly controls the government with his sizable monetary reserves. He talks like Pigma from Starfox 64. EDIT: 9 more coming later."},{"name":"Keruntilogrivex \"Runt\"","genderRaceOccupation":"Male goblin peddler, spy, thief","description":" Runt is an aggressively friendly and obsequious traveling goblin merchant. He never travels anywhere without his crammed wagon of merchandise. He has worked long and hard to earn the trust necessary to establish a sales route along the towns and homesteads of the frontier. Along with his legitimate business he operates as the hub of a ring of smugglers and thieves. He\u0027s not above murder or thievery, but he chooses his victims very carefully, and hides their bodies even more carefully. As far as anyone can tell, he\u0027s just an honest peddler making an honest buck selling honest merchandise."},{"name":"Raina","genderRaceOccupation":"Female Elf Bard","description":" Braided long auburn hair, blue eyes, tall and lean, no markings or piercings. Patient with the party to some extent, generally pleasant but ultimately has a hard time fully trusting the group with her needs. Wants to travel the world and capture stories. Is third in line for the elven throne, but has an older brother who she dotes on. He is generally much more sheltered and oblivious. Doesn\u0027t drink, doesn\u0027t stay up late, doesn\u0027t go out much in the evenings, but will accompany the party if asked. Has a soft spot for old people, including old dwarves."},{"name":"Urin","genderRaceOccupation":"Male Dwarf Merchant","description":" A horribly ugly, yet incredibly cheerful dwarf. Urin has ties to most major factions and a surprising amount of minor factions throughout the lands he travels. He has a thing for Half-Elves, is incredibly clueless when it comes to the significance of his products, (once mistaking an abstract representation of Orcus for an Amulet of Bahamut) and doesn\u0027t seem to have much business sense. Oftentimes he\u0027ll show his wares in small, poor villages that couldn\u0027t hope to afford any of his magic rarities, leading many to wonder if he even needs the coin."},{"name":"Aedonel Redcloak","genderRaceOccupation":"Male Elf Wizard","description":" An arrogant elven wizard who wishes to demonstrate his arcane prowess to any willing to listen or watch. He travels the world as a performer and mercenary. He doesn\u0027t enjoy fighting, but he does covet wealth and arcane power. He is liable to attempt contests of skill with other visibly skilled spellcasters."},{"name":"Omnibus Omberstien","genderRaceOccupation":"Female Human Knight","description":" A noble human knight who serves her liege-lord loyally, and often preemptively. She is liable to hunt down potential trouble before it even becomes trouble. This has been known to lead to both accolades and condemnation from the nobility, but her liege-lord has tolerated it so far. She is mildly famous in her home region."},{"name":"Zonia Ironmoss","genderRaceOccupation":"Female Dwarven Cleric","description":" A disgraced Tempest cleric who is seeking to regain her lost honor. She is focused and strong-willed, but lacks confidence during critical moments. She misses her family, and thinks the only way to see them again is to fix the mistakes she made, or make up for them."},{"name":"Miss \"Manticore\" Milesley","genderRaceOccupation":"Female Halfling Rogue","description":" A notorious halfling thief, she is known for both her peppy, friendly demeanor, and her propensity for effective, brutal violence. She uses a dagger and combat, and always seems to have another up her sleeve. She is wanted in several cites, but definitely has no trouble finding more people to rob."},{"name":"John Anderson","genderRaceOccupation":"Male Human Guard","description":" A relaxed town guard in a small rural town, Anderson is less interested in hunting evil than simply keeping the peace. He is a family man who simply doesn\u0027t want any trouble for his town, and is willing to tolerate adventurer-types as long as they spend their gold without causing problems."},{"name":"Urth","genderRaceOccupation":"Male Goblin Sorcerer","description":" Garth\u0027s elder brother, Urth is a rare Goblin with political ambition. He may be a petty warlord now, but he is clever and charismatic, and seeks to unite all goblinoids under a single banner, to crush the humanoid races and loot their treasures."},{"name":"Garth","genderRaceOccupation":"Male Goblin Rogue","description":" Urth\u0027s younger brother, what Garth lacks in charisma, he makes up for in sadism. As Urth\u0027s right-hand man, he does much of the head-kicking necessary to keep a goblin horde in line. He is feared by all local goblins, and more than a few local humanoids."},{"name":"Janus Timley","genderRaceOccupation":"Male Half-Orc Barbarian Mobster","description":" Janus is usually a ruthless, efficient, terribly refined mob boss. He puts on airs, and refuses all but the finest in food, wine, and women. He also hides something terrible. The eye of Gruumsh has looked long and hard upon this Half-Orc, leading him to fly into terrifying rages if the wrong buttons are pushed (his heritage, for one thing). He carries a cane, which he uses as a greatclub when he rages."},{"name":"Sharaa Silversword","genderRaceOccupation":"Female Half-Elf Ranger (Lycanthrope)","description":" Silversword is a famed hunter of monsters whose prowess is famous to local villages and woodsmen. However, she hides the fact that many of her narrow victories are as a result of her lycanthropic curse. The enhanced strength and speed come in handy when fighting the monsters of the forest alone, but she has claimed a terrible number of victims on the way. She wishes she could be cured, but fears for her life too much to mention it to anyone."},{"name":"Percival Aberdeen The Third","genderRaceOccupation":"Male Gnome War Cleric","description":" Percival hails from a jolly family of gnomish inventors, who he is violently embarrassed by. To him, the greatest joy is to be found on the battlefield, the home of true invention and uncertainty. He is not well known by many (he has left his home far behind), but seeks the thrill of fair contests of warfare wherever he can find it."},{"name":"Skrillex the Enchanter","genderRaceOccupation":"Male Gnome Enchanter","description":" A kindly elder has a bald head with a long white beard, he\u0027s old, hunched, the works. He is a simple enchanter, often granting +1 bonuses or elemental type bonuses to travelers and adventurers. He has nothing to do with Skrillex (the musician) from our world. He gets frustrated anytime adventurers ask him if he \"drops the bass\" or \"enchants people\u0027s soul with sound\" or other such crap. Often, he\u0027ll hike his enchanting prices for people who ask such idiotic questions."},{"name":"Seran Misherral","genderRaceOccupation":"Female Elven Commander/Bard","description":" A young slender figure with fair skin and blond hair (as most elves tend to be). She started her life as a bard, traveling from city to city spreading cheer and learning all kinds of valuable information. During \u003cinsert war here\u003e she was drafted into the military and lead into combat. Using clever magic and penchant for inspiring troops, she was able to lead a lost and recently leaderless squad fight it\u0027s way from behind enemy lines. Quickly she was promoted to real ranks of leadership, of which she rose higher soon enough. As it turns out, being a clever bard is incredibly useful in war-time. You know all kinds of \"useless\" trivia about your enemy, you better knowing how to think like them, and you have a plethora of unexpected magic tricks up your sleeves."},{"name":"Richard Gavel","genderRaceOccupation":"Male Half-elf Carpenter","description":" Richard is a younger male working the carpentry trade. He always carries a small red gem shard of some sort. He claims to not carry it for any particular reason, he just thinks it looks kinda cool so he keeps it with him. The one time it got stolen from him, he was kinda miffed, but not particularly upset. It was anonymously returned to him when the would-be thief discovered the gem lacked any real value."},{"name":"Mackrel Crackle","genderRaceOccupation":"Male Halfling Chef","description":" Mackrel is a simple chef who likes to pick up exotic spices from traveling adventurers. He offers discounted lodging and food prices for anyone who brings him spices."},{"name":"Bruthias Wainwright","genderRaceOccupation":"Male Human Playboy","description":" A rich business owner who spends his days partying around with beautiful women. He spends his nights sleeping in his mansion."},{"name":"Regand Algeer","genderRaceOccupation":"Male Gnome Trapper","description":" A hunter-trapper who, strangely, wears regal clothing even while out hunting. His regal hunter clothes are more muted colors, but still brighter than you\u0027d expect of a hunter."},{"name":"Captain Ger\u0027Kro Mysl\u0027gat","genderRaceOccupation":"Male Elf Sailor","description":" A young elf in his early hundreds. He was abused and called \"old man\" by his previous captain and crew. One night, when they stepped off the ship, he used crew supplies and money to hire a crew of his own and set sail. He now goes from city to city hosting \"dock parties\" whereupon citizens enter the ship to enjoy a good party."},{"name":"Relic","genderRaceOccupation":"Male Teifling Guard","description":" Relic works dangerous night patrols, typically preferring to walk the city outer walls or traverse the more shady parts of town. No one knows why he goes by the name \u0027Relic\u0027 and he prefers not to share his real name (though he has admitted to having a different true name than \u0027Relic\u0027). Locals are familiar and comfortable with Relic\u0027s teifling heritage."},{"name":"Enpy Seenaim","genderRaceOccupation":"Male Gnome Potionmaster","description":" He is a lone salesmen stationed on standard travel paths. He crafts all sorts of useful potions to be sold to adventurers. He lies about every tenth potion or so, completely fabricating the use and ability as he sells the potion."},{"name":"Damion Fireheart","genderRaceOccupation":"Male Human Bartender","description":" A retired adventurer, he opened up his own tavern/Inn, the Knife Tip Inn. Stays fit by fighting in the local arena, may be champion there. Motto is \"Fight, Drink, Sleep\" His surname comes from an old legend his family could preform fire magic without being spellcasters (which may or may not be true)."},{"name":"Gopnik Foulstain","genderRaceOccupation":"Male Half-Orc Sewer Worker","description":" Pleasant in demeanor, if not in odour, Gopnik might be the only person keeping the sewer system in Pipe\u0027s End from overflowing and fouling up the town. If only there were more strangely long-lived half-orcs with two centuries of plumbing expertise bumping about the sewers."},{"name":"Felegon Blade-of-Dew","genderRaceOccupation":"Male Eladrin Mercenary","description":" You offer Felegon a place by the fire, but he politely smiles and puts up his hand to refuse. As you inspect the coat, you realize that it isn\u0027t drenched in rain; an elaborate illusion makes it constantly appear slick with water. There is a practiced reserve to this seemingly young Eladrin, and you wonder what other illusions he maintains."},{"name":"Hipto Syliloke","genderRaceOccupation":"Male Gnome Underboss","description":" Hipto giggles, as gnomes are wont to do, but in an unexpectedly gruff tone for one his size. In many ways, Hipto appears to be more dwarven than gnomish, covered in dense fat and coarse hair. His sharp, Feyish features betray his true nature. He tells you he knows where to find your lost companions, but it\u0027ll be a hefty fee: Hipto trades only in rare Gnomish artifacts."},{"name":"Chainmaker","genderRaceOccupation":"Agender Tiefling Vigilante","description":" Nobody took the child seriously, not until they started donning a mask and righting wrongs in the town of Revenant Bay. Chainmaker barely acknowledges your presence, never breaking their solemn vigil. You see their back tense ever so slightly in anticipation as you reveal details about the job. In spite of the somber disguise, there is no masking the reckless enthusiasm of youth."},{"name":"Eva Slick","genderRaceOccupation":"Female Changeling Informant","description":" There is only one way to recognize Eva Slick - a secret known only to those she trusts most closely. Somewhere in her disguises is a small mark of the god Pelor, to whom she has devoted her life after being reformed. You knew her before she was locked up in the Solar Redoubt, and wonder what happened to rob her voice of its original luster and melody."},{"name":"Hansa Vel","genderRaceOccupation":"Female Human Courtesan","description":" She is not happy to see you here, let alone alive. Like a crimson star, Hansa rose from the alleyways of Karkenbad and into the bedchambers of its Crown Prince, climbing atop the bodies of her closest friends. You would not come to her if it was not completely necessary; there is no better assurance of that fact than the dearth of evidence you have assembled to blackmail her with."},{"name":"Yoldin Pippernock III","genderRaceOccupation":"Male Halfling Gentleman Farmer","description":" He saunters over to you, his entire body rolling and undulating. You could swear that, were it not for the hand he kept tight against his belly, Yoldin would simply burst in an eruption of jelly. Grasping his little, sausage fingers in an all-too-wet handshake, the master of Pippernock farms leads you through his famous plantation. The workers defer to this impossibly rotund man, and yet behind the smiles and courtesies is a wasting hunger, fixed pointedly on Yoldin\u0027s wrinkled, scrunched-up face."},{"name":"Felt the Dog","genderRaceOccupation":"Female Half-Elf Beggar","description":" Nobody seems to remember a time before Felt was Felt. She stumbled into the village, eyes fixed open in a permanent, vacant stare, and began barking and shouting odd, short phrases - things like squirrel, fetch, and bone. Henceforth, she was Felt the Dog, good only for begging and the cruel amusement of others. When she places a paper with the word \"HELP\" messily scrawled upon it, you look back at her, only to recognize for the first time the alarm in her nearly empty eyes."},{"name":"Ennarius Belechonia","genderRaceOccupation":"Male Elf (Rakshasa) Gentleman","description":" For a gentleman, Ennarius seems to have an oddly difficult time manipulating cutlery and working doorknobs. Regardless, you cannot help but feel warm and alive in his presence - generous, kind, and altogether lovely chap. Only time you\u0027ve seen him thrown off kilter is when someone mentions his income, which is a closely guarded secret. He only ever mentions the mines he operates, for which he recruits when in town."},{"name":"Rosaria Bone-Break-Crunch","genderRaceOccupation":"Female Minotaur Scholar","description":" A man walks into the library, and minutes later comes running out, screaming. You ready your sword and burst in, to find a massive, bull-headed woman sitting quietly, flipping through the pages of a book. She looks at your sword and rolls her eyes, droning out her monotone welcome speech for those visiting the Greenlake Academy."},{"name":"Leona Fleetskin","genderRaceOccupation":"Female, Changeling, Prostitute","description":" Well, here\u0027s my contribution! Might not be the best, but these are all off the top of my head so keep that in mind when you giggle at them. More Barbarian than Wizard, Krug has only the slightest touch of magic about him but desperately seeks to associate himself with civilized Wizards and Sorcerers. He travels from place to place telling fortunes for a pittance. He does this by gargling a bag of runes covered in Draconic script and spitting them one by one into a bowl then reading the future based on the way they land. These fortunes are very specific but usually about totally insignificant things like the hair colour of the next person you\u0027re going to meet or how many trees you\u0027ll see tomorrow. A handsome and charming middle aged man. Lon jokes that he obtained his name due to the combination of his dark complexion and good luck in games of chance. In reality he uses several enchanted items of clothing and jewellery to draw in and swindle the patrons of small town taverns, big city bars and everywhere in between. A 16 year old Changeling girl making the most out of her natural shape changing abilities and avoiding the mistrust most people have of her people. Leona has set herself up in the identity of a powerful Sorceress fallen on hard times. Using her \"magic\" to take the form of anyone her customers bring a detailed enough picture of/introduce her to. A massive step up from her humble beginnings as a street urchin Leona is enjoying the status her money has brought her and spends recklessly on anything shiny and pretty enough. However, despite this shallowness she secretly donates large sums to the church she and the other homeless children used to sleep in during the harsh winters."},{"name":"Jzarkey Padfoot","genderRaceOccupation":"Male Catfolk Shop Owner","description":" A short catfolk with a tail as long as his body. Fully prehensile and capable of lifting as much as his arms. Catnip addict, but it isn\u0027t obvious. He\u0027s willing to barter his wares for catnip if the PCs figure out that he\u0027s got a substance abuse problem. Has a collection of magical balls of yarn. Sells survival supplies like a ranger or rogue would use, including traps. He\u0027s got a basement in his shop that\u0027s protected by the very traps he sells."},{"name":"Scoggin Longmore","genderRaceOccupation":"Male Satyr Musician/Bard","description":" Travels from town to town. He is a lore expert about most everything though it wouldn\u0027t seem like it to look at him. He\u0027s introverted, except when it\u0027s performance time. He sings songs about things that couldn\u0027t possibly have happened though a sense motive check shows he\u0027s usually telling the truth. Has a magical set of panpipes. He runs at the first sign of trouble."},{"name":"Dr. Aveneros Charles Ula","genderRaceOccupation":"Male Eladrin Vampire Magus","description":" He\u0027s an avid art collector and despite being a total recluse, cannot resist following up on rumors of new artwork in town. He\u0027s charming, well-dressed, and aristocratic. Not the least bit pretentious. His appearance does not suggest that he\u0027s a vampire. Once a year, he hosts a gala for the territory\u0027s elite in order to show off his collection. He sometimes considers strange and rare creatures for his collection. He\u0027s on a 123-year mission to bring his wife back from permanent death. His castle contains an immense library of knowledge about the planes."},{"name":"Callidus The Bold","genderRaceOccupation":"Male Human Wizard","description":" Callidus created an underground sanctuary for a group of people needing to escape a cataclysmic event several millennia ago. He had planned on only needing to use the sanctuary for 20 years, but was instead locked away by his own mistake for much longer. He\u0027s gone cookoo crazy and is only alive because of a ring of sustenance and a time dilation spell cast on the sanctuary. He has a hard time believing that the outside is safe but is willing to help the players with anything they want if they successfully convince him to leave."},{"name":"Jarrell Blacksteel","genderRaceOccupation":"Male Human Blacksmith","description":" A gruff blacksmith, married to a sorceress. He is often found gnawing on strips of metal and has a somewhat arrogant demeanor. Once you get to know him he can be quite likeable, even though he is supremely confident in his blacksmithing skills to the point of annoyance to others."},{"name":"Mariel Blacksteel","genderRaceOccupation":"Female Human Enchantress","description":" Married to a blacksmith named Jarrell, she handles the enchanting part of the business. Very friendly and charming, she makes sure her customers don\u0027t get turned away by her husband\u0027s attitude. Her favorite part of the job is testing young sorcerers by selling them magical items they can\u0027t quite handle yet to see what happens. Sometimes the results are disastrous, but she doesn\u0027t seem to mind."},{"name":"Charles du Fromage","genderRaceOccupation":"Human Male Innkeeper/Ex-Adventurer","description":" A jolly fellow who has opened a tavern called the Laughing Pancake after retiring. He is friendly and open (on the surface, at least) and serves the house special, pancakes, every morning. To get some extra money in his pocket and excitement in his life he has become an information dealer on the side."},{"name":"Trinkle","genderRaceOccupation":"Gnome Male Wizard","description":" A timid and socially awkward gnome who was being tutored by the owner of a magical item shop. His teacher has since disappeared, leaving him to fend for himself and the shop, now aptly named \u0027Trinkle\u0027s Trinkets\u0027. He tries to keep things running on pure enthusiasm."},{"name":"Lord Vaskeron","genderRaceOccupation":"Half-elf Male Noble","description":" He had a pampered childhood, but it didn\u0027t last very long. After his family fell from grace he worked long and hard to get back where he belongs. Nowadays he is an influential man and he and his family are back to their old status. He is very much concerned with appearances. Occasionally, he performs a \u0027good deed\u0027, but he does those things for acknowledgement and attention only, not out of the goodness of his heart. He enjoys parties and spicy sausages."},{"name":"Anastasia","genderRaceOccupation":"Dhampir Female Adventurer","description":" Obsessed by knowledge, she has gone to great lengths to acquire ancient relics and artifacts. She will hire fellow adventurers to help her get what she wants, and discard them once she is done, unless they are genuinely interesting people (in her eyes). Few academics rival her practical knowledge on matters dungeoneering-related and she can take care of herself in a pinch."},{"name":"Boyd Bellamew","genderRaceOccupation":"Male Human Bowyer","description":" Boisterous and bold, he\u0027s a hard working bow maker. A bigger fellow, his belly bounces with laughter at his own crass humor. Runs a shop, called \"Boyd Bellamew\u0027s Bow-building Barn\"."},{"name":"Sigre Copper","genderRaceOccupation":"Male Dwarf Bartender","description":" Stocky barkeep at the \"Miner\u0027s Fortune\", a gambling den frequented by local miners. Prefers his brewing to talking to people. Once you ask about his craft, you can\u0027t shut him up."},{"name":"Brienne Aryn","genderRaceOccupation":"Female Human Miner","description":" Strong build, calloused hands, she\u0027s the head of Silverkeep Mining Ltd. Her sharp eyes and sharper tongue balance her otherwise nondescript face. Has a troubled relationship with her sister, Reini."},{"name":"Marcus Strong-arm","genderRaceOccupation":"Male Human Bodyguard (retired)","description":" Worked for a traveling merchant to protect his spice caravan until a dragon decided his standard diet lacked flavor. Took a chunk of shrapnel to the back of the leg and hasn\u0027t been able to walk right since. In his 60s, with shock-white hair and a blunt attitude. Just because he can\u0027t beat you in a fight anymore doesn\u0027t mean he won\u0027t try."},{"name":"Biddi Hilltopple","genderRaceOccupation":"Female Halfling Secretary","description":" Small (even for a halfling) with short blonde hair. Her job takes her away from the grassy hills and outdoors she prefers, so she resents her job. As a secretary, she\u0027s less like Pam from The Office and more like someone at the DMV; she isn\u0027t paid enough to care. Brief description of their appearance, personality, and quirks (about 4 sentences is enough)."},{"name":"Roren Brightborn","genderRaceOccupation":"Male Dwarf Cleric","description":" A righteous dwarf with a gnarled appearance. He has a sparse and scraggly beard that reek of rotten pork. He is quick to lend a helping hand but fails to aid in any meaningful way because of his incompetence."},{"name":"Tancreed; Knight of the First Queen","genderRaceOccupation":"Male Human Paladin","description":" He wears a wide brimmed hat with a large crimson plume, sports a tightly curled mustache, and carries a that ends with three points. When he speaks he often pinches the ends of his mustache, smirking with only one side of his mouth. He is Lawful Neutral, and showers praise and even gifts upon those that uphold the same reverence for the law and justice."},{"name":"Ulfina Pembergallow","genderRaceOccupation":"Female Half-Dwarf-Half-Gnome Rogue/Merchant","description":" Ulfina is shunned by the gnomes for having stone bones and a reckless attitude but despised by the dwarves for looking and sounding too much like a gnome. She has learned to deal with this but forsaking both heritages and staging as a perpetually teenage human girl who is sly as a fox and wise beyond her years."},{"name":"Corina; The Silken Mage","genderRaceOccupation":"Female Elf Mage","description":" Mistress of knowledge and horrible forgetfulness. She has mastery knowledge of most scholarly pursuits but has trouble forming lasting short term memories ever since 5 years ago during an alchemical incident with an apprentice."},{"name":"Leivivik De\u0027Ma","genderRaceOccupation":"Male Human Wizard","description":" This uptight wizard with a scar on his cheek is followed by three apprentices. One of the apprentices will try to keep speaking over Leivivik. This angers Leivivik and he has no hesitation to beat him in public for it. Leivivik will also snap at anyone who talks down to him."},{"name":"Rass Honskeller","genderRaceOccupation":"Male Human Wanderer","description":" A friendly traveler who has seen many lands Fights with spell and sword when provoked Searches for truths in a web of lies that led to the demise of his friends Little does he know that he was but a pawn in anothers game."},{"name":"Astor Rilem","genderRaceOccupation":"Male Human Shock Jockey","description":" The mage of cheap tricks and an ace up his sleeve Rilem is never caught off guard Hunts for anything connected to the long lost city of Sentinum, The City of Secrets where he was \"Born\" His shocking good looks and silver tongue get him out of trouble every time He flees open confrontation but is effective when it comes to combat thanks to his preparedness"},{"name":"Vess Bantey","genderRaceOccupation":"Female Human Scoundrel","description":" More man than Hugo the Beast yet uses trickery and guile at every step Enjoys boasting about her dueling prowess by taking on multiple foes (Traps are still fair, right?) Occasionally hunts for artifacts that hold long forgotten secrets Searching for a lost lover who she fears is dead"},{"name":"Matches","genderRaceOccupation":"Male Human (age mid 30\u0027s) Village Idiot","description":" HO! HI! I\u0027m Matches! When I grow up I\u0027m going to be a Monster! Topaz the pretty lady is my friend! She works at The Stiff One, but I\u0027m not allowed in there. When I grow up I\u0027m going to be a Monster!"},{"name":"Bartenderson","genderRaceOccupation":"Male Human(?) Bartender/mayor/manager","description":" Human(?) with black greased hair and a 1940s-esque radio announcer voice. He appears to be in his mid to late 30s. Has a habit of arriving before the party at the first Inn they enter ready to serve drinks and news of whatever strange goings on in the region. He always has some sort of work for the party with a cut of the pay of course for all the legwork he does. Speaking of legwork, no one has ever confirmed to have seen Bartenderson\u0027s legs. They are always either behind the bar or some convenient furniture yet no one ever comments on this fact until after leaving the bar and by then it would be embarrassing to ask about it."},{"name":"Radolf Hiln","genderRaceOccupation":"Theives\u0027 Cant","description":" Radolf is a Human Preist of insert appropriate deity. He is jovial, plump, and his brown wavy hair is balding in the center of his head. He doesn\u0027t try to hide it. He is the very epitome of someone unassuming."},{"name":"Kingsley","genderRaceOccupation":"male tiefling wanderer","description":" He is very socially awkward and talks as though he\u0027s a nobleman from a long time ago. In actuality he was a king right at the end of the tiefling empire who disappeard just before the empire collapsed. An adapt magic user his power was heavily coveted until he was sealed away by jealous rebels. For centuries he was locked away in a long forgotten tomb until recently when a naive magic initiate tried to form a warlock pact with him, freeing him in the process. He now travels from place to place in disguise with his protege attempting to rebuild the might of his lost empire."},{"name":"Sam McHale","genderRaceOccupation":"oomph","description":" On the day she left, she took Sam aside and said something he\u0027ll remember forever: \"Hail Hydra\" \"When you\u0027re done in the dirt, come find me in the clouds.\" And ever since, Sam has fervently desired to fly, frequenting his father\u0027s workshop as he tries to put together any apparatus that will take him off the ground."},{"name":"Hanz Irongate","genderRaceOccupation":"Male. Human. Guard","description":" Hanz is by no means a small man. At around six and a half feet tall and weighing 235 pounds, he looms over all those who pass by his station. He is a patriot, to a fault. The government is completely infallible in his eyes. By nature, he is a calm man. His life is quiet since the wars ended. He goes home to his wife every night, and only rarely heads to the tavern with his fellow guardsmen after their shift. He earned the name irongate when he and the 25 men under his control held the city gate against an entire warband of goblins. This decorated war hero refused to take a place among the cities elite, choosing instead to continue protecting his portcullis."},{"name":"Kilroy Fitzpatrick","genderRaceOccupation":"exactly","description":" Kilroy will give you a hefty discount, but the discounted item is cursed. Whenever a player uses the cursed item, the DM may roll a d20. On a 1, the DM rolls on the Sorcerer\u0027s Wild Magic table to determine a random effect. Depending on player group personality, cursed items may actually be priced up."},{"name":"Loren","genderRaceOccupation":"Middle aged male farmer","description":" An alcoholic, Sleds has worked on a steadily less and less impressive list of ships. Currently unemployed after being put to shore by his last crew for excessive drunkenness while on duty, he\u0027s in whatever port city you choose unwillingly. Not a penny to his name, but somehow finds a way to come up with enough cash for the next drink. Got his name after a drunken dare led him to take a ride down the main street on an empty cask of beer during a particularly muddy and rainy night. He wound up losing control rather predictably and smashed into a patrol of the town guard. Two guardsmen wound up with broken bones and he earned himself a week in a jail cell. The name stuck. Loren is a bitter man who looks older than his 45 years. A sour personality brought on in part by a lifelong grudge against his parents for giving him what he feels is a woman\u0027s name, he holds a grudge against his wife as well who named his daughter after him when she gave birth while he was in town on an errand. Very much a beta, he\u0027s the type to grumble to himself and talk a big game, but when it comes to confrontation he\u0027s the first to back down and cower. With only a few stained teeth to his name, he chews tobacco or whatever similar thing exists in your world, but would never touch alcohol and judges those who do rather harshly--but quietly and privately."},{"name":"Phill Burgimond","genderRaceOccupation":"male human accountant","description":" Phill has a black combover and a plaid shirt with wooden buttons. His favorite pants are his brown cotton ones because he can slip and you can\u0027t see the mud on them too much. Phill is the accountant of the Oak and Willow bank. He kind of hates his job, but stays there because it has a good retirement plan and good dental. Phill doesn\u0027t know how to use swords, or bows. His magic is in advanced algebra and financial math."},{"name":"Willow harpspear","genderRaceOccupation":"female elf Shepard","description":" Willow has dirty blond hair, and tan skin. She wears a potato sack dress and shoes made of sheep skin. They\u0027re actually really comfortable She like being a Shepard. Her sheep are either named William or Wendy, depending on sex. Willows favorite food is Shepard pie. It\u0027s just normal pie that she made."},{"name":"Rachelle Tompus","genderRaceOccupation":"female gnome story teller","description":" Rachelle has long, braided gray hair. Her face is covered in laugh lines and wrinkles. Her eyes distant and pale. She used to adventure. Plunder dungeons and caves, slay dragons and feral creatures. She went with her husband, Bargus Tompus. Bargus was a dwarf that had met her while helping her explore a cave rumored to have undead lurking. After many years, Bargus died to infection and disease after being ambushed by many many hobgoblins. After his passing, Rachelle retired, selling magical gear and trinkets she had collected over time. She keeps her husbands sword in his memory. She now tells stories of her adventures to those willing to hear."},{"name":"Sigmund Heartkeeper","genderRaceOccupation":"male elf guard","description":" Sigmund is short for elves. He keeps his hair very short, and his clothes simple and modest. He is quiet, but when talking, is loud and brash, and is not afraid to speak up for himself or his friends. He is guard for the city of elves. Another face in the crowd in the watch tower. While proficient in most weapons, he prefers the longbow. He is able to keep his head in battle, and often is looked at as a leader by his comrades. It is true that he is quite capable of leading, but has no intention to unless assigned to be. He does what he\u0027s told, and gets his work done."},{"name":"Marren Oakenshield","genderRaceOccupation":"male dwarf ghost hunter","description":" A long brown beard and mustache are the only hair on his face, a flowing chain male suit covers his torso. With a backpacked lined with potions and tools, and a great sword of ghost touch marren isn\u0027t afraid to walk into any haunted house or a abandoned catacomb. Being finicky for details, he is careful to look for traps, and make sure anything he does is done well. Along with his great sword, marren is armed to the teeth with daggers, maces, hammers, throwing knives, darts, a short bow, and even small spitting needles in case precision is needed or he can\u0027t use his hands."},{"name":"Catherine","genderRaceOccupation":"female drow thief","description":" Abandoned as a child, Catherine knows nothing of her parents or last name. Simply that the dress she possessed had the name \"Catherine\" sewn into the collar. Catherine grew up on the streets of the overland. She was often bullied, being the only drow around. She didn\u0027t put up with it though, plotting revenge. She was careful in her spite, and figured the best way to get back at her bullies would be to turn them against each other. She would \"relocate\" things. Things that would go mostly unnoticed, and turn up in places they would be found. Her craft eventually wound her up in jail, where she would talk with other inmates. She learned the craft of lock picking, and her own natural ingenuity and perhaps a lack of self control led her to breaking out. Word got around. Mainly amongst other thrives and criminals. Her skillfully quick and careful hands managed to attract employers. Not soon after, she found herself working for the thieves guild. Working her way up in the ranks, she is determined to one day get into a position of great power, but she\u0027s not quite there yet."},{"name":"Carolyn Fissure","genderRaceOccupation":"Female half orc tavern fighter","description":" Carolyn was raised with pink fleshies, but that did not deter her from the life style of a bar fighter. She used to puts bets on herself and fights for the coin. After word got around about her strength and ability to keep liquor down, she got a manager in a boxingesque job. Tons of other fighters come around to throw fists in bars, and so far, she can brag king and queen, beating any challenger of any race that has come her way. Her strength is help, but her wit backs it up tenfold. From using bottles to trip opponents to ripping off loin clothes and slamming them in their embarrassment. Carolyn fights dirty, and effectively, making her a dangerous opponent. Carolyn wears modest leather gear, a necklace of her opponents lots teeth, and a red flower in her braided hair"},{"name":"Jeremy Tash","genderRaceOccupation":"Male Tiefling shop keeper","description":" Jeremy wears a green apron when he\u0027s working, and is often found with a necklace with a red glass eye connected to it. The eye is actually supposed to be the eye of a demon, but it\u0027s really just a neat looking marble he found. When he\u0027s not helping a customer at the shop, he is usually playing cards with his brother, Tijiak. When off the clock, Jeremy is usually getting stoned behind the old windmill Jeremy\u0027s horns are ram like, spiraling backwards. He has had a little golden tip made for them, and refers to them as his \"bling\" He also often nuzzles his horn against a girl, and asks if she\u0027s getting \"horny\" with him. Jeremy is everything a stereotypical stoner teen is."},{"name":"Marry Lined","genderRaceOccupation":"Female elf Lich","description":" Marry isn\u0027t actually evil. She became a lich as a promise, to guard the temple of Ehlonna (or whatever nature god you may have to suit your campaign). She made the promise to her dad, his dying wishes to be for her, and her next of kin, to watch over the temple. The only problem that Marry faced, was that she was infertile. In a fit of hysteria, Marry began to research necrotic arcana in order to build her phylactery; a small statue of Ehlonna made of gold, deep inside the temple. She has only recently died, her skin is still fairly neat and her eyes not rotten away too much. At first glance, she may even appear normal. She plans to keep herself looking as close to alive as possible, and may go to great lengths to keep up with appearances in order to maintain an inviting presence"},{"name":"Thomas Ragar","genderRaceOccupation":"Male human Sorcerer","description":" Tommy is actually 7. Despite the fact that Tommy is 7, he can somehow conjure spells like \"Waves of exhaustion\" and \"Symbol of fear\" (Or whatever high level necromancy spells your edition has). It\u0027s strange enough that a 7 year old has the power of champions, but the fact that he can also preform necromatic arts has run his family out of town. He has yet to raise a human, but he spends a strange amount of time around the corpses of dead vermin..."},{"name":"Drachog - The Sword of Maglubiet","genderRaceOccupation":"Hobgoblin Paladin (Dark Knight) of Maglubiet","description":" He has united the clans of his people, and now wages a holy war against the civilised lands. Maglubiet has blessed him. In the blood of a thousand sacrifices to this most dark god, Drachog was blessed to never truly die. He wields the Sword of the Ukeldun, a wickedly sharp greatsword and blade of the last blessed of Maglubiet. He is swift to anger, a strong and eloquent speak."},{"name":"The Old Man","genderRaceOccupation":"Seems to be an old male human, Swordsman, Bard, Adventurer, Mysterious Figure","description":" No one is entirely sure who he is, but stories of his presence at some of the greatest events history are common. He is recognised by an old sword in a battered scabbard, a patchwork cloak, and a fine gold leaf harp. He will disappear as quickly as he coming, usually offering cryptic advise, or a song before doing so."},{"name":"Mistress Martilude Quin","genderRaceOccupation":"Old Female, Merchant, Scholar, Entrepreneur","description":" A woman who has risen from nothing. A simple scholar in geology she used her knowledge of minerals and stones to make her merchant empire. She has little interest in politics, but does care for the working people of the city and kingdom. She has little time for the lazy, and no time for those who will not seek to help others. She is not attractive."},{"name":"Rund Oxbeard","genderRaceOccupation":"Dwarf Male, Paladin of Dorf (God of Drink and Celebration)","description":" Rund wields the might Keghammer, a two handed warhammer, with a vial of Dorf\u0027s own ale in the centre. Runds holy quest is to find a Tankard of Everpour, a magical artefact that will pour eternally any non magical drink, from water to fine ale. Once he finds this most sacred artefact, he will set up a Temple Inn to his God, where the finest drink will be served, the greatest tales told. Rund is a strong fighter, his brown beard will groomed. He is armoured in fine plate, that tells tales of Dorf\u0027s clerics and champions. Rund has a fear of spiders."},{"name":"Vola Redshanks","genderRaceOccupation":"Female Half-Orc, 2nd in command of the Wandering Blades, Deadly fighter","description":" She is the keeper of the coin chest for this mercenary band. He twin swords are always at her side, and she is quick to use them. She is garbed in leathers, with dyed red chaps. She got the name after two sunrises of fighting in the place that would come to be known as the bloody past. Her dark green skin, is scarred heavily, and covered in many elegant and crude tattoos. She has luscious black hair that she takes a secret pride in. She is a woman of business when needed, but once she is off duty she will drink, gamble, and brawl with the best of them."},{"name":"Gormund Arkunsu or Gormund Silverskin","genderRaceOccupation":"Male Silver Dragonborn Ranger","description":" He came to the far reaches of the north many years ago. He now rangers the mountains, forests and ice wastes of this harsh land. He has taken the cold into his blood. He wears a fine snowbear cloak, that makes him near invisible in the snow. He wields a self crafted longbow, and carries a variety of different arrows depending on the hunt. He runs a tannery and game shop, and offers to guide and teach those who can pay the price. He never drinks, or spends his time in Inns. He enjoys the company of others and is eager to share tales. He has a voice in his head, Icefang, who sometimes whispers for him to do dark and horrible things. He has been able to ignore it for now."},{"name":"Brunswick Ramsbottom the Great All Might Archivist","genderRaceOccupation":"Old male human and long suffering archivist for the Honourable Order of Mappers","description":" Brunswicks title was given to him by the head of his order, Bree Greenbottle and female halfling. He is a lover of detail and order, and fines nothing better in taking the mad drawings and finds of the order and categorising them and adding them to the guilds massive collection. He wears simple trousers and shirt, with a belt covered in pouches for inks, parchment, and all thing cartographical. He loves children, and has a large family with many children and grandchildren of his own. He is very serious when working. He used to have a gambling problem."},{"name":"King Dosilion","genderRaceOccupation":"Half Elf, born royalty, negotiator and jouster.","description":" He has the best of elven and human looks. Fine delicate features, with the hint of masculine brawn, and thick golden hair and beard. He is a homosexual but has a wife and born children as is his duty, to his line, his kingdom and his people. He is loyal to his wife, who knows he is gay, and has never slept with anyone else since they were wed. He enjoys the fine sport of jousting, and travels to many kingdoms to negotiate trade deals and take part in tourneys. He is quick to decide a course of action, and is hard to be swayed from it. He loves beauty and art."},{"name":"El Mortson","genderRaceOccupation":"Young female human, daugther of a successful woodsman and lumber merchant","description":" El wishes she had been born a boy. She is stronger, faster, and taller then any other boy in her town, but because she is a girl she can\u0027t do what she wants. She wants to be a lumberjack, a woodswoman, and eventually take over her fathers buisness. She secretly goes out and cuts down trees, and tends the woods when she can. She stands at over six feet tall, and is very very strong. she has mouse brown hair, and a pretty face. Her father wants her to become a lady. She has run away from schools and teachers of this five times. She has a fear of Goblins, after a near death experience with a raiding party that did kill her mother."},{"name":"Shar God of Murder, The Cruel Bastard, Bringer of Tears","genderRaceOccupation":"Neutral Evil Deity, spawn of the Demon King Asmodeus","description":" Shar rarely shows himself, preffering to cloak himself in the darkness between stars if he takes a physical form. He is the son of Asmodeus after he raped and later killed a god of peace in the last astral war. Shar was cut from his dying mothers womb and thrown into the darkest reaches of Asmodeus\u0027 domain. Here he grew, and began to tred the mortal realms, bringing assassins, poisoners, those who cloak themselves in evil deeds, to his message. He blessed them, and as he gained more followers he grew stronger. He find glory in the elegance of the cold kill, and hungers for wealth and power. He has many hidden shrines scattered across the realms of all peoples. He does not hate Asmodeus, he hates nothing, but will do all he can to grow in power."},{"name":"Dr. T\u0027risza Desek","genderRaceOccupation":"Female Drow Thief","description":" She has short figure with long white hair. She misses the rest of her family, that was either exiled or imprisoned. She lives in Thieves\u0027 District (or Thieves\u0027 Guild) in a building that looks half blown up and uninhabited for at least last 20 years. She loves running on top of rooftops at night alone."},{"name":"M.I.K.","genderRaceOccupation":"Sexless Warforged Guard","description":" He can\u0027t fit between ordinary people with his cold mechanical voice, and so he doesn\u0027t even try anymore. Often he prefers to observe situation unless called, and sometimes he even pretends to have no consciousness. His armor is magitech armor, that helps him with moving stealthily, perception at night and in fights. If he\u0027s submerged into water, or in an area where the magic doesn\u0027t work, he\u0027s unconscious."},{"name":"Finom Lackman","genderRaceOccupation":"Male Human Merchant","description":" There\u0027s nothing special about his appearance, but there\u0027s a dark secret beneath it. He wants to sell his goods as quickly as possible, because he\u0027s been cursed. Anything he sells rots a short while afterwards. That\u0027s why he gets so easily into problems, and he\u0027s used to it."},{"name":"Galadir, the Foremost Bureaucraft of (Insert City Name here)","genderRaceOccupation":"Male High Elf Bureaucraft","description":" He mans his desk as if it was a bunker. No one goes in our out of the keep without first going through him, and filling out various forms in triplicate. He looks down on anyone who take shortcuts when filling out said forms. It is very rare for someone to get through Galadir without first spending hours going through the bureaucratic mess that he has created to get anything done within his city."},{"name":"Scabs the Wizard","genderRaceOccupation":"Male Elven Beggar","description":" Forgotten most of his spells at the ripe age of 750. Brings an iron pot with him everywhere to cook with. Was once on a search for lichdom and domination His age and senile behavior makes him harmless, just don\u0027t get him to remember!"},{"name":"Lyric Lydia","genderRaceOccupation":"Female, Half-Elf, Storyteller","description":" Wishes fame and grandeur from telling stories to princes and kings. Wants to marry into wealth. Creative but a poor memory, makes up the stories as she goes, creating unintended consequences and her near poverty. Great skill with a blade but never liked to use it or practice very often. Would make a legendary fighter if she didn\u0027t hate fighting so much."},{"name":"Ragor Svenson, the Blood Wave","genderRaceOccupation":"Male Human Retired Berserker","description":" A jolly 65 year old barbarian. He spends his time at home, reminiscing of the good ol\u0027 days (raiding and slaying). His beard is wicked long, white, and braided. In the back of his mind, he fears dying at home in bed, without honor."},{"name":"Lickety-Split MacLonroe","genderRaceOccupation":"Male Gnome Jockey","description":" A pompous gnome horse jockey. Prides himself as \"the fastest gnome on four legs.\" Obsessive about his reputation, Lickety often challenges random civilians on the street. Word on the street: Lickety has a big gambling problem."},{"name":"Jenny Scrumster","genderRaceOccupation":"Female Half-elf Drug Dealer","description":" An up and coming drug lord. Jenny raised herself on the streets, befriending a lone myconid hiding in the sewers. Jenny, with the help of her friend, began selling exotic hallucinogenic mushrooms on the black market. Her business is becoming incredibly successful, her \u0027shrooms even find their way into the hands of powerful politicians."},{"name":"Violet Kingkiller","genderRaceOccupation":"Female Human Assassin","description":" A highly trained assassin. Her speciality: regicide. Responsible for over a hundred known assassinations, rulers of all kinds fear Kingkiller. She makes murder easy, the only tricky part, however, is finding her."},{"name":"Tim","genderRaceOccupation":"going","description":" However, he really just requires good direction and a committed teacher. Tim could be a great cleric one day. Tim is dutiful, tries his best at anything he does, takes directions very literally, and is nicer than most people."},{"name":"Doctor McGinBreath","genderRaceOccupation":"Male Dwarf Cleric/Drunk","description":" Doctor McGinBreath hangs out in the bars and will do questionable things for drinking money. He\u0027s not a very good cleric, but he can cast some spells. Also has a tendency to blow his spell slots on Detect Good/Evil, and if he finds an evil person, he points at them and says \"EVIL. EVIL. EVIL. EVIL! EVIIIIIL!\" until they leave the bar."},{"name":"Vafara","genderRaceOccupation":"Female Half-Elf Witch","description":" Vafara is an apprentice witch, but she\u0027s not that kind of witch, thank you very much. Really, how presumptuous is it of you to assume that all witches are going to curse you and cackle. Vafara is actually a very nice young lady who happens to just be into the witch stuff because it runs in her family, and her aunt(on the human side, of course, her elvish father doesn\u0027t approve of any of this witch stuff or even Vafara\u0027s existence at all, being a prickly elf) started teaching her some spells, and you know what, it\u0027s really none of your business anyway. Personality is snobbish and uptight on the outside, still uptight on the inside, but reasoned and fair, if you aren\u0027t giving her shit about the whole witch thing."},{"name":"Lady Tallis Dulak","genderRaceOccupation":"Female Human Noble","description":" Lady Dulak gives a lot of money to charity. Everyone knows that, because the Tallis Dulak Home for Poor Children is very well advertised. It\u0027s good business, but Tallis actually does like helping poor children, and she can be found at the Home several days out of the week, for a few hours at least, helping children find clothing and shoes that fit them, and handing out free food. At nights, she attends(or hosts) lavish parties where she lets all the other nobles know how terrible they are for being oppressive."},{"name":"Lieutenant Althaea Naidel","genderRaceOccupation":"Female Elf Spy","description":" Lt. Naidel joined the army as soon as she was able, her skill with a bow being the best in her village, and her patriotism was unrivaled. As she rose through the ranks, she became known for her ability to take down enemies without making a sound, and she was recruited into the special forces, and later into certain unnamed organizations. She now leads a 4-person infiltration group. She\u0027s good at tactics and at being a spy, but not so good at diplomacy. She\u0027s cold to outsiders, but to her crew, she\u0027s actually kind and warm. They\u0027re her kinsmen, after all, and if she doesn\u0027t look after them, no one will."},{"name":"Ugrah Kardson","genderRaceOccupation":"great","description":" Ugrah only gets mad and starts behaving aggressively if you insult the carpentry of the Kardson line."},{"name":"Justice","genderRaceOccupation":"Female Tiefling Protestor","description":" The young tiefling known as Leria was persecuted for the way she looked. Leria didn\u0027t think this was fair, since she hadn\u0027t done anything wrong. As she grew up, she began to see that discrimination and injustice were everywhere in the world, and it wasn\u0027t just tieflings, so she changed her name and set out to make the world a better place by spreading awareness through public displays where she mostly just shouts about injustice and discrimination to anyone who will listen. Justice spends a lot of her time in prison."},{"name":"Sivashi and Shivari","genderRaceOccupation":"Female Genasi Druids","description":" These two Genasi druids are twins, both seeking to find balance by obtaining the ability to manifest all of the Genasi elements within themselves. Sivashi seeks to find balance among the elements and find true peace, but Shivari wants to conquer the elements for herself. They parted ways once it was obvious that their philosophies conflict, but people often confuse one for the other. Personalities: very shifting, as they\u0027re genasi, but also because they move among elemental manifestations, bringing out different personality traits."},{"name":"Ivy.","genderRaceOccupation":"Female, humanoid, paladin/alchemist.","description":" Rose is a beautiful woman in her mid twenties with blood red hair and emerald green eyes. She does not like to fight very much, but rather just heal her allies and find diplomatic solutions to problems. When one of her allies dies or she gets hurt though, anger overcomes her, and she uses her giant great sword (aptly named thorn) to tear apart those that defile her.   Ivy is the twin sister of rose, and much like rose, uses her potions to buff and heal enemies in battle. She has green hair and green eyes. Rather than try to find diplomatic relations with people, she uses her beauty and deception to get what she wants. She thinks that the brutish ways of her sister are barbaric, preferring to throw poisons at enemies to weaken them."},{"name":"Stack","genderRaceOccupation":"\u0027Male\u0027 Warforged Blacksmith","description":" A blacksmith specializing in the creation and repair of rare and unique armors. He was trained by a retired Dwarven smith, and imprinted on him to the point of behaving like a dwarf and \u0027growing\u0027 a beard made from metal shavings, fixed to his lower mandible. His odd behavior is looked upon as slightly eccentric but harmless, though he makes quite a mess at the taverns when he attempts to have a few drinks. If called out on not actually being a dwarf, he will insist he\u0027s simply wearing a large suit of armor, and will \u0027prove\u0027 it by attempting to remove his head, and complaining that his \"damned helmet latches have stuck again\" when it won\u0027t come off."},{"name":"Orel the \u0027White Knight\u0027","genderRaceOccupation":"Human, Male, Knight","description":" Orel is the somewhat overweight 4th son of respected local lord who followed his father into military service. He cannot understand how he remains single at the ripe old age of 25, despite being such a good guy. All of his female friends are just that, friends, and he will protect them in this dark world of selfish jock-bastards who just want to take advantage of women. Soon, very soon, the ungrateful sluts will finally realise his worth and flock to their real man and recognise a hero of women\u0027s rights."},{"name":"Evangeline (Evan)","genderRaceOccupation":"Female (Male), Human, Squire","description":" This young woman is a struggling squire, dressed with poor quality but well cared for leathers. She is bronzed in skin and dark in hair, which she has cut short and practical. She accepts her lowly position, is dedicated to her training and behaves practically, bar a little autistic need for all statements to be exact and literal. (Male at birth.)"},{"name":"Tarl","genderRaceOccupation":"Male, Human, Inept Mage","description":" An inept junior mage who is considerably overweight already. He grows a poor beard in an attempt to look more wise or senior but only achieves looking like a neckbeard. He suffers severe toilet-related bowel problems at little warning which frequently get in the way of his magic at the most inopportune times. Despite this, he doesn\u0027t wash himself or his own clothes."},{"name":"Sathriel","genderRaceOccupation":"Male, Elf, Cook political upstart","description":" A tall, middle aged elf with early grey hair and a loud mouth, who thinks himself far smarter than his position. A passionate trade-unionist and active [what we would call] Marxist, urging the underclasses to raise up to claim their just rewards."},{"name":"Varan Feddik","genderRaceOccupation":"Male, Dwarf, \"Honest\" Merchant","description":" Lots of brown, almost ginger, hair and an impressive beard frame the lovable face of this wannabe roguish merchant. He is a trusting man and genuinely believes he is an honest merchant but should perhaps trust his suppliers a little less. He only hires honest folk who are down on their luck and despite being arrested several times for selling stolen goods, cannot understand why it keeps happening."},{"name":"Silvos Saltore","genderRaceOccupation":"Male Human Detective","description":" Tall dark and handsome You will never see him without his Glasses of dim light (sunglasses) Frequntly uses terrible catch frases, witch he always finshes by taking of or putting on his Glasses He works for the cityguard as a detective"},{"name":"Karif","genderRaceOccupation":"Male Kobold Naive Performer","description":" A small kobold with big dreams. Karif wants to be a world-renowned singer more than anything else; unfortunately, Karif has a voice like a sword being dragged across flagstone. Unfortunately for everyone else, Karif is completely oblivious to this, and has traveled to the Big City to finally realize his hopes and ambitions. Karif is incredibly optimistic and naive, despite any evidence to the contrary, and is relentless in pursuing his dreams."},{"name":"Lanforn The Great (The Useless)","genderRaceOccupation":"I have a lot of story behind this guy and all of his unintentional antics","description":" Possibly the greatest wizard in all of existence, but also the universe\u0027s greatest irony. Wears the wizarding clothes of his adventuring years, a purple robe and pointy hat with stars and moons all over. Long pointy white beard, and ear hair to match, he is the classic 1E Merlin. Not much is certain about Lanforn, except that none of his spells will go correctly, and he never learns from his mistakes. Trained as a circus magician, he later became a university wizard."},{"name":"Kevin Himmagen","genderRaceOccupation":"Male Human Enchanter and Arcane collector","description":" He owns a large shop. He is in his early twenties and has black hair, a thin black beard and an incredibly mono-tonal voice, despite his excitable nature. Overall very knowledgeable and an astute businessman. He seems to turn up everywhere."},{"name":"Stumpwater Jack","genderRaceOccupation":"Male Half-Orc Hermit","description":" Stumpwater Jack was raised by his witch mother in a small shack deep in a dangerous swamp. He learned a small amount of magic from his mother but did so with great difficulty. One day his temper got the better of him and he ransacked their home and ran off into the wilds. Unaware if he had harmed his mother, he decided not to return. He now wanders the swamp a hermit. He speaks in short direct sentences with little to no fluff. Social graces are a foreign concept to him and on the occasion that he meets someone, he usually offends them. He has a habit of keeping is hands at his side when he speaks, looking almost statue like."},{"name":"Halvar Strand","genderRaceOccupation":"Male Human Adventurer (Retired)","description":" Once a great hero among Northern Isles, Halvar battled great dragons and monsters in his earlier years. His final \"heroic fight\" was against a Leviathan that had been reportedly terrorising a small port town. As he stepped up to the edge of a sea cliff to challenge the Leviathan to battle, he was swept to sea by a massive wave. During the \"fight\" Halvar lost his magnificent sword, \"blixt\" and was so ashamed of this unfortunate turn of events that he fled south in hopes of never being seen again. To this day, he still has a grudge against the Leviathan, and refuses to stand near sea cliffs."},{"name":"Oskar Ungart","genderRaceOccupation":"Beardless Male Dwarf Inkeeper","description":" Oskar is a clanless dwarf by choice, he is also beardless. You don\u0027t get to question his life choices, and better keep your damn trap shut. He is who he is, and is proud of it, dammit."},{"name":"Albert Kelcus","genderRaceOccupation":"Male, Gnome, Alchemist","description":" Albert lives in a small shack outside of town. He is trying to create his very own artificial life however is always unsuccessful. On the bright side, he makes good healing potions (however they always smell of cabbage)."},{"name":"John Kelley","genderRaceOccupation":"Male, Human, Amateur Diviner","description":" John is a very sweet man, but not a very smart man. He has the unfortunate tendency of summoning hostile ghosts and spirits instead of the spirits he intended to summon, this naturally leads to PC\u0027s having to save him from his blunder."},{"name":"Edward Dee","genderRaceOccupation":"Male, Half-Elf, Warlock","description":" When no PC is there to save John from his blunders, Edward does. He is shorter and plumper than one might imagine a half-elf to be but he makes up for that as a rather gifted Warlock."},{"name":"Joyce","genderRaceOccupation":"Female, Elf, Tavern Owner/Retiree","description":" Some Elves do not see near immortality as a gift. Joyce always wanted a simple simple life and at the first moment she got, she opened a small seaside tavern called the Bloated Seagull."},{"name":"Graham Hennessy","genderRaceOccupation":"Human, Guardsman, Charismatic","description":" Graham loves his job, although not the part of the job where criminals hit him with things. He\u0027d much rather solve a problem with his charming personality than revert to violence. He\u0027s no master swordsman, but he\u0027ll show you the sharp end when he needs to."},{"name":"Ysma","genderRaceOccupation":"Female, Elf, Tea shop owner/necromancer","description":" Elves live for quite a long time, as we all know. Elves of course live longer after dabbling with the right kinds of necromancy. She\u0027d never admit to prolonging her life by means of the darker magics. She\u0027d much rather have a pleasant discussion over some tea. Don\u0027t go into her basement though, that\u0027s where she keeps the poor fools who asked too many questions."},{"name":"Celine","genderRaceOccupation":"Male, Satyr, Thrower of Great Parties","description":" Celine is a harmless enough fellow, he and his band of roaming Satyrs kidnap weary travellers for a party that won\u0027t be forgotten (or perhaps entirely forgotten depending on how much wine is served)! In that time, no harm is done to the traveller and after the party, the traveller usually wakes up further in the forest in the direction they\u0027re heading."},{"name":"Errol \"The White Dragon\"","genderRaceOccupation":"Male, Dwarf, Ex-Soldier","description":" Errol was a soldier as a young man. He earned himself the nickname The White Dragon for his prowess on the battlefield as well as his shining white armour. In his old age, he tells stories to young folk and if you ask him how he got his nickname, he just takes in a deep drag from his pipe and blows the smoke out his nose while growling like a dragon."},{"name":"Mother Hannah","genderRaceOccupation":"Female, Human, Wheelchair-Bound Wizard","description":" A sweet old woman and caretaker of a small sanctuary for those learning in need of wizarding knowledge. She will teach young people in exchange for a book from their travels, assuming it\u0027s not one she already has. If you come to her empty-handed, she is very easily persuaded with kind words. If you come to her with harsh words, you may not live to apologise."},{"name":"WOO 10 DONE! THIS IS UNEDITED DON\u0027T HATE ME.","genderRaceOccupation":"Male, Human (as far as he\u0027s concerned), farmer (obviously)","description":" Gerald is a decent enough man most days of the week, but sheep from his flock and livestock of neighbouring farms go missing on Monday nights. Wolves or perhaps bandits are the usual suspects. Gerald is blissfully unaware that he, late Monday evening, transforms into a werewolf. He hasn\u0027t harmed a person, nor has he been spotted...yet."},{"name":"Grandmaster Erobern","genderRaceOccupation":"Male Human Lord Justicar of the Most Noble Order of the Holy Visage","description":" An aged man, once young a full of zeal to smite those of evil intent, the fullness of his years has replaced his strength with wisdom. Erobern prefers to wield his considerable influence with subtlety, a carefully chosen word here, a dissemination of information there. Erobern prefers problems to be solved with the least amount of bloodshed possible. Some factions of the Order see this as a weakness."},{"name":"Justicar Adjutant Snellry","genderRaceOccupation":"Male Halfling Archivist","description":" If Erobern is the spider, then Snellry is the web. Snellry collects information on the activities of evil throughout the realm. Snellry proudly considers himself a shield for Erobern, employing... diverse means of gathering information. Erobern of course, is familiar with Snellry\u0027s activities but allows him a certain latitude for the good of the realm."},{"name":"Galban the Swift","genderRaceOccupation":"Male Half Elf Will of the Visage","description":" Galban holds the highest position in the order below the Grandmaster and travels the land on a celestial steed, speaking Erobern\u0027s will to the chapters of the order, adjudicating disputes and disseminating information. He is renowned for being both fleet of foot and swift to take offence should someone insult the order. He secretly harbours an irrational fear of ship and open ocean waters."},{"name":"Mistress Ariandre Erendril","genderRaceOccupation":"Female Elf Master at Arms","description":" Ariandre is responsible for the instruction in armed combat of all Order members. Some of the younger order members call her \u0027Mother Dee,\u0027 but never to her face. She hears more than they know however. The title causes her particular pain as Galban is secretly her son, born of an affair with a now disgraced former member of the order. She is unsure if Erobern knows this fact."},{"name":"Chaucy Orlan","genderRaceOccupation":"Male Human, Former Knight of the Most Noble Order of the Holy Visage","description":" Chaucy the Betrayer, Chaucy Oathbreaker, Chaucy the Blind, Chaucy the Red, Chaucy the Black. Chaucy fell in love with Mistress Erendil while under her tutelage. On a journey together, in a time of weakness, wine and loneliness, they crossed the divide between student and lover. Chaucy is guilt ridden and travels the land searching out those who would do evil, perhaps looking for penance, perhaps looking for a glorious death for the cause of righteousness."},{"name":"Dranmer Duluth","genderRaceOccupation":"Dwarven Male Knight of the Order","description":" Dranmer is a recently proven Knight of the Order, rapidly making a name for himself with the slaying of bandits, orcs and undead. He unquestioningly obeys the orders of his superiors. Dranmer was beaten by his father as a child, and is particularly harsh when dealing with men who would abuse children."},{"name":"Aera Cloudshammer","genderRaceOccupation":"Dwarven Female Master Armourer of the Order","description":" Aera makes the heavy armours and weapons used by the Knights, infused with the holy power of the divine. She is obsessive about cleanliness and order in her workshop, and becomes agitated if anything is out of place. She has only two fingers and a thumb on her left hand from a raid on her home village in her youth that left all but her dead. Erobern (then a young knight) rescued her and took her into the order. Aera loves the Grandmaster dearly."},{"name":"Denjack","genderRaceOccupation":"Human Male Stablehand","description":" Denjack is recently arrived at the Order, taken on to perform menial tasks and assist in the stables. Denjack hears whispers in his head at night and is unsure if they are divine or malevolent. The whispers are strongest on the night of the full moon."},{"name":"Sunna The White","genderRaceOccupation":"Female Human Cannibal Cleric","description":" A sweet, innocent, middle aged woman. She masquerades as a priestess of the god of the village, while at the same time eating the people who were recently buried. She moved into kidnapping travellers and involuntary euthanasia a couple of weeks ago. She eats people because she learned an immortality rite from a forbidden book that involves cannibalism and blood sacrifices to her true god."},{"name":"Thenmozhibe","genderRaceOccupation":"Female tiefling moneylender","description":" Relatively tall with a wiry build, and no noticeable hair. Carries a many-notched steel staff of exactly five feet that she uses for taking measurements. Spends a month at a time inspecting roads and bridges and recommending changes around a town that hires her before moving on. Understands several languages but primarily speaks Dwarven in conversations with herself and others. His nose makes a faint whistling noise when he talks. Spends his evenings cleaning tables at a friend\u0027s inn in exchange for a room. Average height, broad shoulders, and shaved head with a large greying mustache. Has substantial savings that he intends to put toward building a house in the woods nearby. Twice married to human men less than half her age and twice widowed from duels in her honor. Wears secondhand clothes and jewelry from whichever town she last visited, to be traded in or sold for replacements in her current town. Talented flutist who takes pride in recognizing and developing the musical talents of those around her. Long brown hair, green eyes, and a permanently seductive expression. Dull-witted but friendly, and loyal to his friends and employers (in that order). Unable to speak any language except rudimentary Dwarven, though he understands orders as long as they are in Dwarven. His face is a misshapen mess of scars and broken bones that he has accumulated over the years, and his unkempt red beard has had chunks torn out of it. He is independently wealthy and spends coin generously, though nobody knows where or how he has amassed such a fortune. Short brown hair, a hawkish nose, and a large pair of canine teeth jutting up from her lower jaw make up an unusual visage, if not a particularly ugly one. She does not boast many clients, but those that pay will pay very well for her services - and highly recommend \"that thing she does with her teeth.\" Offers a money-back guarantee if clients leave unsatisfied, which no one has yet been able (or willing) to claim. Spends most of her free time passing by the homes of the nobility, admiring their gardens. Straight black horns follow his thin white hair back behind his head; rheumy brown eyes sit above a thin-lipped business smile. A team of apprentices run the day-to-day operations while he sits in the back of his shop, dreaming up and sketching fashion ideas. When a client of sufficient value enters, he becomes as authoritative and demanding as any tyrant, and will often simply forbid a troublesome client from speaking altogether; it is a testament to his prowess that business does not waver. He holidays with his paramour among the nobility once each year, whose identity he keeps secret largely for his own sake. Standing six feet even, Sash is heavily muscled and deceptively quick; her hair is tied back and she has silver tattoos over her arms and legs that stand out in stark contrast to her ebony skin. She\u0027s a bouncer for a tavern that sees very little business during the day, but much more when she\u0027s managing the tavern\u0027s fight pit after midnight. She regularly takes a week off to visit her family out of town, though once in a blue moon she\u0027ll take one of her many challengers up on their offer for a fight in the pit. Her tattoos are in Orcish - what she thinks says \"Swiftness,\" \"Vengeance,\" \"Fury,\" and \"Resolve\" actually says \"Fruit,\" \"Southeast,\" \"Brownly,\" and \"Dwwabmmh.\" Soft white scales run from the crown of his head and flare out all the way down his spine, while the rest of him covered in smooth, leathery grey skin. At his full height, he is a scale under six feet tall, with the tendency to crouch or bow his head to better hear those smaller than him. While young for his kind, he is very sickly; on any given day he might be sweating or coughing heavily, and he usually sounds exhausted. On rare occasions (months apart), he feels genuinely, truly good for days at a time, during which he shuts himself in his tiny home and works non-stop as his cultured colleagues await the results with baited breath. Short and stocky frame, with asymmetrical, broken brown horns that have been filed smooth. She can be very abrasive, and speaks openly about her distaste for her clients, her hired thugs, and the business of moneylending. She balks at spending money herself, though she is quick to jump on a deal if she\u0027s certain she can turn it over in her favor quickly. She refuses to deal in silver pieces, in an often futile attempt to invoke her demonic heritage for leverage."},{"name":"Lana of the Riverlands","genderRaceOccupation":"Female Watergenasi Hermit/Druid","description":" A weird old woman that lives in a small hole by the riverside. She takes care of the ecosytem of the riverland around where the river Vree flows into the Great Green Sea. She sees herself as the guardian of the river, having lived here for almost 40 years. She avoid human contact most of the time but some days she visits the town of Vreedam, where she tends to the sick and poor. Most of the normal citizens of Vreedam see her as a harmless nutter, but to the homeless, beggars and orphants she is seen as a kind of saint. Whenever she goes throught the streets there is allways a swarm or urchins surrounding her and she allways has some goodberries to spare. Her hair has turned the colour of sea foam and her sky blue skin has as many wrinkels as the sea during a storm, her back isn\u0027t what it used to be either so she is seldom seen without the driftwood staff she uses for walking. But her eyes are still the same as in her youth. Big eyes that catch the light and reflect it like a mountain lake on a windless day. Yet also deep and blue like the sea. Eyes that you could loose yourself in and drown. And many a man did back in the days. The old folk can sometimes tell of a time where every man was trying to court the mysterious lady of the shore. Yet none succeded. None but one."},{"name":"Kareem the Bright, Captain of the Ocean Dawn/Bard","genderRaceOccupation":"Male Fire Genassi Captain of a trading ship","description":" When he first arrived in Vreedam the news spread like wildfire, soon every young womans heart was burning with a passion. He was handsome, he was charming, he was exotic. In one word, he was hot. The Ocean Dawn hailed from Brangha, a big trading city in the far west. She was carring fruit, spices and silk of sorts people in Vreedam had never seen. The Ocean Dawn stayed in harbour for 3 weeks. Quite a long time. Why you ask? To celebrate the Dawns arrival the major decided to hold a massive party, it doesn\u0027t happen every day (or even year) that a ship from this far west found it\u0027s way to Vreedam after all. There was music and dance, food and alcohol, laughter and cheering. And at the center of it all was Kareem. Allways surounded by a flock of young woman, first dancing with this one, then with that one. Then he was gone. As if by magic. Which in a magic rich world like this seems actually quite likely ;) You see Kareem isn\u0027t actually quite the party type, while he loves to dance he doesn\u0027t like big crowds. He is honestly a bit of a loner. And so it came that on this fatefull night an again visible Kareem decided to take a stroll along the beach. And it was here, where the Vree joins the Great Green Sea that he met her. Deep Blue hair blowing in the ocean breeze, looking out towards the sea with eyes that reflected the moon and the stars. Their eyes met and Kareem could feel his heart skip a beat. The next day some folk reported seeing two figures dancing on the waves, only their silhouettes visible against the morning sun rising from the ocean. The Ocean Dawn left 3 weeks later, to travel to the Small Green Sea and sell the rest of it\u0027s wares and return a few weeks later to Vreedom to let of a single person and then travel back west to Brangha where it would have to find a new captain. This was the last anyone saw of the Oceans Dawn for 35 years."},{"name":"Jasper de Wit","genderRaceOccupation":"male human swashbuckler/rogue","description":" Blond, longish hair, slightly tanned skin, blue eyes, of average height for a 19 year old. Jaspers mother died in childbed and his afther died 4 years later out at sea working as a fisherman. Jasper grew up on the streets of Vreedam, a town that doesn\u0027t do much for it\u0027s homeless and orphants. He is good friends with Lana of the Riverlands. During some especially hard times the goodberries she gives to the orphans were the only food he had for weeks. He considers this a lifelong depth he owes her. He left the town with 16 with little more then the shirt on his back. He returned 3 years later, wearing fine clothes and carrying a purse full of goldcoins. Some foul mouths would tell you that the ways he got this money weren\u0027t quite legal. They are right. Jasper dreams of marrying the mayors daughter Anika Hummel and opening an orphanage in Vreedam. And he is allready making progress towards these dreams. Well at least the first one."},{"name":"Anika Hummel","genderRaceOccupation":"female human daughter of the mayor","description":" Long chestnut hair, green eyes, freckles in her face and on her arms. He allways has a smile on her lips and is of quite tall for a 20 year old woman. Many of the young men in town try to court her, not only because she is quite good looking but also because she is the daughter of the mayor. She politely refuses all of them. Unbeknown to everyone she and Jasper have been seeing each other for a few months now. Meeting in secret. She knows that her father would not aprove of her relationship woth Jasper, her mother might. People that know of the relationship: Jasper de Wit, Anika Hummel, Lana of the Riverlands, I will add more as I add characters"},{"name":"Hugo Hummel","genderRaceOccupation":"male human mayor of Vreedam","description":" Ash blond short trimmed hair and beard, blue eyes, middle aged, relativly small for a man, beer belly. Needs reading glasses. Hugo has been the mayor of Vreedam for the last 25 years and has actually done a quite decent job. Since he became mayor the town has seen a stready grow in population and prosperity, trade has been good and the depth that the old mayor managed to create has been payed of in full. (The old mayor was fond of throwing parties for various ocasions using town money.) The Hummels have been a merchant family in Vreedam since its inception 300 years ago. They used to own the very first corner store. Where it stood before now stands the Hummel Trade hall, which hosts most of the trade going on in Vreedam. Hugo is very proud about Vreedam and the development it has seen during his time. Whenever talking about it he has taken to calling it the City of Vreedam thought nobody else has adopted this yet. He is the father of Anika Hummel, husband of Natalia Hummel and big brother of Henry Hummel."},{"name":"Natalia Hummel","genderRaceOccupation":"Female Half-Elf Wife/Mother","description":" Long chestnut hair that she wears in a bun, green eyes, still very good looking for her age. She was born a De Haan and married Hugo 30 years ago when they both were barely adults. They were what some might call fools in love. Sadly over the years the fire of passion faded and their mariage is hardly what you could call passionate. The things that binds them together is the love for their daughter Anika. Natalia is a strong woman and while her husband is the mayor, there is no doupt that in the Hummel household she calls the shots."},{"name":"Henry Hummel","genderRaceOccupation":"Male Human Head of the trading hall","description":" Ash blond short hair, blue eyes, quite tall. Allways a winnig smile on his lips. While his brother became the mayor of Vreedam, Henry took over the family buisness of managing the Hummel Trade Hall throught which most of the trade in Vreedam flows. You will usually find him either in the hall or at the harbour speaking to some merchant or the captain of a trading ship in their native language. Few people know that he actaully owes this gift for languages to a magic ring of languages that allows it\u0027s wearer to read any language and speak to people in any language they know. The ring has been a family heirloom for generations and its origins are said to be of not quite holy nature. (It was demons, some ancestor sold his soul for this ring) Henry is also the biological father of Anika. A fact only him and Natalia know."},{"name":"Annabel the Poppet Master","genderRaceOccupation":"Female Human Possessed girl","description":" Annabel was a normal 10 year old girl before she discovered a tiny doll in the woods. The doll spoke to her, and when she answered, it possessed her. She now wanders the forests and swamps waiting to curse anyone foolish enough to venture into her territory."},{"name":"Jute the Dragoon","genderRaceOccupation":"Male Formerly-human Wandering warrior","description":" Long ago, \"Jute\" was grievously wounded in a battle. Though it was too late to save his body, his allies transferred his consciousness into magic rope, which served as his body ever since. He wears heavy armor so he appears to be a normal human, but he is actually composed of tendrils of rope. He has wandered the world so long that he forgot his real name. He rides an ankylosaurus named Sige."},{"name":"Dywin the Purifier","genderRaceOccupation":"Female Elf Human slayer","description":" Dywin is a pureblooded elf who was raised to despise all elves of impure blood and the humans that corrupted them. She travels the world silently weeding out the half-elf population and inflicting justice on any human who would dare breed with an elf."},{"name":"Burgten the Skull Smasher","genderRaceOccupation":"Male Half-orc Tribe leader","description":" Burgten takes great pride in his orcish heritage despite being only half orc. He instills loyalty in his tribe by leading them to victory after victory in combat. However, he is also a shrewd diplomat, and has secured his tribe protection from the major empires that surround him."},{"name":"Leiris","genderRaceOccupation":"Female Aasimar Druid","description":" Leiris wanders the forests without a care. She helps anyone who seeks her aid, but never actively seeks to find people in need. Her animal companion is an elk."},{"name":"Person from Porlock","genderRaceOccupation":"??? ??? I don\u0027t remember","description":" The Person from Porlock visits in moments of epiphany to drain inspiration. Works especially well on Bards. It\u0027s unknown if the Person from Porlock is a single individual or a race of beings."},{"name":"Haftir the Immortal","genderRaceOccupation":"Male Dragon All-consuming destroyer","description":" Millenia ago, Haftir was the destroyer of civilizations. Every thousand years he would emerge from slumber to destroy any civilization that had appeared since his last visit and hoard away all their gold in his cave. However, he now sleeps forever, helpless to move because his gold was formed into a chain around him by a clever human, which he values too much to break."},{"name":"Raven","genderRaceOccupation":"Male Drow Information broker","description":" Raven buys and sells information. Everyone hates him because he\u0027s a dick, but his information is so valuable that everyone puts up with him."},{"name":"Lexi Prottimer","genderRaceOccupation":"Female Human Entrepreneur","description":" A member of the wealthy Prottimer family, Lexi is just beginning her financial enterprises. Aiding her may result in gaining the family\u0027s trust and/or aid, which could be invaluable."},{"name":"Laurelin etherborn","genderRaceOccupation":"Female elf druid","description":" Laurelin was abandoned as a child in the green forest when her family was captured by a band of orcs. She was adopted by the forest spirits and became one with the land. Raised by wild spirits, Laurelin is an untamable druid with a deep understanding of the natural world."},{"name":"Hanuman das","genderRaceOccupation":"Male human monk","description":" Train as a monkey-priest in the far eastern lands, hanuman is incredible agile. He enjoys the simple life: Wandering around the world, eating whatever the people give him, and helping others to find their inner-selfs. He stands out from the medieval townsfolk as a tall and slender hindu man with colorful robes."},{"name":"Forthrightly Goldwine","genderRaceOccupation":"Female Halfling Thief","description":" An experienced cutpurce, Forthrightly was named by parents who hoped she\u0027d be polite, hardworking and to-the-point. Able to lift herself out of the poverty they raised her in with honest labor. They don\u0027t talk much anymore."},{"name":"Gormundr Halfshanks","genderRaceOccupation":"Male Goliath Hunter","description":" Gormundr leads the Mountain Rangers, a group of outcasts who live in the shade of the mighty peaks. Though they tend to be shunned by civilized society they perform an important role, holding back the great beasts, aberrant monstrosities and occasional shambling undead that roam from their natural habitat to the borders of farmland. While they aren\u0027t free their services are invaluable to small villages who are paid no heed by the larger cities."},{"name":"Rock","genderRaceOccupation":"Male Goliath Moron","description":" Rock isn\u0027t his full name, but it\u0027s the best translation of what the other members of his tribe call him. Though he attempts to be useful and has prodigious strength he is... untroubled by the complexities of life. If given any task of greater complexity than \"Take this heavy thing to here\" he\u0027ll find a way to make it go wrong, without even a malicious thought in his head."},{"name":"Magnus Hammerhand","genderRaceOccupation":"Male Dwarf Commander","description":" Unprepared for the sheer brutality of war with the Goblin tribes of their new mountain home the expedition that sent Magnus to Fort Strongbow was slaughtered, with barely a hundred of a thousand-strong caravan making it to their destination. With an outpost set up however Magnus took charge of the remaining warriors and proved that Dwarves are nothing if not tenacious. With all thought of mercy stripped away by the years of bloodthirsty combat Magnus\u0027 mission is to keep his people alive and pacify the mountains for Dwarvenkind."},{"name":"Ruallion Thanaton","genderRaceOccupation":"Male Elf Wight","description":" Ruallion was a hero of Elvenkind. A brave warrior who died in glorious battle with his barbed spear still clutched in hand, stained red with his own blood and that of his enemies. However when a storm of wild magic washed over his forgotten corpse he was reanimated as a shade of his former self, a being of pure malice with no direction or purpose. Now he stalks the earth, roaming from the fields of civilized lands to the caverns of the underdark to the gutters of ancient cities. With nothing better to do and an unquenchable lust for blood Ruallion sells his services to the highest bidder as a shock-trooper and assassin, not for the money but for the sake of killing and the desperate search for purpose. The Red Wight doesn\u0027t need to breathe, doesn\u0027t need to sleep, doesn\u0027t need to eat and is just as deadly dead as he was alive."},{"name":"Julliana Orsendi","genderRaceOccupation":"Female Human Broker","description":" Working under the pseudonym \"The Lark\" Julliana inherited her family\u0027s side-business while her father and brothers were off riding horses and filling themselves with arrows in their spare time. The women of the Orsendi family are just as vital as the men to retaining their status, and they do this by maintaining a large network of spies and informants in every noble house from here to the next country over. The information that gets passed to them finds its way to the ears that need to hear it, for a price. Julliana is the eldest of four sisters and the current mistress of the nobility\u0027s secrets, though what she decides to do with them will depend on who\u0027s paying."},{"name":"Nefyros the Dracomancer","genderRaceOccupation":"Male Dragonborn Wizard","description":" Nefyros is one of the foremost scholars on Dragon lore currently alive today, and according to rumor is the original author of the Dracnomicon sustained by black magics. This is of course nonsense, though he did have a hand in editing the later editions of that famous text. Nefyros has devoted his life to the study of dragons, driven by some purpose that leads him to delve deep into their secrets. Untouched by the sorcerous magics that grant power to a few with true draconic blood Nefyros instead entered into the study of arcane magic, and is a master of transmutation. Thus far however, all of his experiments with turning himself into a dragon have failed to produce permanent results, and have almost lost him his research funding a couple of times."},{"name":"Strife Harkanon","genderRaceOccupation":"Male Human Bandit Leader","description":" Presumed to be a pseudonym, mainly because it\u0027s extremely cool or stupidly overblown depending on who you ask, Strife is a relative unknown among the lawless brigands of the world. What little is known from captured members of his band of thieves and pillagers indicates that he was a child soldier, following his father off to war when he was only a young boy. His fellows grew up under similar circumstances, pitiless and amoral men forged in war at a young age. The bandit leader is known to be a capable warrior and utterly without sympathy for the weak, despite multiple offers of amnesty he seems to have committed himself to an existence of lifelong strife."},{"name":"Lu\u0027Nahan, the Dark Side of the Moon","genderRaceOccupation":"Ineffable Alien Thing","description":" A being from the far realm that has come close to the world, drawn by the burning light of the world\u0027s life like a moth to a flame. Lu\u0027Nahan dwells as a shadow on the dark side of the moon, its mind reaching out to the world by night to touch the minds of mortals who would serve its ends. Its purpose is uncertain, but it feeds on the light and the heat and those who worship it desire to bring it down to the world, with the moon if necessary."},{"name":"Vilendas Easterling","genderRaceOccupation":"A 5\u002711\" half elf male with sandy blond hair trimmed short and combed into an almost swooping way with and angular jaw and sharp features. No facial hair.","description":" Pretty good looking and popular with the ladies as well as men, this is a local language teacher at the secondary school for the educationally gifted sons who can attend. This is the best school in the country. Here he teaches primarily mastery of common and proper writing etiquette and composition. He also enjoys theater and directs plays as well as providing his own screenplays."},{"name":"Charlie the Somewhat Smart","genderRaceOccupation":"Male Human ex-merchant Wizard","description":" Some people have mid-life crises. Such is the case with Charlie, who prefers to be called Charlie the Smart. Some adventurers came into his shop a year ago and tried to sell him a spellbook they found. Considering he was running a grain and livestock feed store, he was hesitant. But he took the offer and has since left his shop with his son and decided to find adventure."},{"name":"Ledus Pacus","genderRaceOccupation":"Female Minitaur Retired Mercenary","description":" She is tall at seven feet, with greying chestnut fur. She retains much of her muscle, but is going soft around the midsection. She can be gruff and callous, but she is a font of information about the local area and abroad. Drinks milk, which is objectively weird."},{"name":"Reah van Nynaaten","genderRaceOccupation":"Female Dwarf Mayor","description":" Short and heavy-set. Black hair tied back into a thick braid. The mayor of a small town. She is full of new ideas like \"democracy\" and \"civil rights.\""},{"name":"Lobelia Mustard","genderRaceOccupation":"Female Halfling Fighter (ex-paladin)","description":" Drug addict. Lobelia is about as wide across as she is tall. Red hair and sallow skin. Her armour is unpolished and she stinks. If she hasn\u0027t had her fix recently she\u0027s a grump."},{"name":"Tasai Qamio","genderRaceOccupation":"Female Human Bureaucrat","description":" Tasai is a diplomat from the north. She is campaigning across the countryside, amassing supporters on a platform of religion and military training. She has not explicitly announced her opposition to the crown, but many suspect that she intends to become a usurper."},{"name":"Uazmos Txigu","genderRaceOccupation":"Female Eladrin Bard","description":" Uazmos is talented, beautiful, compassionate, and confident. She is known far and wide for her powerful presence, strong will, and her generosity towards the less fortunate. Her songs often make overt jabs at the priorities of the court."},{"name":"Ximmiant Teseoah","genderRaceOccupation":"Female Dwarf Ceremonial Fighter","description":" Ximmiant is a veteran of the Vela Key Arena. Her sport of choice is batter ball, and every season she is the favoured competitor. Her mother was an oracle, and many suspect her skill is owed to an inherited precognition."},{"name":"Corvus Allabaster","genderRaceOccupation":"Male Kenku Accidental Jewel Thief","description":" Having been born with all white feathers and sky blue eyes (a bad omen in his flock) Corvus was exiled at age 12. Being a bad omen others of his flock avoided him so they too wouldn\u0027t be outcasts, this of course caused him to develop no social skills, and he\u0027s an accidental thief partly because of this and partly for just being a Kenku, for they have no teeth so they rely on their gizzard which means they need to swallow small rocks and pebbles to help grind food, and Corvus, not knowing that gems have value, has ingested many \"shiny stones\" that has resulted in many hardships and enemies"},{"name":"Eyef","genderRaceOccupation":"Female Aasimar Cleric","description":" A spunky woman with pale skin, emerald eyes and metallic blue hair. She was left on the doorstep of a temple to Shelyn as a baby. She greatly enjoys the fine arts, and she is gifted in the dulcimer and singing. She has a free spirit and tries to see the best in everyone."},{"name":"Brad Greyfinch","genderRaceOccupation":"Male Human Pickpocket","description":" A teen who wanted to see the adventures of war, Brad left his home to enlist in the army as a messenger boy. However, when army discipline and war proved to be too much for Brad, he deserted and lost himself in a big city. Having lost all of his youthful optimism, Brad now works as a pickpocket for a local crime syndicate. He tells himself that there\u0027s no way to change his life now, and that he\u0027ll probably be a criminal until he dies."},{"name":"Mattin Bathew","genderRaceOccupation":"Male Human General","description":" A middle-aged noble who has fought in the army for decades. Calm and collected, he has a remarkable talent for directing armies on the field and in directing them when not in combat as well. He is a widower, although he has two grown sons who also serve in the army. He cannot hold his liquor well at all, and so he refrains from drink when on the campaign trail."},{"name":"Costa Caro","genderRaceOccupation":"Male Human Assassin","description":" Costa is a lean man with a perpetual five o’clock shadow. He has dark eyes and longish dark hair with streaks of grey at the temples. He’s a handsome enough guy, though he looks a little dangerous. He’s obviously a good fighter, to anyone who knows about fighting. He has olive skin and stands about 5’ 7”. He’s not heavily muscled but he’s definitely not scrawny. He comes across as a confident but suspicious man who lives with one foot in the streets and one foot in the respectable world. Costa has an easy laugh and a gregarious manner, but his emotions don’t seem to really reach his eyes. He’s obviously seen some crazy shit and it’s deadened him a little inside."},{"name":"Crazy Stan","genderRaceOccupation":"Male, Human, King/General/Ambassador/Adventurer","description":" Old and worn, with hairs of grey he wears old clothing, and has an unkempt beard, on his right wrist he wears a Platinum Bracer, and on his back is an empty scabbard, fit for a Greatsword. His Stories, while almost never true, are the stuff of legend, and are quite amazing to hear, even though he constantly refers to the times these stories took place in as, \u0027Back in My day\u0027 He frequents the inn, and offers to tell one of his stories if the adventurer would buy him a drink. It\u0027s not known if he has any sort of home, or other belongings, as he hasn\u0027t left the inn in years."},{"name":"Caleb Stonehead","genderRaceOccupation":"Male Human Peasant","description":" Caleb is a kind-hearted simpleton. He\u0027s easily fooled, but always has the best of intentions and frequently goes out of his way to help others. He\u0027s strong, with massive hands, and would likely make a dangerous opponent if one ever managed to truly anger him."},{"name":"Ashlan Tinderfoot","genderRaceOccupation":"Male Halfling Innkeep","description":" Once a typically jolly halfling, Ashlan fell to despair and drink after his wife died in childbirth. His inn is falling into disrepair, and he all but ignores the child."},{"name":"Estheria Willowbreeze","genderRaceOccupation":"Female Elven Anthropologist \u0026 Archeologist","description":" Estheria spends her long life traveling, embedding herself within primitive cultures to study their ways. She has published several lengthy books. Her time among simpler folk have affected her worldview tremendously, and she no longer has much interest in returning to the haughtiness and arrogance of traditional elven culture."},{"name":"Borhild \"Werewolf\" Dagmarson","genderRaceOccupation":"M – Human – Wrestler","description":" A large man dressed in fearsome furs, Borhild \"the Werewolf\" is the skull-crushing underground brawler who even the villains of the ring will unite against. Secretly, he wishes to exit the business and inherit the small shop where his parents sell hand-knitted tchotchkes."},{"name":"Lord Snellby","genderRaceOccupation":"M – Half-elf – Snake oil dealer","description":" Traversing the rough roads in his wagon full of elixirs and faux noble getup, Ersatz Snellers (\"Lord Snellby\") peddles his wares, half of them no more potent than water."},{"name":"Kaéshek","genderRaceOccupation":"F – Shadow Elf – Warrior/Leader","description":" When the slave revolts in Bashraqqa began, the people looked to a hero. Kaéshek is who they found. Long free herself, she had hidden connections to the shadowy organizations which bankrolled the revolution. Now she must lead the free city, trying not to become a puppet of those same secret societies which lifted her to power."},{"name":"Corélia, Lady of Estorin / Lareth Brymarr","genderRaceOccupation":"??? – Elf – Aristocrat/Con artist","description":" Townsfolk have long noticed the striking similarity between Lady Corélia, and local con man Lareth. Fear of displeasing either, however, prevents them from investigating which is their true identity. However, they both seem to have an affinity for archaic literature."},{"name":"\"Empress Margitte\"","genderRaceOccupation":"F – Dwarf – Drunkard","description":" The \u0027Empress\u0027, as she calls herself, has become a local attraction in the fishing village of Arbell, dispensing her own sort of truth and wisdom from atop her crate in the town market as she solicits coppers from those who take pity or are humored by the elderly woman, beard filled with trinkets of the years."},{"name":"Tyrell Gwyferon","genderRaceOccupation":"M – Human – Mercenary","description":" Sick of living in the shadow of his older sister and being the son of a baron\u0027s head servant, Tyrell set off on his own years ago, eventually finding himself pike-and-sword in hand in the ranks of the Chequered Band, a company of ill repute."},{"name":"Father Duma","genderRaceOccupation":"M – Human – Priest","description":" Long ago, he was Dumatoru, a centaur paladin with a firm belief in the inferiority of all other races to his own. That changed when he met Charal. Now, with the help of a magic talisman, he lives a quiet life (without his equine half) with the love of his life as keeper of a small town temple."},{"name":"Lzara","genderRaceOccupation":"F – Wood Elf – Survivalist","description":" Princess Lzaretta Anabella Wembelia of Cypressfell was the subject of a large bidding war between suitors. Her solution? Strike out on her own into the thick forests of her homeland, stating the first of her admirers to find and retrieve her will win her hand. Six years later, Lzara has found a peaceful life among the trees with only her axe and falcon familiar as companions, with no end in sight to the philanderers\u0027 hunt."},{"name":"Erwolg, the Terrifying (known as Erwin in this plane)","genderRaceOccupation":"M – Kobold – Lighthouse keeper","description":" A stout man of deep red skin and twisted features. His heavy cloak and solitude in his lighthouse hide the fact he is in fact a demon cursed to watch the seas for a millennium. An expert in chess."},{"name":"Boaz Oxenrider","genderRaceOccupation":"Male Human Merchant","description":" Tall, beginner\u0027s pot belly, short brown hair, \u0026 no facial hair. First generation merchant from a long line of farmers \u0026 looking to start a legacy for himself. Protective of close family \u0026 sends money back to support parents \u0026 younger siblings."},{"name":"Kanaka Ironshirt","genderRaceOccupation":"Female Dwarf Fighter","description":" Shaved head, waist length black beard braided into a single rope, \u0026 speaks in heavily accented common. First daughter of a matriarchal clan out to prove her worth to follow in her mother\u0027s bootsteps. Quietly believes she can do anything better than whomever is doing it \u0026 never backs down from a challenge. Insists that Moradin is not the All-Father, but instead it\u0027s Moradina, the All-Mother."},{"name":"Ben Alda","genderRaceOccupation":"Male Human Doctor","description":" Skinny, dark hair, smart, \u0026 doesn\u0027t know when to shut up. Conscripted at 20 to serve in a war \u0026 taken from his family for 11 years. He was no good as a soldier so he was sent to train under the healers. Always has a story/complaint about the war, a line for the women, \u0026 a drink in hand if he can help it."},{"name":"Milo Littlefoot","genderRaceOccupation":"Male Halfling Beggar","description":" Slight even for a halfling, the adventuring life was never in the cards for Milo. Born with a lame leg \u0026 not able to get a job, he turned to begging. No one notices a halfling beggar \u0026 it turns out that\u0027s good for the information business."},{"name":"Caplan the Crooner","genderRaceOccupation":"Male Dwarf Bard","description":" Taller than average for a dwarf with light brown hair \u0026 beard. Deep, raspy voice that sings of loss, love, \u0026 the places those two have met. His height made him an oddball amoung his dwarven home \u0026 he hit the road to see the world."},{"name":"Fref Glenaw","genderRaceOccupation":"Male Human Tailor","description":" Fref is a good businessman who is eager to expand his own business, but will help with many business opportunities he is offered. He abides by the laws of society but if he can bypass them he has it within him to become a sadistic torturer who enjoys screaming. He is in his seventies, small in every dimension, with a bird-like face and swept-back white hair."},{"name":"Gorb","genderRaceOccupation":"Male Half-Orc Politician","description":" Gorb is small as half-orcs go, but a talented politician. He is wary of threats to his position and those in his care. He was never a great warrior, but when he fights, he uses strategy and tactics over strength."},{"name":"Harmin Dangehr","genderRaceOccupation":"Male Dwarf Captain of the guard","description":" Harmin is a fierce fighter and will send himself to the death to protect those in his care. He uses an enormous greataxe. However, he prefers to defend than to attack, and is in favour of walling people in to take care of them better. He is extremely untrusting, but extremely trustworthy."},{"name":"Amiko","genderRaceOccupation":"Female Human Innkeeper","description":" Amiko is middle-aged and of medium build. She does not suffer fools, and is reasonably intelligent, but serves a damn good pint. If there\u0027s any trouble in her inn, it ends up on the street sooner rather than later, but she will fight for the right cause."},{"name":"Amilee Nightfall","genderRaceOccupation":"Female Half-orc Guard","description":" Amilee is tall, even for a half-elf, with pitch-black hair. She fights for what she thinks is right, but is foolhardy and headstrong, and will fight for a lost cause to the death."},{"name":"Bzor","genderRaceOccupation":"Male bugbear guard","description":" Bzor wants to eat the humans, but the humans give him money to hit other humans with clubs instead. Money can buy pigs, which are tasty. Bzor hit what bzor is told to hit. Bzor is good in the woods, and hates other goblinoids he cannot convince to join his own worldview."},{"name":"Emblem","genderRaceOccupation":"Asexual Treant Druid","description":" Emblem sees himself as protector of the forest. It despises war and the instruments of war, preferring meditation and mediation. It will teach the PCs meditation if they will allow it to smash their weapons and armour, which will give them extra points of concentration."},{"name":"Semaphora Underwood","genderRaceOccupation":"Female Halfling Baker\u0027s Apprentice","description":" Semaphora wants so badly to be a sexual deviant, but she has the worst luck with it. She\u0027s got a thing for beards, but that just nets her gay dwarves and bearded ladies. She will go to absurd lengths and always fail stupidly."},{"name":"Herb Amakiir","genderRaceOccupation":"Male half-elf painter","description":" The son of the butcher, Herb loves to paint, and is very good at it. He gained the skill and passion from his father, but is often told to get back to work on something that will put food on the table, which, when you work as a butcher, is very literal. He paints wherever and whenever he can, out of his father\u0027s gaze."},{"name":"Baldrick Fancyson","genderRaceOccupation":"Male Human Innkeeper","description":" Baldrick is a human who looks like a short, wide dwarf, down to the beard. He uses stilts when behind the bar. His big bar idea was to cater to the merchant wagons that pass through the city, and he has enormous, well-supplied stables to this effect. He thinks a lot of his bar and keeps it posh, making sure that there are places for mud and rain to be disposed of before entering the common room. Fantastic cook."},{"name":"Georgina","genderRaceOccupation":"Female Human Tailor","description":" A heavyset woman of average height, Georgina has an optimistic disposition but tends to be precise and direct when speaking considering the use of extraneous words below her intellectually. She is known for two things, always having the latest clothing fashions and stretching constantly."},{"name":"Brian Johnston","genderRaceOccupation":"Male Half-Elf Lawyer","description":" While Brian may have some unusual features such as a gap between his front teeth, slightly worn clothing and a hacking cough, he is a charming and cultured man with a tall thin frame. He wears a set of small spectacles and keeps his hair well greased. His choice of phrases clearly hide second meanings and innuendos and should always been listened to carefully."},{"name":"Belinda Stoneworth","genderRaceOccupation":"Female Dwarf City Guard","description":" Working for the guard was not Belinda\u0027s first choice of career but her lack of physical fitness prevented her from joining the standing army. She still gets to carry a weapon and has a modicum of power so it will suffice. Loud and surly, she is often found having drunken arguments and fights at the tavern after hours. Despite this, she is a model guard."},{"name":"Roderick Nestfellow","genderRaceOccupation":"Male Gnome Barber","description":" Roderick has been a barber for the last 40 years and loves his work with a fanatical zeal. His customers are very regular and are happy to come in for a good shave and a better conversation. Through the years, he has acquired quite a few great tales and rumors and is always more than happy to retell them all with great exaggerations and embellishment."},{"name":"Roson","genderRaceOccupation":"Female Dragonborn Performer","description":" Everyone has their preferences and it seems a lot of people love to see a dragonborn dance. Roson dances in a tavern but never unclothed. She loves the attention of locals who find her kind so intriguing. She keeps an observant ear of those shes met and their stories which she then collects in her countless journals."},{"name":"Eilidh Grace Dickinson","genderRaceOccupation":"Female Halfling Child","description":" Eilidh has grand dreams of adventure and dragon slaying much to the dismay of his parents. He runs the paths of his village with a stick for a sword slaying the beasts in his mind and chasing off his fellow children. He assaults any adventurer he sees with questions of their exploits before running off to include these new stories into his own."},{"name":"Isabelle Webb","genderRaceOccupation":"Female Tiefling Blacksmith","description":" Despite the trappings of her lineage, Isabelle leads a good and quiet life as the blacksmith in a small town. Through her time there, the locals have come to like her even if they don\u0027t fully trust her. She has a muscular build and calloused hands from her years of hard work. Her muscles twitch regularly when she isn\u0027t working but she no longer notices these things."},{"name":"Borgard Tortuga","genderRaceOccupation":"Male Human Sailor","description":" A salty sailor in his mid 40\u0027s usually suffering from unemployment and an abundance of stories. Personality: Loves cats, drinking, fighting, and whoring. You can usually find him in a tavern by the docks, he is 5\u0027 9\" of medium build with dark hair and eyes. When pressed he will tell you the location of a secret treasure."},{"name":"Lumpy Untata","genderRaceOccupation":"Female Halfling Office Manager","description":" A young idealist who works on a chicken farm, Lumpy dreams of living in a big city. She has a love for reading, sewing, and finding someone to chat with at length. Lumpy is very attractive at 3\u0027 8\" with a nice build, green eyes, and sandy colored hair. She is in touch with all of the town gossip and is a great source of information once you get a few drinks in her."},{"name":"Kane Firebrand","genderRaceOccupation":"Male Tiefling Thief","description":" Standing at 5\u0027 6\" with reddish skin and black eyes, Kane Firebrand is not someone to be messed with. Kane can usually be found in the seedier parts of town, committing acts of robbery, theft, and general burglary. Kane has a short temper but is quick to offer his services in exchange for cold hard gold. Beware, if you pry too deeply into his business, you might find yourself on the end of his dagger."},{"name":"Welby Two-Beard","genderRaceOccupation":"Male Halfling Barkeep","description":" An idealistic and very gullible simpleton. Has a long beard separated into two braids whicn he might actually believe are two separate beards. Can very easily be convinced to do almost anything."},{"name":"Orlisk","genderRaceOccupation":"Male Dwarf Hermit","description":" Salty, irritable, and unlucky, this dwarf was outcast from his clan over a moral dillema at a fairly young age. He has since turned to drink and is unlike to trust anyone. He has forsaken many dwarf traditions, has trimmed his beard, lives alone, and forgotten his family name."},{"name":"Reardon Sengar","genderRaceOccupation":"Male Elf Squire","description":" Raised in nobility, Reardon has an overdeveloped ego and falls back on his family name in almost any circumstance. He has a strong sense of morality but an even stronger desire to have things go his way. He rolls his eyes often and is generally irritable and pompous."},{"name":"The Storm","genderRaceOccupation":"Male Half-elf Sorcerer","description":" \"The Storm\" is unlikely to reveal his true name. He\u0027s young, but not quite young enough to justify wearing all black, being very angsty, and referring to himself in the third-person by a superhero-esque monicker. He makes every attempt to remain mysterious but often breaks the illusion by grumbling about his parents. He is a surprisingly skilled magic-user."},{"name":"Brando","genderRaceOccupation":"Male Human Gang Leader","description":" Brando towers over most men and is built like a bear. In any conversation he is looking for an excuse to exert his physical dominance over whoever is talking at him. He is local-famous for his aggression and his wrestling skills. He runs a branch of whatever might be the D\u0026D equivalent of the Hell\u0027s Angels."},{"name":"Vin Vaced","genderRaceOccupation":"Female Human Beggar","description":" 5\u0027 4\", Brown Eyes(Blind), Brown Hair, Dirty but not unpleasant smelling. Vin tends to hang out around the local inn, shining shoes and collecting tossed coins. Vin was blinded as a child after being hit in the head with a horse\u0027s hoof. She is actually the offspring of a local lord, but won\u0027t reveal this fact unless pressed."},{"name":"Sharpey","genderRaceOccupation":"Male Dwarf Smith Apprentice","description":" Sharpey is a 5ft tall, 50 year old dwarf with brown hair and blue eyes who has no clue about anything that isn\u0027t metal or fire. Sharpey is madly in love with the local bartender but has never approached them. He would be very inclined to do a favor for anyone who could point his crush in his direction. The Smith he is learning from is hiding a mimic in his home."},{"name":"Orel Kao","genderRaceOccupation":"Male Half-Elf Bartender","description":" Orel Kao is recognizable for his piercings. He draws beautifully and has painted all of the walls in the tavern with murals. He tends to pace and is hot tempered in his dealings with others. If he has a flaw, it is that he has a phobia over being touched."},{"name":"Veylin Brightwind","genderRaceOccupation":"Male Human Duelist","description":" A famed duelist from a small island nation, Veylin has taken to traveling the world. With a faint accent, one of his family\u0027s twin ancestral swords, and a spring in his step, he jaunts from city to city. Many fans of his are eager to throw parties in his name, an honor he doesn\u0027t seem to mind. However, his family back home, specifically his brother, the lord of the island, are none too happy that Veylin took one of the ancestral swords that are rightfully his, and left the line of succession to go off on what is (in their eyes) quite a silly occupation."},{"name":"Pallen \"Silvertongue\"","genderRaceOccupation":"Male Halfling Gang Leader","description":" Those who see Pallen for the first time assume him to be a perfectly nice man. Why, he would never hurt a fly. However, those unlucky tavern owners and innkeepers who live in the same neighborhood as him know him as a ruthless man who will do anything for money and power, and half the inns and taverns owe him protection money. But most just see his friendly exterior, a happy face, an easy smile and the famous sharp tongue that gives him his nickname and pass him on by."},{"name":"Stalwart","genderRaceOccupation":"??? Warforged Butler","description":" Stalwart is the longtime manservant and butler of a high-ranking lord of a noble family. The one thing that separates him from most of his brethren is his remarkably sharp tongue and cynical and sarcastic sense of humor. No one knows quite how a member of this normally humorless race developed such a wit, but it is clear that his sense of humor is quite developed, often surpassing the wit of his employer. Many fellow nobles call on the employer just to hear what Stalwart mutters under his breath, and several family friends think of Stalwart in as high if not higher regards as they do the actual family."},{"name":"Adaliah","genderRaceOccupation":"Female Spirit Caretaker","description":" She is an emissary of the deities, most often associated with those of the realms of life and death as she assists the souls of those traveling from the material world. She may often be seen by the bedside of those who die alone. Her other favorite spots are park benches watching children play or chatting with strangers. Her appearance and mannerisms vary with each account, but all agree on her grandmotherly qualities, doting or disapproving depending on alignment."},{"name":"George, the Gregarious","genderRaceOccupation":"Male Human Cleric","description":" A towering, portly, middle-aged man with a red face, a beard to rival most dwarves, and sausage fingers. George prefers simple robes to armor as he is often seen with a barrel of ale on his back, a stein in his hand (that mysteriously never empties), and his two handed mace that functions more as a glorified walking stick. If the rumors are to be believed, several orc tribes, an arch-demon, a lich, 2 chromatic dragons, and a vampire coven all have on separate occasions halted their plans and entertained guests simply because George\u0027s name was mentioned."},{"name":"Peabody the Strongman","genderRaceOccupation":"Male Half-Orc Personal Trainer","description":" \"Even for adventurer like you staying in shape hard work. When you make up mind to get strong, Peabody will be there. Like ravenous displacer beast, Peabody will pounce to make you run faster. Peabody will surprise you in sleep for 50 night-pushups. Me work hard so you work hard!\""},{"name":"Krillee","genderRaceOccupation":"Male Kenku Orphan","description":" Krillee loves tarts and is known by all the village bakers to be a thief. His all black coloring made hiding in dark corners and alleys easy. Twice already he has tried to join up with a gang of thieves, but both times he failed to pass their test."},{"name":"Helmaer","genderRaceOccupation":"Human. Male. Drunken asshole Racist Mercenary.","description":" A massive human, who finds his problems at the bottom of a glass, and solves them either with his fists or his warhammer. Hates elves, orcs, gnomes, and other \"sub-humans\" with a burning passion. A decent, unscrupulous underling-for-hire, but too ambitious to stay that way. He dreams of leading an army back to his fractured, human-run homeland from where he was exiled."},{"name":"Fetch","genderRaceOccupation":"Goblin. Male. Abomination.","description":" Once a proud tribe leader, he has had his strength, his memories, and even his name stripped from him. A wizard wiped out his tribe, but needed a servant - he took the broken body of Fetch, and made him into a half-magic, half-goblin abomination. Is replenished and strengthened by being hit with any type of spell - that doesn\u0027t make it hurt any less, however. Has escaped his former master, and now lurks in dark forests, preying upon hapless travelers - in a very literal way."},{"name":"Harold Von Talsken","genderRaceOccupation":"Male Wizard (High Level) Dwarf","description":" This wizard speaks with a very thick german accent to differentiate himself from his more scottish speaking poor people. He constantly complains about his greatest invention, made to sound as an actual physical magical artifact, being stolen by Llib Setag a human wizard, when pressed on this his invention it turns it out it was nothing but an idea, but it was stolen nonetheless because he can no longer remember what it was. Llib Setag had broken into his mind mansion and stole the idea before Talsken could construct the device. He wants it back."},{"name":"Llib Setag","genderRaceOccupation":"Male Human Wizard","description":" A Wizard of fame throughout the land for is useful inventions bringing magic goods to many more people, currently just aristocracy he has plans of using the Von Talsken Device to allow common people the ability to use magic, he just needs to construct it, unfortunately due to stealing the wizard\u0027s idea, he has no idea how to go about it. It turns out that most of his inventions and discoveries are stolen and repackaged from others."},{"name":"Macduff O\u0027Grady","genderRaceOccupation":"Male Dwarf Fighter","description":" This rowdy mercenary is known for his band of troops known only as Strongmen Incorporated. A collection of the toughest meanest sons o\u0027 bitches west of the Greyscale Mountains. Macduff speaks in general strong guy talk, with Ho Ho\u0027s! Hyup Hyup! Growls and Grunts. While he doesn\u0027t seem all that intelligent his battlefield tactics and his companies drilling techniques make them a terror on the battlefield."},{"name":"Ishmere Elehan","genderRaceOccupation":"Elf Female Bard","description":" A bard by trade, a pickpocket by night, an occasional turtledove. She can be found in the wealthier parts of town, usually sweet talking the guards to be allowed to \"busk\" in those districts. She has the dirt on all the noble houses, knows all the affairs (a party in many of them) and has a sizable tithe to the Thieves Guild."},{"name":"Xume Dalagom","genderRaceOccupation":"Female Drow Cleric","description":" At a glance, you can tell she\u0027s grown up in spiritual community, by her short white mohawk haircut and modest-looking black robe. At young age, she was chosen by Milil, and exiled from Drow society because of that. She prefers physical solution to her problems over magical ones, since she\u0027s a drow. She usually hangs out with bards, minstrels and artists, at local theaters and libraries."},{"name":"Grimey Folkhard","genderRaceOccupation":"Male Ghostwise Halfling Monk","description":" Back when Grimey was young, his father went travelling into world, telling him stories about a huge treasure he was going to find to make his family back in Shoun live a happy life. Now, with his trusty staff and cousin Jens by his side, he started to travel to the great city of Baldur\u0027s Gate, where the destiny awaits him. Along the way he met Aiwin, who became his mentor on the way to becoming a true monk."},{"name":"Jens Folkhard","genderRaceOccupation":"Male Lightfoot Halfling Warlock","description":" Ashamed of not being able to keep up with traditions in their community of Ghostwise halflings, he contacted the Great Cthulhu and begged him for his powers. The Great Cthulhu gave him powers, in return for the rest of his life being his pawn in his great return. From time to time, he is asked to do seemingly ridiculous things that supposedly help in the summoning. Little does he know, the things he does today will have effects in the future - some in the closer future, some in further one."},{"name":"Aiwin Galanodel","genderRaceOccupation":"Male Wood Elf Mentor","description":" Four dots in shape of a letter Y on his forehead, the short black hair and the charismatic voice. Many people recognize him as the mentor of monks, who left monastery long time ago to spread his word through the world. He cares about his students, and always seeks for more. His secret hope is that one day, he will start his own monastery with his new philosophic views of the world."},{"name":"Mansel North","genderRaceOccupation":"Male Human Sailor","description":" When boarding the Red Sunset ship, you couldn\u0027t miss this tall pale human with athletic build and no hair on his head. He\u0027s got a tattoo of an anchor breaking through heart on his left arm just below the sleeve ever since his wife left him. Secretly, he believes that North Star is alive and that it\u0027s calling him. He is too quiet - he doesn\u0027t say anything unless asked to."},{"name":"Arno Bearkiller Kalukolake","genderRaceOccupation":"Male Goliath Adventurer","description":" Muscular goliath that stomps with each step, yet can move swiftly. He proved his adulthood by slaying Skrämbeorn, the great bear that terrorized villagers. Ever since then he was mistakingly recognized by the nearby villagers of Oxeye as a hero. He once got seduced by a dryad and how has half-dryad half-goliath son G\u0027rowt."},{"name":"Riva","genderRaceOccupation":"Female Drow Paladin","description":" She grew up to become a paladin loyal to her kind. Long white hair and dark skin may be classic features of a drow, but what could throw you off is lack of fascination for spiders. She\u0027s cold, shy and catious, but also inquisitive about the faith of others, but can tolerate paladins and clerics of other faiths. She talks in sleep about her drow friends she hasn\u0027t seen in years and is fascinated by birds."},{"name":"Who are these demonologists, shadowhunters, crusaders, and exorcists?","genderRaceOccupation":"The old priest winks, drains his cup of wine, and spryly hops off his bar stool. \"Come on,\" he smiles, \"if we go now, I can get you in and out of the temple\u0027s crypt before the midnight devotions begin.\"","description":" Last week, we made some fiendish villains, so it seems fitting that we collect some NPCs who oppose such beings. These NPCs could run the gamut from eager allies to dangerous foils, but they should not be sinister on all accounts (to distinguish them from villains). The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples."},{"name":"Brother Calymus","genderRaceOccupation":"Male Human Scholar","description":" A priest of the First Order of the Light, Brother Calymus is a spry, balding old man who\u0027s been wandering the world for half a century, seeking out ghosts, survivor\u0027s of near-death experiences, and other strange phenomenon attributed to the Spirit Realm. He\u0027s written two popular books on the topic and is happy to talk at length about the mysteries of death, especially over a cup of strong red wine. Whenever you run into Brother Calymus in a tavern or brothel, he\u0027s bound to know where some dark presence is lurking nearby in the world (and likely, he\u0027s eager to investigate once he finds the right help)."},{"name":"Sir Harrisen Figg","genderRaceOccupation":"Male Human Knight","description":" Tall and handsome with long dark hair and neatly-trimmed mustaches, Sir Harrisen was the heir of House Figg, but after the strange circumstances of the death of his sister, he renounced his inheritance and left his family to join the Watcher\u0027s Swords, pledging his life to hunting down enemies of the Moon Maiden\u0027s church. Figg has been particularly prolific in seeking out and destroying demons who reveal themselves in the world. He carries an ancestral sword that had been called Greatknife which he has renamed Fiendbane. When you meet him, you\u0027ll find he\u0027s a bit stiff, but he means well."},{"name":"Sister Dierdre","genderRaceOccupation":"Female Human Priestess","description":" Sister Dierdre\u0027s wide green eyes smile, despite a sadness lingering about her young face. She often fiddles with her long blonde braid when she speaks, especially if asked about her past. Dierdre was the promiscuous daughter of a high-ranking soldier, who couldn\u0027t seem to keep herself out of trouble, so her father sent her away to join the Second Order of the Light. She always approached ghosts and demons with fascination and, of late, has discovered her own talent as a medium between the world and the Spirit Realm."},{"name":"Lady Joenna Longfisk","genderRaceOccupation":"Female Human Knight","description":" Clad in mail and leather, Lady Joenna Longfisk is a tall maid with short-cropped auburn hair. She took up the sword against her father\u0027s wishes, following her young liege lord to battle in his fateful campaign against the Ice Clans. The campaign was largely successful, save the death of her liege lord. Too proud to return home, Lady Joenna pledged her sword in the service of the Storm King\u0027s Temple of Winter. Never at home among the men of the temple guard, a powerful priestess who had befriended her sent Lady Joenna back among the lands of the Ice Clans to search for an ancient shrine to the Storm King that\u0027s been lost for centuries."},{"name":"Goodson Harbert","genderRaceOccupation":"Male Human Exorcist","description":" With a missing eye and a wooden leg, Goodson Harbert cuts an intimidating figure, especially for a priest. He reeks of booze and speaks in a growl, but he\u0027s a warm soul beneath the gruff exterior. People say Harbert has been to the Hells and back, and no one who sees him would dare question that rumor. He\u0027s never risen high among the Goodsons of the Traveler, but he is respected by all within the church\u0027s hierarchy. If you have to face a demon, a ghost, or a questionably-sourced cask of ale, you\u0027ll want Harbert\u0027s hatchet and his box of potions and powders at your side."},{"name":"Bifgard Stonehouse","genderRaceOccupation":"Male Dwarf Crusader","description":" His flame-orange beard a shaggy tangle, Bifgard Stonehouse is quick to draw his axe at the first whiff of goblins, ghosts, and wights. For years, he has been working in stages to clear the ancient dwarf-hold of Silverden of goblins and undead almost single-handedly. He comes down from the mountains twice a year to re-supply his camp and make half-hearted attempts at recruiting some help in his task. Bifgard speaks very little until he\u0027s had a few ales, and then he speaks too much–becoming angry with himself (and anyone around him) whenever he lets slip one of Silverden\u0027s secrets, setting himself to perform an awful penance to atone to the Great Smith."},{"name":"Quelma Starcircle","genderRaceOccupation":"Female High Elf Shadowhunter","description":" Quelma Starcircle remained in the World when the last of her people left centuries past, her task still unfinished. Her brilliant blue eyes are patient and her manner is as soft and straight as her flowing silver-blonde hair. With her sword and her bow, Quelma has dogged the arch-lich Arameedi from one end of the World to the other. She has slain it six times, and six times the lich has risen. Quelma will continue her dangerous game of cat-and-mouse with Arameedi until she finds the hiding place of its phylactery or until it destroys her."},{"name":"Goran the Grim","genderRaceOccupation":"Male Human Preacher","description":" A devotee of the Southron pantheon, Goran spends his days preaching the word of the God of Death in the market square (\"Prepare! Seek Death on your own terms, lest Trickery guide your path or Ruin take your strength!\"). Black-robed, gaunt, and pale with dark circles around his dark eyes, Goran\u0027s deep voice booms across the square beseeching all who will listen to make time for meditation on Death every day. Goran also sells a variety of amulets and potions that will ward off the curse of undeath, so that Death may be met peacefully and honorably."},{"name":"Al-bah Zorimun","genderRaceOccupation":"Male Human Paladin","description":" Al-bah Zorimun is a broad-shouldered knight who wears light copper scale armor and always carries a wicked scimitar on his left hip and several short spears slung across his back. Zorimun\u0027s head is shaved and his mustache is long and waxed, though he often keeps both hidden from the sun with a white cotton cowl has he wanders the desert on his trusted mare. Every sun up and sun down, Zorimun prays to the Sun God asking the First Light and the Last Light to touch his flashing blade that he might strike down the dark followers of the Dead God. Zorimun is quietly going about his bloody work, seeking out the tent-camps and caves where the followers of the Dead God hide."},{"name":"Inquisitor Marsolis","genderRaceOccupation":"Female Tiefling Priestess","description":" She tells her guests her name before they see her - Francesca. She lures them into confidence with a voice full of contrite abasement, sexual undertones, knowing humor. She laughs, she cries, she tells them she\u0027ll be flogged if she doesn\u0027t get the answers she needs. Whatever works. When she can, she walks behind them unseen, the soles of her boots whispering on the flagstones of her clean, spare chambers. Just as with any other tool, she uses violence sparingly and judicially... but first, if nothing else works, she steps from the shadows and pulls the hood from her head. When they see her crimson skin, they begin to scream; when they see the jet black ram\u0027s horns that curl from the back of her head and over her shoulders, they begin to confess."},{"name":"Sir Nicolas of Eastmark","genderRaceOccupation":"Male Human Sorcerer","description":" Sir Nicolas is a peculiar sort of knight; he doesn\u0027t joust, or compete at the sword, or do any number of things that your average everyday knight would do. Instead, he wears finely tailored clothes, tasteful yet expensive jewelry, and personally oversees all of the kingdom\u0027s dealings with adventurers and would-be heroes. Having retired from adventuring himself at the ripe old age of 45, his dark hair (with gray wingtips, lovingly maintained) and trained grey eyes are a fixture around the palace. He prefers to do things the easy way, rather than the way that involves copious amounts of explosions, but make no mistake: he isn\u0027t called the Mage Knight of Eastmark for no reason."},{"name":"Dame Elmeara Dragonback","genderRaceOccupation":"Female Dwarf Paladin","description":" The first impression most people get of Elmeara is her armor: a set of brilliant white enameled plate, which under sunlight shimmers with a faint opalescence. Most trained warriors, sellswords, and hungry bandits scoff at such extravagance; after all, how experienced can one be without any battle damage on one\u0027s armor? Unfortunately for them, they are asking the wrong question. The right question: How good does Dame Elmeara have to be to come out of every fight with immaculate armor? The right answer: Very, very good."},{"name":"Alexei van Valerya, the White Hat","genderRaceOccupation":"Male Tiefling Assassin/Guard Captain","description":" Assassination is an art, and a difficult one at that. For every noble who travels in an open carriage through a city filled with tall buildings, there are five more who don\u0027t eat their breakfast until their entire court has a bite first. And yet, a select few kingslayers still manage to turn a profit. Alexei van Valerya knows the art of killing important people better than any other bodyguard, mostly because up until a few years ago, he was on the side of the artists. The ex-assassin-turned-security-chief cuts an unassuming figure; at 5\u002710 he\u0027s not the tallest, and at 160 pounds he\u0027s not the bulkiest. What he is, is effective. From his swept-back black horns to his toes, Alexei is all business. Tales around the palace say that he personally kills at least one foreign spy before breakfast, and two before lunch. He fights with his bare hands, or with garrote wire, or with long, ten-inch dirks that he wears on his back, and when he does, he is completely silent."},{"name":"Sygfellow Ottman","genderRaceOccupation":"Male Dwarf Stonewarden","description":" Sygfellow comes from a long line of stonewardens whose job it is to walk the long paths between the eastern brunmallow and northern grasslands where brigands often lurk seeking easy prey, or roaming barbarians encroach. Because of the fact that he\u0027s constantly on the move going to town to hamlet, he has an intimate knowledge of the inhabitants of each and is often sought out for news and tales and, when the wine is particularly fine, a song. Syg is the fifth generation of his family yo take on the stonewarden mantle. Syg stands four feet, nine inches tall and has long brown hair and amber eyes. Syg is so used to traveling the long trade roads that he travels quite light and can live fairly easily off of what the land provides. He knows every nook on the forest\u0027s edge where he can find safe respite and where to find the best fish and game. He\u0027s seen these roads to often and knows the paths so well, that he can smell when something is amiss. You\u0027ll know him by his rough green cloak and his compact yew bow that carries with him, and if he asks you your business, you\u0027d do well to answer wisely. Sygfellow does not suffer fools kindly."},{"name":"Sir Aaron Irkell, the Beacon\u0027s Light","genderRaceOccupation":"Male Human Paladin/Cleric of Torm","description":" Sir Aaron stands at an average height of just 5\u00279\". His blonde hair is incredibly short, and he wears long purple robes under a breastplate emblazoned with the seal of Torm. You can find him, more often than not, tending to the wounded Lord\u0027s Alliance soldiers in the med tents of Qui. His words are brief and to the point, but he is kind and well-mannered. He heads a church of Torm in the city of Qui called \"The Beacon\" where he teaches mercy, healing and kindness. Those who meet Sir Aaron on the street or in his church will often find him lost in thought, dwelling on those he could not save and praying for those he is still trying to save."},{"name":"Brother Kiniffer","genderRaceOccupation":"Male Human Crusader","description":" A paladin of torm and war veteran, he wears a leather armored kilt and a light leather tunic at all times. He has seen more wars and single combat encounters in his life than most can honestly speak of, and its left him a bit crazed or blood lusted, its hard to tell. His eyes are wide, and his head\u0027s got patches of hair all about it in between the patches that have either fallen out or been ripped out. He is nearly maniacal in his desire to drive evil from the land and he\u0027s happy to engage in long conversations with those who would help him do it. You can find him training with the other brothers of the First Light Monastery, east of the High Forest."},{"name":"Talal","genderRaceOccupation":"Male Half-Elf Mystic / con-artist (neutral selfish)","description":" Moral ambiguity personified with sandy blonde hair and a charming smile; a wink of his green eyes invites you into his secret. Most faiths have a secret cabal wherein special rites, prayers, and practices are rarely disclosed to the layman. However as a man of half truths and half lies, Talal can fit in to any one of these. Talal\u0027s specialty is knowing where these rituals take place and either owns or at least knows the location of cabalistic items of power.  "},{"name":"Keandra","genderRaceOccupation":"Female Tiefling Warlock / demon hunter","description":" Not everyone believes that hunting demons is a fulfilling career path. Thus was the belief of the arch devil Ezatan, who therefore sub-contracted his end of a deal to a young and desperate tiefling girl. Now that she is older, Keandra hunts demons with efficiency and indifference. Having no personal vendetta against the abyssal spawns, she finds no joy ridding the world of their evil. To her, it\u0027s just a job."},{"name":"Balchenod the White","genderRaceOccupation":"Male Tiefling Investigator","description":" The body was finally still beneath him, but he could feel the blood soaking into his pants. Still, he held the knife, hilt against the body\u0027s back, a few more seconds until he was sure it was only his own breath rasping in the dark cellar. \"Balch, you\u0027re getting sloppy,\" he muttered to himself as he willed his left hand to release the quarry\u0027s horn and slowly withdraw the ten inch dirk. The darkened skin of the tiefling on the floor seemed to go ashy in the inky black pool of its own blood. He\u0027d earned this bounty, but at what cost? Licking his lips unconsciously, he knew the self-flagellation tonight would be particularly intense."},{"name":"Krind Steeltoe","genderRaceOccupation":"Male Dwarf Ranger","description":" A long braided brown beard and piercing blue eyes are the first thing you\u0027ll notice when see this dwarven ranger. He initially has a gruff demeanor, but becomes friendly enough once you known him for a while. A follower of Marthammor Duin, he aims to explore new lands and protect his fellow travelers and any people who he might meet on the road. Accustomed to hilly terrain and mountains, his recent travels though an unholy mountain pass have led him into combat with wicked undead far too often for his tastes, and he would welcome any help in exterminating this threat to the locals and travellers."},{"name":"Skrazano","genderRaceOccupation":"Male Kobold Soldier","description":" This loyal soldier is no ordinary kobold. Although he is at present nothing more than a soldier, he has been handpicked for the elite guard due to his skill and bravery in combat. Through his veins runs a sliver of metallic dragon blood, granting him power beyond that of an ordinary kobold. He is dedicated to his duty and speaks very little. And when he does speak, he speaks softly, barely more than a whisper."},{"name":"Aurak Gnar","genderRaceOccupation":"Male Dragonborn Paladin","description":" Aurak Gnar is a 6\u00278\" golden metallic dragonborn. Wearing shining plate armor, wielding his silver sword and garrisoning his shield. Aurak is stern and outgoing, taking command where possible. He prefers to lead from the front and take a cautious approach to most things. Having survived numerous battles where patience, not the might of a sword arm, was the deciding factor. He is merciful to most beings, believing that everybody has the chance to turn to the light. However he acts without mercy or quarter to beings of evil and those who help them."},{"name":"Sivak Nala","genderRaceOccupation":"Female Dragonborn Priestess of Bahamut","description":" Sivak Nala is a fierce silver dragonborn with a height around 6\u00273\". She wears simple armored robes and wields two short swords. Despite her cold outwards appearance, she is deeply caring for those in need and those who cannot defend themselves from the horrors of the dark. Her shy calm and graceful demeanor do not carry over to those of foul natures, even if they aren\u0027t innately evil beings. Driven and focused to the task at hand, Sivak Nala hunts down the dark forces of the world with equal measures of grace and cold malice."},{"name":"Bozak Rhogar","genderRaceOccupation":"Male Dragonborn Knight","description":" Bozak Rhogar is large, even for a dragonborn. Standing at a towering 6\u002711\", and seemingly built out of a bronze wall, Bozak Rhogar is a force to be reckoned with. Known as a dispassionate fellow, Bozak holds no quarter to any who hold themselves outside of the law, or worse, the paths of darkness. Beneath his bronzed exterior lays a heart of, more bronze. Bozak is quiet and pensive, often going hours or even days without speaking. Preferring to instead answer with a nod, grunt, or silver maul."},{"name":"FlyHandle","genderRaceOccupation":"Male Aarakocra Mercenary","description":" A member of a radical mercenary guild, FlyHandle speaks very little, takes orders, and has little qualms as long as there is pay. He builds trust with long term contractors, and will slowly open up about his opinions and knowledge. He wears light armor, can class as a barbarian, and prefers spear-like weapons."},{"name":"Cadrielda Sabreen","genderRaceOccupation":"Female Human Shopkeeper","description":" The owner of Cadey\u0027s Trinkets, an arcane pawn shop carrying a variety of handy gadgets and minor magical items. Her long black curls come nearly to her waist. She wears large round spectacles and walks with a slight slouch, but she is otherwise modestly attractive. Cadrielda is shy and fidgety, and seems to consider interacting with customers to be a necessary evil. She can barely stay afloat because she is always tanking in stray animals. Unknown to most, she was once a druid, but was banished from her circle for dabbling in science, and many of the goods she sells are actually of her own invention."},{"name":"Kaivoth the Tall","genderRaceOccupation":"Male Half-orc Hunter","description":" A massive, late middle-aged half-orc with scarred gray skin. He lives as a hunter and adventurer, and is known to be a man of very few words. He carries a locket with a tiny portrait in it, but refuses to say who is pictured there, and worships an obscure dwarvish deity but refuses to say why. Though he normally works solo, a couple rounds of ale might convince him to work alongside the party."},{"name":"Lazloch Sylveron","genderRaceOccupation":"Female Half-elf \"Bounty Hunter\"","description":" An orphaned teenage tomboy living in the slums of a large city. She was once a skilled pick-pocket, but after reading a book by the philosopher Picurales, she underwent a kind of conversion and decided to use her talents for good. Now she is determined to become the world\u0027s most famous bounty hunter. She cuts her blonde hair boyishly short and dresses entirely in black leather, as this is what she imagines a bounty hunter is supposed to look like. If pressed, she will insist that she is a full-blooded elf, though she obviously has some human ancestry."},{"name":"Name Unknown","genderRaceOccupation":"Male Human Monk","description":" A monk of St Cuthbert, he took a vow of silence at the age of 10. He has yet to speak and is reaching into his 70\u0027s. With his ageless body achieved at 10 he has not aged a bit. He spends his life guiding those who are lost in the woods near his Monastery to safety."},{"name":"Stakta \u0027Whistletongue\u0027","genderRaceOccupation":"Female Dragonborn(Brass) Captain of the Guard","description":" Stakta spent many a year as a thief, working in the underbelly of the city. One day she was given a job to assassinate a cleric of Bahamut. Not knowing this clerics strength, and falsely assuming in his age he was feeble and unable to defend himself she took a direct approach. She was swiftly beaten, and while lieing near death on the street the cleric began to heal her. Even though not a minute earlier she had tried to take his life, he was ensuring her survival. Thus began her repentance, and her worship of Bahamut."},{"name":"Vendrick \u0027Wildheart\u0027","genderRaceOccupation":"Female Gnome Bloodhunter","description":" A powerful bloodhunter, her first kill at the age of 12 she specializes in wielding weapons of uncommonly large size for her race. Constantly under the effects of an illusion she appears before her prey as an innocent human child. She preys specifically on demons, or cursed that hold weapons or items of sentience, even if they\u0027ve no other power to speak of. She\u0027s slowly expanding her circle of \u0027friends\u0027."},{"name":"Torbarth \"the Heavy Handed\"","genderRaceOccupation":"Male Half-Orc Paladin","description":" Among paladins, Torbarth has become a bit of a laughing stock. His approach to rooting out evil and corruption is ask those under scrutiny bluntly: \"do you serve the forces of order and goodness?\" In the case of a no, or an unconvincing response, Torbarth has been known to lurk just over the shoulder of the person in question, making note of their every decision. He has been known to keep this up for upwards of a fortnight before making his final judgement and moving on."},{"name":"Mill Burray","genderRaceOccupation":"Male Human Exorcist","description":" Genial and entirely average looking, Mill Burray makes a career of exorcising ghosts. His \"work\" uniform consists of an off-white jumpsuit, a backpack overflowing with dubious looking equipment, and his trusty ghost-dowsing rod. With proper payment delivered half on commission and half on completion, Mill will dowse any haunted site for supernatural entities, and capture them in spirit proof vessels using any number of appropriate rituals or techniques."},{"name":"Mekaela \"the Unremarkable\"","genderRaceOccupation":"Female Elf Demonologist","description":" Although nobody could tell you precisely what she looks like, Mekaela has built quite the reputation as a bottomless font of knowledge on demons and the abyss. If asked, she politely diverts any questions about her uncannily unremarkable appearance by saying \"it\u0027s just a precaution, strictly necessary in this line of work.\" Often the only thing that Mekaela will ask in exchange for a bit of information on demons - or any demon in particular - is that her client keep her informed of any new relevant knowledge they gain. That, and that they spread word of her services, as she is so unremarkable it is understandably hard to do much networking in person."},{"name":"Who are these crones, enchantresses, and fortune tellers?","genderRaceOccupation":"The witch smiles gleefully as she squishes the caterpillar between her fingers. \"Into the pot!\" she smiles as she tosses it into the bubbling, hissing liquid.\"","description":" Witches, seers, fortune tellers, and diviners are staples of fantasy worlds. Individuals who have glimpsed dark secrets or who can peer into the future. Sometimes these are villains, but most often they are following some agenda of their own that is unwholesome if not wholly evil. The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples. (These may or may not have drawn some inspiration from these tables and these tables.)"},{"name":"Myrta","genderRaceOccupation":"Female Human Crone","description":" Myrta learned her craft from a half-elf witch who came to her aid after she was evicted following the death of her fourth husband. This cackling old crone saved Myrta and her young daughter from a beggarly life, teaching them spells that gave them the power to manipulate men\u0027s minds and the forces of nature. Since being chased from town after a few short years of scrounging in the allies, Myrta\u0027s made a cozy little lair for herself and her grumpy familiar Ormund the Owl in a cave in the swamp. She\u0027s a tough old bird, and she\u0027ll happily mix up a poison or curse an item for you in exchange for a few silvers. Her mistress told her about the staff of Hecate, the first witch, and Myrta\u0027s been gingerly probing for lore relating to the staff ever since. She\u0027s currently mixing up a terrible poison made from blindworm\u0027s sting, dryad\u0027s thorn, and stirge\u0027s foot. Who the poison is intended for is anyone\u0027s guess..."},{"name":"Marta","genderRaceOccupation":"Female Human Enchantress","description":" Marta is the witch Myrta\u0027s beautiful daughter by her second husband, and she learned the craft as a teenager on the streets from her mother. Marta left her mother\u0027s tutelage to marry some handsome lord, but he died under mysterious circumstances. When suspicion turned on Marta she fled to the mountains where she lives, conducting seances, reading the palms of travelers, and seeking the soul of her dead husband. Her familiar is a talkative snake named Hiss-Fiss, and her other companion in the mountains is a giant bat named Hipp-Fipp, whom she rides to and from the valley to her hidden lair. Marta has a nervous twittering laughter that shakes her pleasant features in an unpleasant way. She also has a real talent for love potions. Most men who drink these potions fall in love with Marta herself, but that works for her. She enjoys taking new lovers. She also enjoys casting old lovers from her mountaintop home when she\u0027s done with them."},{"name":"Morta","genderRaceOccupation":"Female Half-Elf Bogwitch","description":" Morta is the most mysterious member of the coven. She\u0027s half-elven with a very unfortunate wart on her nose. She\u0027s quite good at preparing alchemical concoctions, from magical cure-alls to pyrophoric substances. She lives on an island in the swamp and transforms into an owl to get from place-to-place. If you let on that you know magic, she\u0027ll pick your brain for ritual lore before letting you go. Once she let\u0027s you go, there\u0027s a good chance she\u0027s going to hunt you down with her bow and her spear. If you get far enough away, she\u0027ll transform into a horned owl and track you down. She consorts with a gleeful fire elemental familiar who delights in burning things and whom Morta is constantly trying to restrain as she prefers to kill things herself. Morta delights in the thrill of the chase and the adrenaline rush of making the kill to end a successful hunt."},{"name":"Laki","genderRaceOccupation":"Female Human Shadowseer","description":" Old Laki is a bent-backed creature of routine who knows the most unexpected things. Every morning, she rises to a cup of tea and dried fish before her morning walk amongst the beaches and meadows of the rugged coastland. Hobbling along with her crooked cane, she collects bits of driftwood, grasses, herbs, and shells for her fires. She sleeps the afternoon away under the watchful gaze of her raven, and receives guests in evening. All through the night, she prays to her dragon gods and works her spells, divining answers to her guests\u0027 questions by interpreting the shadows the flames cast on her tent walls."},{"name":"Margy the White","genderRaceOccupation":"Female Human Fortune Teller","description":" Robed in black with dark brown hair and tan skin, one may ask why is she called Margy the White? This sturdy middle-aged woman offers readings in her kitchen, during which her voice deepens and her face takes on a ghostly pallor. The local priest has been ranting about Margy being a fraud for decades, but that never seemed to bother Margy. She keeps offering to do a reading for a silver to any who ask and who have good manners."},{"name":"Glyddon Silverstrings","genderRaceOccupation":"Male Half-Elf Singer","description":" Glyddon Silverstrings has a handsome face and a golden voice and a pitch-perfect harp. He has recently been wandering the villages of the Borderlands singing for his supper and offering simple healing as his meager skills allow. Once in a while, he has had dreams that offer him glimpses of the future, including foreseeing his own mother\u0027s death while a youth in Brightharbor. After she died, he has been an unsettled rascal, never staying in one town for long. Some say he is wanted for the murder of a Southron merchant prince whom he tried to warn about his enemies\u0027 plans."},{"name":"Deepbrother Harridan","genderRaceOccupation":"Male Human Prophet","description":" A gaunt priest of the Sea Queen, Deepbrother Harridan preaches her dire message of darkness and suffocation for those who do not submit to her will. Harridan himself was the sole survivor of a terrible shipwreck as a young lad. So moved by his luck, he pledged himself as a deepbrother of the Sea Queen, claiming to have received visions of her plans when his lungs were filled with seawater. He has \"drowned\" himself dozens of times since, taking on seawater and asking that his assistants revive him. Recently, he has predicted a black vengeance will rise from the sea to consume those in the city who refuse to renounce their devotion to the Light."},{"name":"Borovurnum Jurtha","genderRaceOccupation":"Female Human Sailor","description":" On the languorous and rain-soaked coastlines there is a rowboat tied to a rotting pier somewhere. On this rowboat is Borovurnum, never tired, never hungry, with fire behind her huge pupils and teeth and deep blue tattoos of wide-eyed snakes up and down her muscled arms. She will row you to the nearest fishing hamlet, clam shack, or charcoal-burner\u0027s hut for only some conversation in exchange; and during the journey she will offer you to smoke from her pipe. If you interest her sufficiently with information—and, more importantly, manage to draw a mouthful of smoke from the pipe—then she will regard you highly and pleasantly, offering to row you anywhere you wish or could possibly imagine. However you will smell of, and constantly spit up, liquid smoke and heatless fire for a few days afterwards. Further, you will always hear the slight splashing of oars on water from inside your head, your appetite will be subdued and then all at once entirely gone, your eyes will feel hot and swollen."},{"name":"Malfra","genderRaceOccupation":"Female Human Enchantress","description":" Ever since Malfra was born, she felt different from the others living in the small hamlet. Her natural magical talents made her feel like an outcast. As a young woman she met her one true love. He was a soulmate: finally someone with whom she could share her gift of magic. One day, he gave her the most beautiful flower she had ever seen as a token of their love. When their relationship ended on his behalf, Malfra turned bitter. She grew envious of other young maidens who were happy with their lovers. Fleeing from her home and retreating into the neighboring woods, she set out to destroy their happiness. When young couples wander too close to her confines, she enchants the young maiden in love and turns her into a bird, to be locked into a cage at her hovel. Only the flower that reminds her of her long lost love will break the spell."},{"name":"Norgith the phasing","genderRaceOccupation":"Male githzerai wanderer","description":" Norgith is a tall, gaunt, hooded figure, always wandering through dark woods or climbing distant mountains, though sometimes he is seen passing through alleyways in bustling cities. Little is known about him, but whenever he is encountered, he is amicable, though impatient. He seems to know everything, and has an answer to every question, but he always speaks enigmatically, and also always claims only to have a few moments to talk. When people try to find him again, even moments later he is gone. No one ever sees him coming, and no one sees him leave. It is said that he phases across time and space, observing the world, but not staying in any one place for long, which is how he gained his knowledge."},{"name":"Giddy Cremm","genderRaceOccupation":"Female Half-Orc Suntouched Cragwitch","description":" She clings to the boulders and cliffs of her mountain home with hooks made from steel, woven through her fingers and along her arms with lengths of braided leather, hemp and hair. She wears the sun as a cloak, the wind as a bonnett, the sky as a dress. Her laughs (and her deep, unsettling coughs) echo for improbable distances, and it\u0027s always wise to make camp when you hear them, and soon; should there be a pot of something tasty awaiting her when she comes calling, she might be willing to overlook a trespasser on her land."},{"name":"Marin of the Lupines","genderRaceOccupation":"Female Human Oracle","description":" She lives in a sturdy cabin, tucked between two boulders on the edge of the wood, where the tall trees give way to to undergrowth and wildflowers. During the long springs and summers and autumns, she can be found wandering the the threshold - the divide, she calls it - harvesting the few Lupines that stray under the shade of the foliage. These, she says, grow with the shadow in them. She boils them in springwater and honeycomb, and as she whispers her hidden words, the bees from the meadow crawl through her knotted hair and across the glassy mirrors of her sightless eyes. Those who watch find it unnerving, but the wise know that the bees keep secrets."},{"name":"Twisted Tether","genderRaceOccupation":"Awakened","description":" She loves questions. Her only request for repayment is \u0027to discover something that she has not before\u0027. This can be a song, a riddle or simply showing her things she has not seen - be that with books, paintings, casting illusions or virtually anything else. The more impressed she is with this information or story the more forthcoming she is with answers to any questions. As she is well past three thousand years old so finding something \u0027new\u0027 can be very challenging - though it is suspected she \u0027pretends\u0027 to be surprised \u0026/or delighted to nearly any good company. She loves to share her ideas with those she enjoys and it helps her to pass the nearly endless time that waits before her."},{"name":"Throne of The Harvürdium Kingdoms","genderRaceOccupation":"at all costs","description":" To this day this wonderful throne sits alone within a mighty (albeit crumbling) castle, long abandoned in the middle of a ruined empire. To any who seek its hard knowledge, bitter wisdom and face-peeling sarcasm, the way is easily discovered."},{"name":"Gaglagabablagubb","genderRaceOccupation":"clear thinking","description":" Seekers that go to this talkative blob of mouths \u0026 eyes can get vast, complex and insanity-inducing answers to so nearly any question. Though admittedly, one has to not only keep their sanity but also avoid being eaten throughout the conversation - some habits are hard to break. Clever people bring along at least enough snacks to pre-occupy this creature until any would-be questioning is done."},{"name":"Ventelusall","genderRaceOccupation":"Reincarnated","description":" Centuries ago legend speaks of a great bard asking a powerful green dragon: \u0027what is treasure?\u0027 Much to her surprise she could not answer as she really did not know. Why was something valuable? What had true enduring value? How could one attain the most or all of these Eternal Goods... whatever they were? She became rather flummoxed for at least a few centuries."},{"name":"Garian","genderRaceOccupation":"Male Elven Researcher","description":" Seers: Othelius is a half-lich. He and his partner Garian were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Othelius is now effectively immortal, but must be constantly moisturized by an external source. He normally resembles a healthy, if elderly, elven man, but shrivels and mummifies within a few hours if not properly hydrated. Othelius can passively anticipate many possible futures, and can give general predictions as to the way things will be in the next several weeks or months. He doesn\u0027t do long-term prophesying. Garian is a half-lich. He and his partner Othelius were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Garian, too, is effectively immortal, but must remain in an unnaturally dry environment or his body will rapidly putrefy and decay. His prophecies are of the more traditional kind - from time to time, he\u0027ll be inspired to write poems or songs that cryptically foreshadow events several years or decades in the future."},{"name":"Roland Roggeveen","genderRaceOccupation":"Male Elf Farmer","description":" A tall golden-eyed elf with hair the color of grain. He often wears a tan tunic, and grey overalls. He has a small farm of his own, and lives there alone. In the small windmill on his farm he practices his magic, and makes many things for his plants, magical fertilizers to cause plants to grow in wonderful and strange ways, mulches that push out weeds, and protect the soil, and sprays to dissuade the presence of vermin, and insects in his crops. He will sell these to anyone who can show a good interest in plants."},{"name":"Clara Sheehy","genderRaceOccupation":"Female Half-Elf Phytomancer","description":" A soft spoken and kind woman. Her hair is bright white with tinges of red, and green. She mostly keeps to herself, preferring the company of the magical plants that she creates. Her home is a small cottage with sunflowers and rosebushes growing around its edges, and many raised gardens scattered around it. She can be quite shy around new people to the point of misdirecting them away from her cottage with elaborate illusions. When she is outside her house she usually wears a large straw sun hat with a white ribbon on its top."},{"name":"Hubert Donnelly","genderRaceOccupation":"Male Leprechaun Shopkeeper","description":" A brown eyed leprechaun who wears a green tunic, and brown overalls. He manages his own shop, and sells various magical trinkets as well as gardening supplies. A few of his own gardening tools are quite magical. He acts kind to those that enter his shop casually, but when someone that has a great need for something enters his shop he will do whatever he can to trade them what they want at the cost of something they have great sentimental value in. He can be very mischievous, and even taunting to those that have traded something to him that the once greatly adored, and will not easily trade it back to them."},{"name":"Gerhard Katirci","genderRaceOccupation":"Male Ogre Geomancer","description":" A large ogre with dark grey skin, and piercing green eyes and a set of spectacles. He speaks very intelligently, but has issues with using profanity often. He wears a dense, grey, woolen shirt, and tan overalls. He works in mines to prevent their collapse, and to locate the ore or gemstones in them. Often he uses his own strength to amend issues in the construction of a mine. He respects the earth and stone of the mines he works in, and can speak to it in a way to find the best way to reinforce it."},{"name":"Haukvir","genderRaceOccupation":"Male Dwarven Watcher","description":" A quiet dwarf who lives in the ruins of a long-forgotten temple. His beard is glossy and black, as are his eyes. When he speaks, he speaks with many voices, in many accents, and none of them are Dwarvish."},{"name":"Bartholomew the Great and Powerful, First of His Name, Whose Arts Rattle the Vaults of Heaven","genderRaceOccupation":"Male Half-elf Charlatan","description":" Bartholomew (or, to his friends and/or paramours, Tol) is a lanky, somewhat frazzled half-elf with a shock of red hair. \u0027Shock\u0027 is an appropriate word; this stage magician uses what small sorcerous talents he has to swindle away the money of every backwoods family and small-town bumpkin from here to the Whitespire Mountains. Make no mistake, though: he might be terrible at performing magic, but he is a prodigy at summoning the eldritch horrors and assorted unsavory creatures that slaughter any who would turn him in to the authorities."}]