[{"name":"Who are these demonologists, shadowhunters, crusaders, and exorcists?","genderRaceOccupation":"The old priest winks, drains his cup of wine, and spryly hops off his bar stool. \"Come on,\" he smiles, \"if we go now, I can get you in and out of the temple\u0027s crypt before the midnight devotions begin.\"","description":" Last week, we made some fiendish villains, so it seems fitting that we collect some NPCs who oppose such beings. These NPCs could run the gamut from eager allies to dangerous foils, but they should not be sinister on all accounts (to distinguish them from villains). The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples."},{"name":"Brother Calymus","genderRaceOccupation":"Male Human Scholar","description":" A priest of the First Order of the Light, Brother Calymus is a spry, balding old man who\u0027s been wandering the world for half a century, seeking out ghosts, survivor\u0027s of near-death experiences, and other strange phenomenon attributed to the Spirit Realm. He\u0027s written two popular books on the topic and is happy to talk at length about the mysteries of death, especially over a cup of strong red wine. Whenever you run into Brother Calymus in a tavern or brothel, he\u0027s bound to know where some dark presence is lurking nearby in the world (and likely, he\u0027s eager to investigate once he finds the right help)."},{"name":"Sir Harrisen Figg","genderRaceOccupation":"Male Human Knight","description":" Tall and handsome with long dark hair and neatly-trimmed mustaches, Sir Harrisen was the heir of House Figg, but after the strange circumstances of the death of his sister, he renounced his inheritance and left his family to join the Watcher\u0027s Swords, pledging his life to hunting down enemies of the Moon Maiden\u0027s church. Figg has been particularly prolific in seeking out and destroying demons who reveal themselves in the world. He carries an ancestral sword that had been called Greatknife which he has renamed Fiendbane. When you meet him, you\u0027ll find he\u0027s a bit stiff, but he means well."},{"name":"Sister Dierdre","genderRaceOccupation":"Female Human Priestess","description":" Sister Dierdre\u0027s wide green eyes smile, despite a sadness lingering about her young face. She often fiddles with her long blonde braid when she speaks, especially if asked about her past. Dierdre was the promiscuous daughter of a high-ranking soldier, who couldn\u0027t seem to keep herself out of trouble, so her father sent her away to join the Second Order of the Light. She always approached ghosts and demons with fascination and, of late, has discovered her own talent as a medium between the world and the Spirit Realm."},{"name":"Lady Joenna Longfisk","genderRaceOccupation":"Female Human Knight","description":" Clad in mail and leather, Lady Joenna Longfisk is a tall maid with short-cropped auburn hair. She took up the sword against her father\u0027s wishes, following her young liege lord to battle in his fateful campaign against the Ice Clans. The campaign was largely successful, save the death of her liege lord. Too proud to return home, Lady Joenna pledged her sword in the service of the Storm King\u0027s Temple of Winter. Never at home among the men of the temple guard, a powerful priestess who had befriended her sent Lady Joenna back among the lands of the Ice Clans to search for an ancient shrine to the Storm King that\u0027s been lost for centuries."},{"name":"Goodson Harbert","genderRaceOccupation":"Male Human Exorcist","description":" With a missing eye and a wooden leg, Goodson Harbert cuts an intimidating figure, especially for a priest. He reeks of booze and speaks in a growl, but he\u0027s a warm soul beneath the gruff exterior. People say Harbert has been to the Hells and back, and no one who sees him would dare question that rumor. He\u0027s never risen high among the Goodsons of the Traveler, but he is respected by all within the church\u0027s hierarchy. If you have to face a demon, a ghost, or a questionably-sourced cask of ale, you\u0027ll want Harbert\u0027s hatchet and his box of potions and powders at your side."},{"name":"Bifgard Stonehouse","genderRaceOccupation":"Male Dwarf Crusader","description":" His flame-orange beard a shaggy tangle, Bifgard Stonehouse is quick to draw his axe at the first whiff of goblins, ghosts, and wights. For years, he has been working in stages to clear the ancient dwarf-hold of Silverden of goblins and undead almost single-handedly. He comes down from the mountains twice a year to re-supply his camp and make half-hearted attempts at recruiting some help in his task. Bifgard speaks very little until he\u0027s had a few ales, and then he speaks too much–becoming angry with himself (and anyone around him) whenever he lets slip one of Silverden\u0027s secrets, setting himself to perform an awful penance to atone to the Great Smith."},{"name":"Quelma Starcircle","genderRaceOccupation":"Female High Elf Shadowhunter","description":" Quelma Starcircle remained in the World when the last of her people left centuries past, her task still unfinished. Her brilliant blue eyes are patient and her manner is as soft and straight as her flowing silver-blonde hair. With her sword and her bow, Quelma has dogged the arch-lich Arameedi from one end of the World to the other. She has slain it six times, and six times the lich has risen. Quelma will continue her dangerous game of cat-and-mouse with Arameedi until she finds the hiding place of its phylactery or until it destroys her."},{"name":"Goran the Grim","genderRaceOccupation":"Male Human Preacher","description":" A devotee of the Southron pantheon, Goran spends his days preaching the word of the God of Death in the market square (\"Prepare! Seek Death on your own terms, lest Trickery guide your path or Ruin take your strength!\"). Black-robed, gaunt, and pale with dark circles around his dark eyes, Goran\u0027s deep voice booms across the square beseeching all who will listen to make time for meditation on Death every day. Goran also sells a variety of amulets and potions that will ward off the curse of undeath, so that Death may be met peacefully and honorably."},{"name":"Al-bah Zorimun","genderRaceOccupation":"Male Human Paladin","description":" Al-bah Zorimun is a broad-shouldered knight who wears light copper scale armor and always carries a wicked scimitar on his left hip and several short spears slung across his back. Zorimun\u0027s head is shaved and his mustache is long and waxed, though he often keeps both hidden from the sun with a white cotton cowl has he wanders the desert on his trusted mare. Every sun up and sun down, Zorimun prays to the Sun God asking the First Light and the Last Light to touch his flashing blade that he might strike down the dark followers of the Dead God. Zorimun is quietly going about his bloody work, seeking out the tent-camps and caves where the followers of the Dead God hide."},{"name":"Inquisitor Marsolis","genderRaceOccupation":"Female Tiefling Priestess","description":" She tells her guests her name before they see her - Francesca. She lures them into confidence with a voice full of contrite abasement, sexual undertones, knowing humor. She laughs, she cries, she tells them she\u0027ll be flogged if she doesn\u0027t get the answers she needs. Whatever works. When she can, she walks behind them unseen, the soles of her boots whispering on the flagstones of her clean, spare chambers. Just as with any other tool, she uses violence sparingly and judicially... but first, if nothing else works, she steps from the shadows and pulls the hood from her head. When they see her crimson skin, they begin to scream; when they see the jet black ram\u0027s horns that curl from the back of her head and over her shoulders, they begin to confess."},{"name":"Sir Nicolas of Eastmark","genderRaceOccupation":"Male Human Sorcerer","description":" Sir Nicolas is a peculiar sort of knight; he doesn\u0027t joust, or compete at the sword, or do any number of things that your average everyday knight would do. Instead, he wears finely tailored clothes, tasteful yet expensive jewelry, and personally oversees all of the kingdom\u0027s dealings with adventurers and would-be heroes. Having retired from adventuring himself at the ripe old age of 45, his dark hair (with gray wingtips, lovingly maintained) and trained grey eyes are a fixture around the palace. He prefers to do things the easy way, rather than the way that involves copious amounts of explosions, but make no mistake: he isn\u0027t called the Mage Knight of Eastmark for no reason."},{"name":"Dame Elmeara Dragonback","genderRaceOccupation":"Female Dwarf Paladin","description":" The first impression most people get of Elmeara is her armor: a set of brilliant white enameled plate, which under sunlight shimmers with a faint opalescence. Most trained warriors, sellswords, and hungry bandits scoff at such extravagance; after all, how experienced can one be without any battle damage on one\u0027s armor? Unfortunately for them, they are asking the wrong question. The right question: How good does Dame Elmeara have to be to come out of every fight with immaculate armor? The right answer: Very, very good."},{"name":"Alexei van Valerya, the White Hat","genderRaceOccupation":"Male Tiefling Assassin/Guard Captain","description":" Assassination is an art, and a difficult one at that. For every noble who travels in an open carriage through a city filled with tall buildings, there are five more who don\u0027t eat their breakfast until their entire court has a bite first. And yet, a select few kingslayers still manage to turn a profit. Alexei van Valerya knows the art of killing important people better than any other bodyguard, mostly because up until a few years ago, he was on the side of the artists. The ex-assassin-turned-security-chief cuts an unassuming figure; at 5\u002710 he\u0027s not the tallest, and at 160 pounds he\u0027s not the bulkiest. What he is, is effective. From his swept-back black horns to his toes, Alexei is all business. Tales around the palace say that he personally kills at least one foreign spy before breakfast, and two before lunch. He fights with his bare hands, or with garrote wire, or with long, ten-inch dirks that he wears on his back, and when he does, he is completely silent."},{"name":"Sygfellow Ottman","genderRaceOccupation":"Male Dwarf Stonewarden","description":" Sygfellow comes from a long line of stonewardens whose job it is to walk the long paths between the eastern brunmallow and northern grasslands where brigands often lurk seeking easy prey, or roaming barbarians encroach. Because of the fact that he\u0027s constantly on the move going to town to hamlet, he has an intimate knowledge of the inhabitants of each and is often sought out for news and tales and, when the wine is particularly fine, a song. Syg is the fifth generation of his family yo take on the stonewarden mantle. Syg stands four feet, nine inches tall and has long brown hair and amber eyes. Syg is so used to traveling the long trade roads that he travels quite light and can live fairly easily off of what the land provides. He knows every nook on the forest\u0027s edge where he can find safe respite and where to find the best fish and game. He\u0027s seen these roads to often and knows the paths so well, that he can smell when something is amiss. You\u0027ll know him by his rough green cloak and his compact yew bow that carries with him, and if he asks you your business, you\u0027d do well to answer wisely. Sygfellow does not suffer fools kindly."},{"name":"Sir Aaron Irkell, the Beacon\u0027s Light","genderRaceOccupation":"Male Human Paladin/Cleric of Torm","description":" Sir Aaron stands at an average height of just 5\u00279\". His blonde hair is incredibly short, and he wears long purple robes under a breastplate emblazoned with the seal of Torm. You can find him, more often than not, tending to the wounded Lord\u0027s Alliance soldiers in the med tents of Qui. His words are brief and to the point, but he is kind and well-mannered. He heads a church of Torm in the city of Qui called \"The Beacon\" where he teaches mercy, healing and kindness. Those who meet Sir Aaron on the street or in his church will often find him lost in thought, dwelling on those he could not save and praying for those he is still trying to save."},{"name":"Brother Kiniffer","genderRaceOccupation":"Male Human Crusader","description":" A paladin of torm and war veteran, he wears a leather armored kilt and a light leather tunic at all times. He has seen more wars and single combat encounters in his life than most can honestly speak of, and its left him a bit crazed or blood lusted, its hard to tell. His eyes are wide, and his head\u0027s got patches of hair all about it in between the patches that have either fallen out or been ripped out. He is nearly maniacal in his desire to drive evil from the land and he\u0027s happy to engage in long conversations with those who would help him do it. You can find him training with the other brothers of the First Light Monastery, east of the High Forest."},{"name":"Talal","genderRaceOccupation":"Male Half-Elf Mystic / con-artist (neutral selfish)","description":" Moral ambiguity personified with sandy blonde hair and a charming smile; a wink of his green eyes invites you into his secret. Most faiths have a secret cabal wherein special rites, prayers, and practices are rarely disclosed to the layman. However as a man of half truths and half lies, Talal can fit in to any one of these. Talal\u0027s specialty is knowing where these rituals take place and either owns or at least knows the location of cabalistic items of power.  "},{"name":"Keandra","genderRaceOccupation":"Female Tiefling Warlock / demon hunter","description":" Not everyone believes that hunting demons is a fulfilling career path. Thus was the belief of the arch devil Ezatan, who therefore sub-contracted his end of a deal to a young and desperate tiefling girl. Now that she is older, Keandra hunts demons with efficiency and indifference. Having no personal vendetta against the abyssal spawns, she finds no joy ridding the world of their evil. To her, it\u0027s just a job."},{"name":"Balchenod the White","genderRaceOccupation":"Male Tiefling Investigator","description":" The body was finally still beneath him, but he could feel the blood soaking into his pants. Still, he held the knife, hilt against the body\u0027s back, a few more seconds until he was sure it was only his own breath rasping in the dark cellar. \"Balch, you\u0027re getting sloppy,\" he muttered to himself as he willed his left hand to release the quarry\u0027s horn and slowly withdraw the ten inch dirk. The darkened skin of the tiefling on the floor seemed to go ashy in the inky black pool of its own blood. He\u0027d earned this bounty, but at what cost? Licking his lips unconsciously, he knew the self-flagellation tonight would be particularly intense."},{"name":"Krind Steeltoe","genderRaceOccupation":"Male Dwarf Ranger","description":" A long braided brown beard and piercing blue eyes are the first thing you\u0027ll notice when see this dwarven ranger. He initially has a gruff demeanor, but becomes friendly enough once you known him for a while. A follower of Marthammor Duin, he aims to explore new lands and protect his fellow travelers and any people who he might meet on the road. Accustomed to hilly terrain and mountains, his recent travels though an unholy mountain pass have led him into combat with wicked undead far too often for his tastes, and he would welcome any help in exterminating this threat to the locals and travellers."},{"name":"Skrazano","genderRaceOccupation":"Male Kobold Soldier","description":" This loyal soldier is no ordinary kobold. Although he is at present nothing more than a soldier, he has been handpicked for the elite guard due to his skill and bravery in combat. Through his veins runs a sliver of metallic dragon blood, granting him power beyond that of an ordinary kobold. He is dedicated to his duty and speaks very little. And when he does speak, he speaks softly, barely more than a whisper."},{"name":"Aurak Gnar","genderRaceOccupation":"Male Dragonborn Paladin","description":" Aurak Gnar is a 6\u00278\" golden metallic dragonborn. Wearing shining plate armor, wielding his silver sword and garrisoning his shield. Aurak is stern and outgoing, taking command where possible. He prefers to lead from the front and take a cautious approach to most things. Having survived numerous battles where patience, not the might of a sword arm, was the deciding factor. He is merciful to most beings, believing that everybody has the chance to turn to the light. However he acts without mercy or quarter to beings of evil and those who help them."},{"name":"Sivak Nala","genderRaceOccupation":"Female Dragonborn Priestess of Bahamut","description":" Sivak Nala is a fierce silver dragonborn with a height around 6\u00273\". She wears simple armored robes and wields two short swords. Despite her cold outwards appearance, she is deeply caring for those in need and those who cannot defend themselves from the horrors of the dark. Her shy calm and graceful demeanor do not carry over to those of foul natures, even if they aren\u0027t innately evil beings. Driven and focused to the task at hand, Sivak Nala hunts down the dark forces of the world with equal measures of grace and cold malice."},{"name":"Bozak Rhogar","genderRaceOccupation":"Male Dragonborn Knight","description":" Bozak Rhogar is large, even for a dragonborn. Standing at a towering 6\u002711\", and seemingly built out of a bronze wall, Bozak Rhogar is a force to be reckoned with. Known as a dispassionate fellow, Bozak holds no quarter to any who hold themselves outside of the law, or worse, the paths of darkness. Beneath his bronzed exterior lays a heart of, more bronze. Bozak is quiet and pensive, often going hours or even days without speaking. Preferring to instead answer with a nod, grunt, or silver maul."},{"name":"FlyHandle","genderRaceOccupation":"Male Aarakocra Mercenary","description":" A member of a radical mercenary guild, FlyHandle speaks very little, takes orders, and has little qualms as long as there is pay. He builds trust with long term contractors, and will slowly open up about his opinions and knowledge. He wears light armor, can class as a barbarian, and prefers spear-like weapons."},{"name":"Cadrielda Sabreen","genderRaceOccupation":"Female Human Shopkeeper","description":" The owner of Cadey\u0027s Trinkets, an arcane pawn shop carrying a variety of handy gadgets and minor magical items. Her long black curls come nearly to her waist. She wears large round spectacles and walks with a slight slouch, but she is otherwise modestly attractive. Cadrielda is shy and fidgety, and seems to consider interacting with customers to be a necessary evil. She can barely stay afloat because she is always tanking in stray animals. Unknown to most, she was once a druid, but was banished from her circle for dabbling in science, and many of the goods she sells are actually of her own invention."},{"name":"Kaivoth the Tall","genderRaceOccupation":"Male Half-orc Hunter","description":" A massive, late middle-aged half-orc with scarred gray skin. He lives as a hunter and adventurer, and is known to be a man of very few words. He carries a locket with a tiny portrait in it, but refuses to say who is pictured there, and worships an obscure dwarvish deity but refuses to say why. Though he normally works solo, a couple rounds of ale might convince him to work alongside the party."},{"name":"Lazloch Sylveron","genderRaceOccupation":"Female Half-elf \"Bounty Hunter\"","description":" An orphaned teenage tomboy living in the slums of a large city. She was once a skilled pick-pocket, but after reading a book by the philosopher Picurales, she underwent a kind of conversion and decided to use her talents for good. Now she is determined to become the world\u0027s most famous bounty hunter. She cuts her blonde hair boyishly short and dresses entirely in black leather, as this is what she imagines a bounty hunter is supposed to look like. If pressed, she will insist that she is a full-blooded elf, though she obviously has some human ancestry."},{"name":"Name Unknown","genderRaceOccupation":"Male Human Monk","description":" A monk of St Cuthbert, he took a vow of silence at the age of 10. He has yet to speak and is reaching into his 70\u0027s. With his ageless body achieved at 10 he has not aged a bit. He spends his life guiding those who are lost in the woods near his Monastery to safety."},{"name":"Stakta \u0027Whistletongue\u0027","genderRaceOccupation":"Female Dragonborn(Brass) Captain of the Guard","description":" Stakta spent many a year as a thief, working in the underbelly of the city. One day she was given a job to assassinate a cleric of Bahamut. Not knowing this clerics strength, and falsely assuming in his age he was feeble and unable to defend himself she took a direct approach. She was swiftly beaten, and while lieing near death on the street the cleric began to heal her. Even though not a minute earlier she had tried to take his life, he was ensuring her survival. Thus began her repentance, and her worship of Bahamut."},{"name":"Vendrick \u0027Wildheart\u0027","genderRaceOccupation":"Female Gnome Bloodhunter","description":" A powerful bloodhunter, her first kill at the age of 12 she specializes in wielding weapons of uncommonly large size for her race. Constantly under the effects of an illusion she appears before her prey as an innocent human child. She preys specifically on demons, or cursed that hold weapons or items of sentience, even if they\u0027ve no other power to speak of. She\u0027s slowly expanding her circle of \u0027friends\u0027."},{"name":"Torbarth \"the Heavy Handed\"","genderRaceOccupation":"Male Half-Orc Paladin","description":" Among paladins, Torbarth has become a bit of a laughing stock. His approach to rooting out evil and corruption is ask those under scrutiny bluntly: \"do you serve the forces of order and goodness?\" In the case of a no, or an unconvincing response, Torbarth has been known to lurk just over the shoulder of the person in question, making note of their every decision. He has been known to keep this up for upwards of a fortnight before making his final judgement and moving on."},{"name":"Mill Burray","genderRaceOccupation":"Male Human Exorcist","description":" Genial and entirely average looking, Mill Burray makes a career of exorcising ghosts. His \"work\" uniform consists of an off-white jumpsuit, a backpack overflowing with dubious looking equipment, and his trusty ghost-dowsing rod. With proper payment delivered half on commission and half on completion, Mill will dowse any haunted site for supernatural entities, and capture them in spirit proof vessels using any number of appropriate rituals or techniques."},{"name":"Mekaela \"the Unremarkable\"","genderRaceOccupation":"Female Elf Demonologist","description":" Although nobody could tell you precisely what she looks like, Mekaela has built quite the reputation as a bottomless font of knowledge on demons and the abyss. If asked, she politely diverts any questions about her uncannily unremarkable appearance by saying \"it\u0027s just a precaution, strictly necessary in this line of work.\" Often the only thing that Mekaela will ask in exchange for a bit of information on demons - or any demon in particular - is that her client keep her informed of any new relevant knowledge they gain. That, and that they spread word of her services, as she is so unremarkable it is understandably hard to do much networking in person."},{"name":"Who are these crones, enchantresses, and fortune tellers?","genderRaceOccupation":"The witch smiles gleefully as she squishes the caterpillar between her fingers. \"Into the pot!\" she smiles as she tosses it into the bubbling, hissing liquid.\"","description":" Witches, seers, fortune tellers, and diviners are staples of fantasy worlds. Individuals who have glimpsed dark secrets or who can peer into the future. Sometimes these are villains, but most often they are following some agenda of their own that is unwholesome if not wholly evil. The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples. (These may or may not have drawn some inspiration from these tables and these tables.)"},{"name":"Myrta","genderRaceOccupation":"Female Human Crone","description":" Myrta learned her craft from a half-elf witch who came to her aid after she was evicted following the death of her fourth husband. This cackling old crone saved Myrta and her young daughter from a beggarly life, teaching them spells that gave them the power to manipulate men\u0027s minds and the forces of nature. Since being chased from town after a few short years of scrounging in the allies, Myrta\u0027s made a cozy little lair for herself and her grumpy familiar Ormund the Owl in a cave in the swamp. She\u0027s a tough old bird, and she\u0027ll happily mix up a poison or curse an item for you in exchange for a few silvers. Her mistress told her about the staff of Hecate, the first witch, and Myrta\u0027s been gingerly probing for lore relating to the staff ever since. She\u0027s currently mixing up a terrible poison made from blindworm\u0027s sting, dryad\u0027s thorn, and stirge\u0027s foot. Who the poison is intended for is anyone\u0027s guess..."},{"name":"Marta","genderRaceOccupation":"Female Human Enchantress","description":" Marta is the witch Myrta\u0027s beautiful daughter by her second husband, and she learned the craft as a teenager on the streets from her mother. Marta left her mother\u0027s tutelage to marry some handsome lord, but he died under mysterious circumstances. When suspicion turned on Marta she fled to the mountains where she lives, conducting seances, reading the palms of travelers, and seeking the soul of her dead husband. Her familiar is a talkative snake named Hiss-Fiss, and her other companion in the mountains is a giant bat named Hipp-Fipp, whom she rides to and from the valley to her hidden lair. Marta has a nervous twittering laughter that shakes her pleasant features in an unpleasant way. She also has a real talent for love potions. Most men who drink these potions fall in love with Marta herself, but that works for her. She enjoys taking new lovers. She also enjoys casting old lovers from her mountaintop home when she\u0027s done with them."},{"name":"Morta","genderRaceOccupation":"Female Half-Elf Bogwitch","description":" Morta is the most mysterious member of the coven. She\u0027s half-elven with a very unfortunate wart on her nose. She\u0027s quite good at preparing alchemical concoctions, from magical cure-alls to pyrophoric substances. She lives on an island in the swamp and transforms into an owl to get from place-to-place. If you let on that you know magic, she\u0027ll pick your brain for ritual lore before letting you go. Once she let\u0027s you go, there\u0027s a good chance she\u0027s going to hunt you down with her bow and her spear. If you get far enough away, she\u0027ll transform into a horned owl and track you down. She consorts with a gleeful fire elemental familiar who delights in burning things and whom Morta is constantly trying to restrain as she prefers to kill things herself. Morta delights in the thrill of the chase and the adrenaline rush of making the kill to end a successful hunt."},{"name":"Laki","genderRaceOccupation":"Female Human Shadowseer","description":" Old Laki is a bent-backed creature of routine who knows the most unexpected things. Every morning, she rises to a cup of tea and dried fish before her morning walk amongst the beaches and meadows of the rugged coastland. Hobbling along with her crooked cane, she collects bits of driftwood, grasses, herbs, and shells for her fires. She sleeps the afternoon away under the watchful gaze of her raven, and receives guests in evening. All through the night, she prays to her dragon gods and works her spells, divining answers to her guests\u0027 questions by interpreting the shadows the flames cast on her tent walls."},{"name":"Margy the White","genderRaceOccupation":"Female Human Fortune Teller","description":" Robed in black with dark brown hair and tan skin, one may ask why is she called Margy the White? This sturdy middle-aged woman offers readings in her kitchen, during which her voice deepens and her face takes on a ghostly pallor. The local priest has been ranting about Margy being a fraud for decades, but that never seemed to bother Margy. She keeps offering to do a reading for a silver to any who ask and who have good manners."},{"name":"Glyddon Silverstrings","genderRaceOccupation":"Male Half-Elf Singer","description":" Glyddon Silverstrings has a handsome face and a golden voice and a pitch-perfect harp. He has recently been wandering the villages of the Borderlands singing for his supper and offering simple healing as his meager skills allow. Once in a while, he has had dreams that offer him glimpses of the future, including foreseeing his own mother\u0027s death while a youth in Brightharbor. After she died, he has been an unsettled rascal, never staying in one town for long. Some say he is wanted for the murder of a Southron merchant prince whom he tried to warn about his enemies\u0027 plans."},{"name":"Deepbrother Harridan","genderRaceOccupation":"Male Human Prophet","description":" A gaunt priest of the Sea Queen, Deepbrother Harridan preaches her dire message of darkness and suffocation for those who do not submit to her will. Harridan himself was the sole survivor of a terrible shipwreck as a young lad. So moved by his luck, he pledged himself as a deepbrother of the Sea Queen, claiming to have received visions of her plans when his lungs were filled with seawater. He has \"drowned\" himself dozens of times since, taking on seawater and asking that his assistants revive him. Recently, he has predicted a black vengeance will rise from the sea to consume those in the city who refuse to renounce their devotion to the Light."},{"name":"Borovurnum Jurtha","genderRaceOccupation":"Female Human Sailor","description":" On the languorous and rain-soaked coastlines there is a rowboat tied to a rotting pier somewhere. On this rowboat is Borovurnum, never tired, never hungry, with fire behind her huge pupils and teeth and deep blue tattoos of wide-eyed snakes up and down her muscled arms. She will row you to the nearest fishing hamlet, clam shack, or charcoal-burner\u0027s hut for only some conversation in exchange; and during the journey she will offer you to smoke from her pipe. If you interest her sufficiently with information—and, more importantly, manage to draw a mouthful of smoke from the pipe—then she will regard you highly and pleasantly, offering to row you anywhere you wish or could possibly imagine. However you will smell of, and constantly spit up, liquid smoke and heatless fire for a few days afterwards. Further, you will always hear the slight splashing of oars on water from inside your head, your appetite will be subdued and then all at once entirely gone, your eyes will feel hot and swollen."},{"name":"Malfra","genderRaceOccupation":"Female Human Enchantress","description":" Ever since Malfra was born, she felt different from the others living in the small hamlet. Her natural magical talents made her feel like an outcast. As a young woman she met her one true love. He was a soulmate: finally someone with whom she could share her gift of magic. One day, he gave her the most beautiful flower she had ever seen as a token of their love. When their relationship ended on his behalf, Malfra turned bitter. She grew envious of other young maidens who were happy with their lovers. Fleeing from her home and retreating into the neighboring woods, she set out to destroy their happiness. When young couples wander too close to her confines, she enchants the young maiden in love and turns her into a bird, to be locked into a cage at her hovel. Only the flower that reminds her of her long lost love will break the spell."},{"name":"Norgith the phasing","genderRaceOccupation":"Male githzerai wanderer","description":" Norgith is a tall, gaunt, hooded figure, always wandering through dark woods or climbing distant mountains, though sometimes he is seen passing through alleyways in bustling cities. Little is known about him, but whenever he is encountered, he is amicable, though impatient. He seems to know everything, and has an answer to every question, but he always speaks enigmatically, and also always claims only to have a few moments to talk. When people try to find him again, even moments later he is gone. No one ever sees him coming, and no one sees him leave. It is said that he phases across time and space, observing the world, but not staying in any one place for long, which is how he gained his knowledge."},{"name":"Giddy Cremm","genderRaceOccupation":"Female Half-Orc Suntouched Cragwitch","description":" She clings to the boulders and cliffs of her mountain home with hooks made from steel, woven through her fingers and along her arms with lengths of braided leather, hemp and hair. She wears the sun as a cloak, the wind as a bonnett, the sky as a dress. Her laughs (and her deep, unsettling coughs) echo for improbable distances, and it\u0027s always wise to make camp when you hear them, and soon; should there be a pot of something tasty awaiting her when she comes calling, she might be willing to overlook a trespasser on her land."},{"name":"Marin of the Lupines","genderRaceOccupation":"Female Human Oracle","description":" She lives in a sturdy cabin, tucked between two boulders on the edge of the wood, where the tall trees give way to to undergrowth and wildflowers. During the long springs and summers and autumns, she can be found wandering the the threshold - the divide, she calls it - harvesting the few Lupines that stray under the shade of the foliage. These, she says, grow with the shadow in them. She boils them in springwater and honeycomb, and as she whispers her hidden words, the bees from the meadow crawl through her knotted hair and across the glassy mirrors of her sightless eyes. Those who watch find it unnerving, but the wise know that the bees keep secrets."},{"name":"Twisted Tether","genderRaceOccupation":"Awakened","description":" She loves questions. Her only request for repayment is \u0027to discover something that she has not before\u0027. This can be a song, a riddle or simply showing her things she has not seen - be that with books, paintings, casting illusions or virtually anything else. The more impressed she is with this information or story the more forthcoming she is with answers to any questions. As she is well past three thousand years old so finding something \u0027new\u0027 can be very challenging - though it is suspected she \u0027pretends\u0027 to be surprised \u0026/or delighted to nearly any good company. She loves to share her ideas with those she enjoys and it helps her to pass the nearly endless time that waits before her."},{"name":"Throne of The Harvürdium Kingdoms","genderRaceOccupation":"at all costs","description":" To this day this wonderful throne sits alone within a mighty (albeit crumbling) castle, long abandoned in the middle of a ruined empire. To any who seek its hard knowledge, bitter wisdom and face-peeling sarcasm, the way is easily discovered."},{"name":"Gaglagabablagubb","genderRaceOccupation":"clear thinking","description":" Seekers that go to this talkative blob of mouths \u0026 eyes can get vast, complex and insanity-inducing answers to so nearly any question. Though admittedly, one has to not only keep their sanity but also avoid being eaten throughout the conversation - some habits are hard to break. Clever people bring along at least enough snacks to pre-occupy this creature until any would-be questioning is done."},{"name":"Ventelusall","genderRaceOccupation":"Reincarnated","description":" Centuries ago legend speaks of a great bard asking a powerful green dragon: \u0027what is treasure?\u0027 Much to her surprise she could not answer as she really did not know. Why was something valuable? What had true enduring value? How could one attain the most or all of these Eternal Goods... whatever they were? She became rather flummoxed for at least a few centuries."},{"name":"Garian","genderRaceOccupation":"Male Elven Researcher","description":" Seers: Othelius is a half-lich. He and his partner Garian were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Othelius is now effectively immortal, but must be constantly moisturized by an external source. He normally resembles a healthy, if elderly, elven man, but shrivels and mummifies within a few hours if not properly hydrated. Othelius can passively anticipate many possible futures, and can give general predictions as to the way things will be in the next several weeks or months. He doesn\u0027t do long-term prophesying. Garian is a half-lich. He and his partner Othelius were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Garian, too, is effectively immortal, but must remain in an unnaturally dry environment or his body will rapidly putrefy and decay. His prophecies are of the more traditional kind - from time to time, he\u0027ll be inspired to write poems or songs that cryptically foreshadow events several years or decades in the future."},{"name":"Roland Roggeveen","genderRaceOccupation":"Male Elf Farmer","description":" A tall golden-eyed elf with hair the color of grain. He often wears a tan tunic, and grey overalls. He has a small farm of his own, and lives there alone. In the small windmill on his farm he practices his magic, and makes many things for his plants, magical fertilizers to cause plants to grow in wonderful and strange ways, mulches that push out weeds, and protect the soil, and sprays to dissuade the presence of vermin, and insects in his crops. He will sell these to anyone who can show a good interest in plants."},{"name":"Clara Sheehy","genderRaceOccupation":"Female Half-Elf Phytomancer","description":" A soft spoken and kind woman. Her hair is bright white with tinges of red, and green. She mostly keeps to herself, preferring the company of the magical plants that she creates. Her home is a small cottage with sunflowers and rosebushes growing around its edges, and many raised gardens scattered around it. She can be quite shy around new people to the point of misdirecting them away from her cottage with elaborate illusions. When she is outside her house she usually wears a large straw sun hat with a white ribbon on its top."},{"name":"Hubert Donnelly","genderRaceOccupation":"Male Leprechaun Shopkeeper","description":" A brown eyed leprechaun who wears a green tunic, and brown overalls. He manages his own shop, and sells various magical trinkets as well as gardening supplies. A few of his own gardening tools are quite magical. He acts kind to those that enter his shop casually, but when someone that has a great need for something enters his shop he will do whatever he can to trade them what they want at the cost of something they have great sentimental value in. He can be very mischievous, and even taunting to those that have traded something to him that the once greatly adored, and will not easily trade it back to them."},{"name":"Gerhard Katirci","genderRaceOccupation":"Male Ogre Geomancer","description":" A large ogre with dark grey skin, and piercing green eyes and a set of spectacles. He speaks very intelligently, but has issues with using profanity often. He wears a dense, grey, woolen shirt, and tan overalls. He works in mines to prevent their collapse, and to locate the ore or gemstones in them. Often he uses his own strength to amend issues in the construction of a mine. He respects the earth and stone of the mines he works in, and can speak to it in a way to find the best way to reinforce it."},{"name":"Haukvir","genderRaceOccupation":"Male Dwarven Watcher","description":" A quiet dwarf who lives in the ruins of a long-forgotten temple. His beard is glossy and black, as are his eyes. When he speaks, he speaks with many voices, in many accents, and none of them are Dwarvish."},{"name":"Bartholomew the Great and Powerful, First of His Name, Whose Arts Rattle the Vaults of Heaven","genderRaceOccupation":"Male Half-elf Charlatan","description":" Bartholomew (or, to his friends and/or paramours, Tol) is a lanky, somewhat frazzled half-elf with a shock of red hair. \u0027Shock\u0027 is an appropriate word; this stage magician uses what small sorcerous talents he has to swindle away the money of every backwoods family and small-town bumpkin from here to the Whitespire Mountains. Make no mistake, though: he might be terrible at performing magic, but he is a prodigy at summoning the eldritch horrors and assorted unsavory creatures that slaughter any who would turn him in to the authorities."},{"name":"Who are these merry magic-makers?","genderRaceOccupation":"The pretty little thing smiles as she beckons you onward along the narrow trail, swaying back and forth suggestively as she flies. You know you should follow the main path, but there something about her that you can\u0027t resist...","description":" Between here and /r/DMAcademy, there seems to have been a small run on Feywild posts of late. So let\u0027s populate some faerie forests with faeriefolk—pixies, sprites, nixies, nymphs, satyrs, you-name-it. I love pixies and sprites a bit too much, even in a dark, low-magic world, a region of a forest where there is a small community of tiny faeries is a grand opportunity to inject some wonder and to cause light-hearted trouble for the big folk. And, a faerie village can serve as a hub for NPCs, plot hooks, and small-scale supplies in regions of the world that is largely devoid of civilization. The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing."},{"name":"Meliorn of the Unseelie Court","genderRaceOccupation":"Male Archfey Lord","description":" Platinum blond hair, bright blue eyes, pale skin, wearing spider-silk garments fit for Llolth, emblazoned with gems that gleam like star light. Meliorn is a schemer- calm, patient, and seductive in his ways. Among other archfey, he\u0027s not particularly strong, but he seeks power through mortal achievement. He\u0027s been known to cut deals with the unwary and the desperate, and will send false-prophets into the world that can grant \u0027wishes\u0027 to the common folk in exchange for a favor in the future. Meliorn collects and saves these favors. To his debtors, these favors are an unbreakable obligation, which carry on into the afterlife."},{"name":"Whit Wrencaller","genderRaceOccupation":"Male Pixie Woodcarver","description":" Whit makes carved wooden curiosities—mostly toys and book ends. He makes a fair number of flutes and recorders, but if you want a real treat, you\u0027ll catch him while he has one of his fiddles in stock. A perfectionist, Whit trashes nine out of every ten fiddles he starts making. If you\u0027re lucky, you\u0027ll catch him when he breaks out his own tiny fiddle. When his nimble hand dances across the fingerboard, you can\u0027t help but tap your toes and take up the dance too."},{"name":"Daisy Dewpetal","genderRaceOccupation":"Female Pixie Landlady/Barmaid","description":" Daisy is cute as a button with iridescent red hair, pouty lips, and golden wings. Daisy runs the Twig and Thistle Inn. She serves some mighty fine pixiewine, and when she dances, you can\u0027t help but watch her sway. Her dancing is full of sorrow and passion. Daisy doesn\u0027t smile near as much as she used. She\u0027s been running the inn on her own since her partner Glip met an unfortunate end."},{"name":"Old Fox Featherbee","genderRaceOccupation":"Male Sprite Fletcher","description":" Fox fixes feathers of free-range forest fowl to his fine, finished arrows. Fox makes both large arrows and small arrows. His work is of such quality, several of the wood elves have been known to purchase arrows from Fox. Old Fox loves to talk about his adventures in the forest and never misses a chance to tell the tale of how he came to have that broken wing (it is quite an amusing tale involving an ogre, an elf-maid, and a magic mushroom)."},{"name":"Buck Boughbender","genderRaceOccupation":"Male Sprite Bowyer","description":" Across the way from Old Fox, you\u0027ll meet Buck the Bowyer. He makes decent bows, but he\u0027s not strong enough to string up bows for the big folk. He\u0027ll bend your ear regarding the most recent mischief happening at Madame Poppy\u0027s place in the pixie town over yonder. Buck\u0027s known to be found in his cups, tangled up with one or another of Poppy\u0027s girls. People say Madame Poppy owes him some sort of debt of gratitude, so she lets him have a \"special discount\" when he visits."},{"name":"Poppy Plumdiddle","genderRaceOccupation":"Female Pixie Madame","description":" Blue-winged and fair-haired, Madame Poppy runs the House of Li\u0027l Repute where all the girls are petite and dusty-eyed. All the girls are faeries of course. They can fiddle and dance and make romance though their methods are a little creative to overcome the mechanical challenges of entertaining big men. Madame Poppy puts on a polite and innocent face, but she knows exactly what she\u0027s doing. The girls still chatter and wonder about the time Madame Poppy single-handedly sent a hobgoblin captain and two of his lieutenants off into smiling just a few short minutes after they had squashed poor Glip Pinesap and were threatening to carve up the whole town."},{"name":"Roan Daar, Lord of the Sweeping Fen","genderRaceOccupation":"Male archfey","description":" A minor archfey, Roan Daar nevertheless possesses a full measure of the pride and fickleness inherent in the faerie folk. He takes the form of a tall, impossibly thin humanoid figure, with a reedy voice and deep-set golden eyes, often wearing long robes of woven swamp-grass and lined with cattail-fur. Those trespassing in his swampy domain are often sucked under, only to be returned to the surface unharmed years later. He counts many will-o-the-wisps as his children, and they will often surround him wherever he appears."},{"name":"Ezel Broadcap","genderRaceOccupation":"Male killoren artificer","description":" A skilled artificer of no small renown. He can be identified by his clothing first and foremost; a wide-brimmed, pointed hat that seems to be made of frost-covered twigs and small branches, a loose-fitting tunic made from spring shoots and new growth, and trousers woven from fallen autumn leaves. He bears a simple staff, as well. Ezel is brusque and mostly concerned with his own projects, the archetypical preoccupied wizard. Most of his work, however, goes into making small objects and trinkets to make life a little easier for those who discover them. A pouch of small rocks that transmute themselves into silver pieces, which refills each dusk; a willow-twig ring that rustles like wind when danger approaches; a kettle that perfectly seasons any food placed inside."},{"name":"Pox Petaldew","genderRaceOccupation":"Male Pixie Police Commissioner","description":" Kin to the respected Dewpetal pixie clan, Commisioner Petaldew is charged with keeping the peace in the Faerie Wood. He is short-tempered and high strung. He is possibly the only Pixie angry enough to use foul language, though who can blame him? Between the the threat of goblin loggers, lost adventurers, and feuding Faun clans, someone has got to maintain order in the Faerie Wood."},{"name":"Sel\u0027adrin Grintooth","genderRaceOccupation":"Female Faerie Dragon Trickster","description":" Lives in a secluded forest mostly burned down by Gnolls. She uses illusions to make the forest seem huge and alive and loves to trick passing travelers with illusionary treasure chests sunken in the lush vegetation. She stays behind until her young return, unbeknownst that they were kidnapped by the Gnolls after they destroyed the forest."},{"name":"Merilin Lean","genderRaceOccupation":"Male Faun Silklarvae-trader","description":" Faun in fancy cloths, only small crooked horns. Hates to be called satyr and he has an addiction to poppyflowers. He is a charismatic and skillful trader."},{"name":"Simyera Lac","genderRaceOccupation":"Female nymph/mermaid gossiper","description":" Lives in a small lake next to a forest road, beautiful and halfnaked. She will try to lure you in the deadly cursed water but she has a weakness for all kinds of smalltalk and gossip."},{"name":"Amalore","genderRaceOccupation":"Female ? Guide","description":" A giggle on the wind and a ripple in the water, that is who she is. She likes moonlight and sweets. She is an exemplary guide when fed with sweets every day, but you can not try to find and see her, that is rude."},{"name":"Mika and the Bear","genderRaceOccupation":"Female faery kid","description":" Mika is a small faery kid which is always found protected by her dire bear. She lost her home and is looking for an invisible silver key that will allow her to return home."},{"name":"Lush","genderRaceOccupation":"Male little satyr trickster","description":" Lush is small, very small, even for satyr size. He is a compulsory liar and he will not even hide it. He knows a little magic, has a lot of luck and cheats at cards and stones. He spends his day following random strangers on their trips and eats their food and drink their wine in return for random falls facts about the area."},{"name":"Glitterball","genderRaceOccupation":"Female Pixie Trickster","description":" She is all about turning people into butterflies. The first time people are aware of her is when one of their number suddenly disappears and a floating, winged flier takes their place. She is not malicious and has the personality of a very young child. If she thinks she\u0027s in trouble she\u0027ll fly away but if asked kindly, she\u0027ll turn your friend back to normal."},{"name":"Flitterwing","genderRaceOccupation":"Male Sprite Envoy","description":" Highly serious and to the point, he is an envoy of an arch-fey and takes every excursion as of critical importance. He is quick to arm himself with his tiny bow, dripping with the most powerful sleep poison in the fey but prefers not to use it. His objectives are a secret he will keep till death and failure is never an option."},{"name":"Delia Firenut","genderRaceOccupation":"Female Sprite Singer","description":" Delia is usually dressed in short yellow dress made up of autumn leaves, and has her naturally red hair tied in a ponytail. As most faeries, she too is curious about humans, but at the same time keeps a distance from them, secretly believing that fey are superior to the mortal races. She was singer until the moment her voice was stolen by unseelie satyr."},{"name":"Sargaritis","genderRaceOccupation":"Female Nymph Arcanist","description":" Her hair the color of hazelnut usually sticks to her seductive face since it\u0027s always wet, just as her white dress. Being an intelligent fey, she sprinkles her speech with occasional eloquent word that would seem out of place for an unseelie nymph. She likes to tease mortal men, prefering humans and halflings and trying to drown them in her home lake as a joke. Even though its touch doesn\u0027t have any effect on her, she is disgusted by the idea of her or her home lake coming in contact with cold iron. Deep in her home lake, she hides a little cavern with several books about magic and the nature of weave she likes to read in her spare time."},{"name":"Naroth","genderRaceOccupation":"Male Centaur Warrior","description":" Serving his seelie queen as best as he can, Naroth seems to be black mustang from the waist down, and handsome muscular elf from the waist up. Always ready to fight, he is never seen in public without his specially fitted armor and his lance made of gold and silver. He is courageous, but as it often is said - the line between courage and stupidity is often very thin. Since most children were afraid of him, he was picking up a hobby in his free time - juggling."},{"name":"Alarn Petfina","genderRaceOccupation":"Male Eladrin Crystal merchant","description":" Alarn can usually be seen either in the market, town square or arcane district of his hometown, most often wearing one of his colorful robes. He is skilled in getting what he wants, and knows when someone tries to rob him of the business. He likes to walk barefoot everywhere, and started recently studying arcane magic, just to see what exactly do the arcanists always need so many crystals for."},{"name":"Jezariah Daemaer","genderRaceOccupation":"Female Eladrin Assassin","description":" Jezariah, or Jeza for short, murders people who deserve it according to her morals. Professional in disguises and infiltration, she usually takes one month to get to know her target, in order to figure whether she should or shouldn\u0027t really kill it. Most people don\u0027t realize that what seems to be gray hair is really just a wig covering her short blonde hair, and that the scar on her left cheek is just as fake. In her free time, she is an actress working for local theater."},{"name":"Yoinc","genderRaceOccupation":"Male Archfey Trickster","description":" Yoinc resembles ginger gnome dressed in green clothes, who likes to cause mischief to the mortals. He likes to welcome them, and introduce them to the ways of Feywild, saying that their welcoming tradition is opposite, and that the mortals have to give him a gift. Anything is considered a great gift by him as long as it\u0027s offered freely. However, those who take too long or outright refuse giving Yoinc a gift are misfortunate enough to be robbed by him. With his power to steal anything, he can pick anything mortal values and escape from them, be it memories, body parts, face, soul, strength... you name it, he can steal it."},{"name":"Stump","genderRaceOccupation":"Male Gnome Druid","description":" Stump is a tiny, wizened old gnome who dresses in faded brown clothes and carries a token-bedecked staff. He\u0027s able to sit so still that he\u0027s almost impossible to see in the woodland, appearing as one of dozens of incongruous tree stumps. His patience and skill make him a favorite scout for more powerful fey."},{"name":"Fuath","genderRaceOccupation":"Male Dragonsworn King","description":" Fuath is tall and muscular with dark, ebony skin and red-gold eyes burning with madness. Fuath is chief among the fae that pledged their allegiance to the great dragons in the Emergence War. He slew his own brother, the consort of the Unseelie Queen in battle and nearly slew the Queen as well. Corrupted by the power and greed of the dragons, Fuath has taken many of their traits on in the millennia since the war. A fiery temper rules him, as does his vanity. He is determined to bring the world under his sway."},{"name":"Cellach","genderRaceOccupation":"Male Unseelie Duke of Winter","description":" Cellach is thin and pale with silver hair and icy blue eyes. Cold, cruel and calculating but possessed of a terrible fury when pressed too far. He is a trickster by nature, taking great joy in toying with the lesser beings, particularly elves as he holds them in low regard (being the spawn of human-faerie \"congress\")."},{"name":"Croítine","genderRaceOccupation":"Male Seelie Condemned","description":" Being one of the chief perpetrators of the intermingling of faerie and human blood, Croítine was tried and condemned by both Queens, Tatiana and Mab. He was imprisoned in a spherical ruby, much like several other fae who were condemned. He can reach out through his spherical prison and communicate with those lesser beings who are touched by the Feywild (such as elves and people serving fae lords/ladies). He desires freedom after his two thousand year imprisonment, and is willing to do much for whoever grants it to him."},{"name":"Old Madam Quincy","genderRaceOccupation":"Female Brownie Herbalist","description":" A little old woman with an enormous garden, which she cares for very meticulously. Sells herbal remedies and potions of unparalleled quality from her home, though prices are steep. Archenemy of rabbits and vegetable thieves everywhere, she keeps a pet blink dog as a deterrant. Also makes a mean goodberry pie. If a customer tells her a good joke, she might throw one in for free!"},{"name":"Sasha Starword","genderRaceOccupation":"Female Pixie Scholar","description":" Much more serious than most of her pixie sisters, Sasha only leaves her miniature library to find new books and scrolls, which she copies into pixie-size versions in beautiful, illuminated manuscript. However, she\u0027s very insecure about a pink splotch on one of her wings, where she once spilled rosehip tea and just couldn\u0027t get the stain out. Often wears pink to detract attention, though few ever see her anyway."},{"name":"Unambra","genderRaceOccupation":"Female Dryad Songstress","description":" A winter dryad with spiky pine needles along her arms and legs, Unambra hibernates for most of the year, awakening with the coming of winter. Her haunting, beautiful voice sings praise to the cold desolation of snowy nights. Unambra\u0027s lot is a lonely one, but she takes great pride in it. Is very sympathetic to respectful travelers, and locals know to leave an offering at the base of the tree in which she resides, in exchange for protection."},{"name":"Averlant","genderRaceOccupation":"Female Satyr Wandering Poet","description":" Averlant wanders many planes, seeking to meet new folk, local or otherwise. When she comes upon beings she has not met before, she is keen to learn all about them, asking many questions. She will eventually craft a clerihew - a short, witty , biographical poem - about each person. These poems often poke fun at the person, or reveal that she knows far more about them than she has been told. Sometimes they will reveal secrets even the subject of the poem does not know. Averlant is delighted by aptonyms - people whose names are accidentally appropriate eg a Butcher named Bacon - and will bestow special gifts on people bearing one. She will often seek out such people as subjects for her poetry."},{"name":"Whirliswiz Brasshopper","genderRaceOccupation":"Male Pixie Tinker","description":" Most pixies seem content to rely on their magic and nature and general mysticism to solve their problems. Whirliswiz has some choice words for those pixies. After a run-in with a band of dwarves, Whirli realized that pixies are the perfect size to do the kind of intricate craftsmanship and tinkering that even the elves struggle with. He set to work right away on designing and creating tiny knobs and gears, most of which don\u0027t actually have uses yet, that he knew only he could create."},{"name":"Cazria Glimmerleaf","genderRaceOccupation":"Female Nymph Fighter","description":" If the tales around the tavern hearth are to be believed, nymphs come in two varieties: demure nature guardians who care for every tree and bunny or alluring spirits of animalistic hunger and lust. Cazria particularly enjoys mutilating the people who think she\u0027s the latter. Rather than share the blessings of nature or any of that hooey, Cazria believes that nature is a thing that must be protected from all those who would defile it. Unfortunately for anyone who happens upon her, Cazria\u0027s idea of \"defiling\" includes anything that walks on two legs beside herself setting foot in her forest."},{"name":"They Provide the Paint for the Picture Perfect Masterpiece Which You Paint on the Inside of Your Eyelids AKA \u0027Paint\u0027","genderRaceOccupation":"Male ? Revolutionary","description":" Paint is a fae who has taken a strong interest in people. Specifically the downtrodden and the meek. He visits them in the form of a traveling teacher, and after learning of their problems gives them what they wish for to change their position in life. Be it wealth or strength or magic. He then leaves them to decide how best to use their gift, but returns after an indeterminate period of time, and judges their actions. If he believes they have truly become what they desired to be he leaves them as they are, but if they have not achieved their wishes he strikes them down."},{"name":"Möberon","genderRaceOccupation":"Male Eladrin Mathematician","description":" A slim and elegant individual with silver hair and wiry glasses, Möberon is often found hunched over his desk, deep in study and research. His adopted son, whom he fought tooth and nail to keep custody of after the divorce, is often playing with other Eladrin children on his front lawn. Möberon has many connections in his field, and is somewhat of a nexus of communication and collaboration among the mathematically minded. His colleagues often refer to him as \"The King of Numbers\". He loves to discuss his research and teach others the wonders of mathematics. Other topics tend to be of less interest to him, unless they pertain to someone he knows well."},{"name":"NEIFON THE KNOWLEDGEABLE, of the Court of Stars","genderRaceOccupation":"Male Archfey Librarian","description":" Neifon is a large rotund owlish fey being who protects the incarnation of the Tree of Knowledge in the Feywild, which acts something like a giant library. He is extremely loud, rambunctious and enthusiastic, and happy to lend out books and scripts to worthy seekers, as long as they promise to bring them. Those who don\u0027t return them usually get chased down by owlbears or mortal agents in the Material plane."},{"name":"Beedle Finfeather","genderRaceOccupation":"Male Sprite Prankster","description":" Beedle is a small fey, barely 6 inches tall who has something of a lust for gold following adventures in the material plane. He has pale skin with dark hair, black feathery wings, a light needle of bone for a weapon, and a sack he often tries to fill with the coin of any traveller he believes he can pickpocket."},{"name":"Evelorn the Alpha-Birch","genderRaceOccupation":"Female Dryad Bully","description":" Beautiful and haughty, Evelorn is a rather sociable pale skinned red haired dryad within a large forest of birch trees, who through gossip and blackmail, has come to manipulate and call favours from most of the other minor fey and woodland beings. She uses this power largely to bully and humiliate travellers in her forest, turning them around, pulling them back, and simply trying to prove the forests dominance over them as she fancies herself a minor ruler. In truth she is far too weak and cowardly to accomplish much, but her trove of secrets and connections woven over the centuries has value that reaches beyond her glades."},{"name":"Huntmaster Earl","genderRaceOccupation":"Male Archfey","description":" Forgoing the gaudy trappings of his peers, Huntmaster Earl wears simple arms and armor that slightly accentuate his considerable power. Riding at the head of the Wild Hunt, The Huntmaster takes delight in every second of his dangerous pursuits, for his existence derives off living along the edge where bravery meets recklessness. Sources cannot agree on his motives or his actions. His goals are his own, but if one were to bargain with the Archfey they best appeal to his competitive and eager nature. By no means does that mean he is easy to fool, as he has the instinct of an apex predator."},{"name":"Flaherty","genderRaceOccupation":"Male Dryad Minor Noble","description":" A minor noble in the Seelie Court and the brother of Jirvel. He leads a live of luxury in the giant oak in the middle of the glade he calls his domain. This glade is about one acre in size and can only be reached during the twilight hours before dusk and left during the twilight hours after dawn. If somebody gets trapped in the glade by not leaving before sunrise, he offers to let them stay the day in his oak, in exchange for a small favour in the future. If the person agrees this is a binding magical contract that can only be lifted by both parties agreeing to lift it. Other fey generally recognise his claim on the glade and the minor fey living in it adress him as Lord of the Glade and pay tribute to him in the form of minor gifts, which allows him to live his livestlye. In return he takes his promise to protect the glade and all that live in it very seriously. The only thing that means more to Flaherty then the glade and it\u0027s inhabitants is his younger sister Jirvel. She is his shining star, his rising sun, his scarlet poppy, something he is very eager to everybody that would listen. He has in fact been spending the last few years looking for a fitting husband, but in his eyes nobody is good enough for his darling sister. You can imagine his suprise when his sister returned from one of her trips in the company of a 1000 years old oak that one of her druid friends had cast awaken on and declared him her fiance. Flaherty, at first reluctant, has by now warmed up to the idea and has been busy with the preparations for the wedding. He has spared no expenses and even called in a lot of favours for this occasion, nothing is too good his sisters wedding. Because of this the wedding will be the most lavish and extravagant thing the forrest has ever seen (flowers from all over the world both as decoration and food for the smaller fey, will-o-wisps captured and stuffed into lantern that float through the air, a satyr band, a fountain of the best wine), and there will be a lot of different guests that traveled from long and far to attend the wedding. (Not only fey, but hags, human nobles, gnomish sages, sentient animals, even some elementals and minor celestials, but anybody is welcome really) If the players arive at the glave it is actually the night of the wedding and they can see the lights and hear the music from anywhere on the glade. Secrets: The giant oak he lives in is actually his bound tree and not only that but it is actually a treant that he merged with centuries ago. They share one mind and if somebody or something threatens the glade the two will merge and the oak will rise and defend it. While merged the two count as one creature, use the Treant statblock, but with a dryads metal stats, skills, innate spellcasting and magic resistance. During the wedding of his sister Flaherty is actually unable to decline any one favour asked of him by one of the guests, provided they brought a present for the bride. This fact is not a secret, but Flaherty doesn\u0027t share it willingly with anybody uninitiated. The players might learn of this from one of the other guests, including Jirvel. There is a bit more to his love for his sister then he would ever be willing to puplicly admit. He knows that this is wrong and it gnaws on his mind. He is hoping that once his sister is married he will be able to forget about these feeling, an empty hope."},{"name":"Jirvel","genderRaceOccupation":"Female Dryad Minor Noble","description":" The Bride. Sister of Flaherty. While technically a noble of the Seelie Court, she is not yet seen as a proper member since she hasn\u0027t bounded yet. This fact means that she is still mortal, still ages, still bleeds, something she wants to change as soon as possible. She knew that her brother could never decide on a husband for her, so she decided to take things into her own hands. She has been using her influence over the forrests animals to search for a fitting husband. While she doesn\u0027t have a strong realm like her brother has the fact that she is not yet bonded means she is free to go whereever she pleases and as a result of that her net of favours, while not as strong actually extends even far outside the boundary of their native forrest. Her favorite tools are the birds, because they are the most free of creatures. This is how she learned about an ancient oak, many days travel outside her brothers sphere of influence. An oak so old that nobody she questioned could actually tell her how long it had been around. So she went to Freija, a young female human druid from the nearby village. And they went to seek out this oak and when they found it Freija awakened the old tree. After Freija cast her spell, the tree slowly started to stir and rise, look around, then take notice of the tiny creatures in front of him that had just given him sentience. When asked what his name was, he pondered for what Jirvel experienced to be an excrutiatingly annoying amount of time until finally telling them his name: Greagoir It took forever to get the slow giant back to the glade, especially since the daft fool would allways stop and look onto the most mundane things with amazement. When they finally arived at the glade she imediatly told her brother that she planned to marry the tree. He was at first against it, like she knew he would be, but she also knew that in the end he wouldn\u0027t deny her any request. Especially since he knows just how valuable a catch her husband was. And now only the wedding itself stands between her and finally bonding with her husband and becomming a fully fledged and very powerfull dryad. Secrets: Look at Freija\u0027s NPC block to find out the story of the two. Jirvel is actually very aware of the true nature of her brothers feeling for her. She doesn\u0027t feel the same in any way, she in fact despises him, for beeing so much older and more influential. In her mind, she should have been the one born first and the glade should have been hers. But she knows how to hide her feelings and knows how to use Flaherty\u0027s feeling to her advantage. Right now her brother is the most powerfull ally she has, but this might change soon. Her true ambitions are to be much more powerfull then her brother, to become to him as overpowering a presence as he had been to her all these years. She aims to shed the shackles of beeing only a \"minor\" noble, she would become a proper one, somebody that at the mere metion of her name would make all the other fey tremble both in awe and fear at the same time. Her brother might be content with beeing the Lord of the Glade, but she would be the Lady of the whole forrest. The Lady of the Woods, only that would be a proper titel for her. And this marriage is the next big step in achieving this goal."},{"name":"Freija","genderRaceOccupation":"Female Human Druid","description":" (I originally had this as part of Jirvel, but it really disrupted the flow of the narative, so I put it here because it is still important for the personality of Jirvel) If you asked Freija what the relationship between the two of them was, she would tell you that Jirvel was something like her fairy godmotherto her. If you asked Jirvel, she would tell you that she owns the girl. A few years back, when Freija was still a young girl learning the druidic ways from their village elder, she fell in love with a local boy called Myca. But Myca was older, his father was the local butcher, so he was quite well of. No way he would fall for the weird local tree girl. But then like in the fairy tails, a beautiful woman apeared to her in the woods and offered her. She knew so much, about how she was in love, how she could get closer to Myca, what to talk with him about to get him to like her. And with her help she managed to win the love of her live. She is now married to Myca, she is the local druid after the elder died and he is a hunter. They have a little daughter aged 3 and a little boy aged 1. She is very gratefull to her fairy godmother and would do anything for her. Jirvel first learned of the girl from one of her spies, the foolish child had actually been talking to the birds about her feelings. She had first gone to her village on a whim, feeling bored she had toyed with the idea of breaking the girls dreams, maybe take the boy away if he was really as handsome as the girl was saying. But when she laid eyes upon the girl she imediatley felt the potential she had to become a powerfull druid, and she had actually allready even found a mentor to guide her. So she made a plan, to take control over this girl, to aquire her while she was still young and dumb and easy to influence. First she charmed the boy, he wasn\u0027t really good looking, more like handsome but in a very common way. And once she had the boy devoted to her (an easy task, he was a teenage boy after all), she told him that if wanted to continue their relationship he would have to court this girl for her. She then went to the girl, told her what to do, what to say. In truth nothing the girl could have said, would have stopped the boy, she could have been a pig and he still would have done as Jirvel told him. And so the years passed and the girls power grew, when the girls mentor started to slow down her growth she got rid of him, and the girl grew to be much more powerfull then he had ever been. The boy grew too, when he was told to marry her he did so, when he was told to give her a child he did so, and every time he went out to hunt he would come to seek her out. She had no real desire to be with the boy, but she enjoyed the thought of his wife at home, with her children waiting for her beloved husband to return, while we lay with her amoung the leaves. The girls whole life, dancing as a pawn in the palm of her hand. And now that the girl had fullfilled her purpose she was still a powerfull pawn, but a disposable one. Jirvel very much looks forward to one day telling the girl everything and seeing her whole world crumble."},{"name":"PLEASE ADHERE TO THE FORMAT","genderRaceOccupation":"The History of the Nobles","description":" Welcome to the 1st event of the Academia Month: 10k Professors. For this event, let\u0027s brainstorming up 10k NPCs who are all professors. This collective list can include professors of any discipline! This list can then become a tool for any DM who needs a professor to just reach into and pull a fun one out. Perhaps, this will even inspire some interesting campaign ideas. There are currently 57,863 people on this subreddit. It should be fairly easy for us to get over 10,000 NPCs."},{"name":"Redna Shortwit","genderRaceOccupation":"Etiquette and Social Graces for Young Noble Women","description":" She is stout, dowdy, only about five feet tall, but projects a grand and stately image. She is strictly proper. A modest and prudent puritan, and obstinate in her expectation of the same from her students. She professes a reverence for the patriarchal hierarchy and for the domestic position of women in the Kingdom of Prideline, she has been a leader in the education of hundreds of proper young women and, in the eyes of the Crown, has helped to embolden the stability of the status quo. The truth is that Professor Shortwit has for decades been the architect of an uprising. An army of fearless empowered young women in waiting, courageous and ready at a moments notice to execute a coup upon the King."},{"name":"Erilar","genderRaceOccupation":"Headmistress, former Chair of Extraplanar Studies","description":" Erilar is a Tiefling sorcerer who devoted her life to studying the Great Old Ones. Unfortunately, they\u0027ve taken no notice of her - in a better world, she\u0027d be a warlock. Surprisingly, however, she is a genuinely good person. She believes that it is the duty of magic-users to improve the world around them and help others. How she imagines the Great Old Ones could possibly be part of this is anyone\u0027s guess."},{"name":"Godmund","genderRaceOccupation":"Vice-head of the University","description":" Godmund is a male human warlock. He wants quiet order. Nothing elaborate, just everything to work the way it should. He will gladly hand off tasks to someone else if that means he can handle more important things. He is an overweight, slightly balding man who wears a look of general frustration all the time. His robes are disheveled and generally in disarray, and he tends to look like he’s not had time to get dressed. His complexion is generally blotchy and red. He, too, is interested in the Great Old Ones, much to Erilar\u0027s frustration."},{"name":"Lota Riverbend","genderRaceOccupation":"Abjuration Studies (and dabbles in Conjuration)","description":" Lota is a female halfling, and is mainly motivated to prove herself. She takes mistakes very seriously, and will be much harder on herself than on others. Lota isn’t humorless, as she often feels the need to point out. She tells people that she likes to have fun, but no one has seen evidence of this. She needs to assert her power and her superiority, possibly because of being a Halfling. This strikes many people as odd, as Halflings are often very comfortable in who they are."},{"name":"Fingali","genderRaceOccupation":"Grimoierery and Spellbook Theory","description":" Fingali is a male human wizard who specializes in the construction and theory of spellbooks and grimoires. He\u0027s well-versed in bookbinding, calligraphy, and runic arts, and is constantly making and re-making his own spellbook to make it \"The best it\u0027s ever been.\" He has a very fine collection of old spellbooks. When - gods forbid - a fellow professor passes away, he has a very hard time holding back his urge to ransack the dead person\u0027s room. He has one book in his collection that he never shows anyone - the Black Grimoire of the Necromancer Tsyesende. It was thought lost, and he fears for his life if anyone should find out he has it. He is meticulous and detail-oriented, and has very little patience with sloppiness. Once his interest is piqued, however, he is unshakable."},{"name":"John Quimbly","genderRaceOccupation":"Professor of Runic Language","description":" John Quimbly is a human male, who due to his surprisingly short stature is often mistaken for a gnome. He has brown hair and a short busy beard and looks fairly young despite his receding hairline. Professor Quimbly is an expert in runic languages, having published various books on decoding them. Unfortunately for his students, sometimes, the professor swaps into the runic languages, in moments of excitement, forgetting that he is teaching about them, not discussing them with someone of his own expertise."},{"name":"Yagnar Orearm","genderRaceOccupation":"Professor of Metallurgy","description":" Yagnar Orearm is a Dwarf, very proud of being so, who teaches the science of metals: their properties, production, and purification in the Institute of Military Sciences in East Ravenheart. The Dwarf, grumpy and strict in nature, requires the absolute best from his students and accepts nothing but excellence on his examinations and practicum. However, many students report that outside of class, the dwarf makes a great advisor, for life and drink, and is an incredible arm wrestler. Once per term, the dwarf gives any student the chance to defeat him in an arm wrestling match in exchange for perfect marks on an examination. No student has ever conquered this challenge yet."},{"name":"Wingle Grimblesnout","genderRaceOccupation":"Professor of Olfaction","description":" Professor Grimblesnout could easily be mistaken for a dwarf or a gnome simply due to his incredibly small stature, and the fact that he is so bent over that his head is level with his chest. Having been in a family of alchymists he was introduced to the craft at a young age. He always had an impeccable sense of smell, and no one quite knew why. The reason behind this is that he was infected with Lycantrhpy Rota when he was a child. In the laymans terms, he is a rat lycan. Grimblesnout has quite the passion for smell. making sure that his students know the importance of knowing every regent in your laboratory by smell, he really revels in particular odours, some of them delightful, some of them less so. He is especially fascinated by powerful smells, whether it is the delightful aroma of an effervescent love potion. Or the overbowering stench of a troglodyte. Smells just fascinate him. He tends to forget that having Troglodyte extract shoved up your nose, doesn\u0027t really excite the students as much as it excites himself, and of course anyone lucky enough to be out of noseshot. Don\u0027t ask him what Olfaction is. In his eyes, the science of smell, is the groundwork to every other important science."},{"name":"Ved Sharpsnout","genderRaceOccupation":"Chair and founder of the Dept. of \"Traps and Other things Relating to Them,\" former Prof. of \"Home Defense Through Any Means\"","description":" None but the headmistress know how a lowly kobold managed to secure a position as a professor at the university, but here he stands, nonetheless. Ved is rather tall for a kobold, standing just over 3 feet in height, and is quite excitable. It is clear to any who take his classes that the kobold is passionate about his field, and from the testimony of those who have taken any of the scaly professor\u0027s classes, Ved is a surprisingly enjoyable teacher, who is genuinely invested in his students\u0027 works. While he isn\u0027t the most intelligent person in the world, he makes up for it with immense creativity and unwavering determination. Still, creativity and determination alone doesn\u0027t prevent the poor kobold from becoming the unfortunate victim of nearly all of the jerry-rigged traps he shows as an example to the class. Ved, along with a small following of his former students, were able to found a new department (which Ved personally named and is immensely proud of), with the headmistress\u0027s approval, in order to better inform future adventurers and dungeon-crafters alike about the intricacies of trap design."},{"name":"Cardon Coldsorrow","genderRaceOccupation":"The Scriptures of Jundard of the Sun","description":" Coldsorrow is half-orc Cleric of Jundard, a minor sun god with a small monastic community. The library is mainly full of scriptures collected from the few prophets the religion has gathered over the years, and it is Coldsorrow\u0027s dream to be able to compile them into a proper holy book. Until then, he seeks out visionaries and converts, and writes down every decision the head of his order makes, all in a hope of finding a unified dogma. He\u0027s unusually short for a Half-Orc, but solid, and his usually cheerful demeanor fades when he drinks. Before taking up the Clergy, he was a soldier in a failed war."},{"name":"Raxton Dafner","genderRaceOccupation":"Professor of the Barbaric Arts","description":" Raxton is a Dwarf with an extraordinarily short temper, this has lead him into the Barbarian class where he has learned to control and manipulate his rage. Raxton is a mature balding Dwarf who has no time for messing around, when you are in his class he expects complete attention. Very often in his class you will be taken on \"field trips\" into the surrounding area where Raxton is known to rage and demonstrate his abilities to the class."},{"name":"Terrence Fitterleigh","genderRaceOccupation":"Tenured Professor of Illusory Menageries","description":" For many years Terrence\u0027s lanky frame slumped behind a pulpit, shoulders sagging, eyelids drooping. He had been proclaimed a wunderkind in his field of illusion decades earlier, achieving in years what renowned elven wizards take decades to accomplish. It was only when he rediscovered his childhood dream of interacting with great, exotic beasts- and found he could, in his own way, bring them to life- that his love for his work was rekindled. He\u0027s currently attempting to create a complete set of parchment cards that will allow the animals to interact with each other- although once he\u0027s completed it, who knows what he\u0027ll do with it, and the tedium of academia will no doubt come crawling into his life again. I recently reread /u/LiberatedCapsicum \u0027s post on Magic the Cardening and I\u0027m looking for a way to squeeze it into my next campaign from the get-go. This seemed like a good fit!"},{"name":"Cormik Lash","genderRaceOccupation":"Actionable Artifice for the Active Adventurer","description":" Cormik is short even by rock gnome standards, reaching only 3 feet tall. However, he compensates for his short stature by standing and pacing on his paper strewn desk during lecture. Students have a hard time taking him seriously in his oil-stained trench coat, threadbare top hat, and obscenely unkempt handlebar mustache."},{"name":"Reese Wizardspoon aka Mr. Universe","genderRaceOccupation":"Greater Illusory Theory; Opening your Mind\u0027s Eye","description":" Reese is a rather young and out of place professor thrust into the spotlight by his elaborate illusions performed on the streets. His recent addition to the college does not sit well with many of the tenured professors who see him as a goth-dressed charlatan with the nonchalance of a spoiled brat. He is, in fact, all of those things."},{"name":"Osborn Goodbarrel","genderRaceOccupation":"History and Culture of Halfling Society","description":" For many years, Professor Goodbarrel taught the young Halflings in his burrow. However, many of his students have left the burrow to travel the world - the latest trend amongst adolescent Halflings. At the moment, Professor Goodbarrel enjoys teaching the few remaing youngsters, but he has considered going on a journey himself, to see what all the fuss is about."},{"name":"Faelen Leororis","genderRaceOccupation":"Former Professor of Poetic Studies, currently Head of the Drama Club","description":" Faelen Leororis taught poetry for many decades, and even though she was notorious for her high demands, her courses were actually quite popular. Her current project is the adaptation of a great Elven epic into a theater performance."},{"name":"Jofrit Windshield","genderRaceOccupation":"Social Studies and Philosophy","description":" Anyone who strays too close to \u0027Professor\u0027 Windshield\u0027s regular table at the \"Drunk Skunk\" will be immediately enter his \"School of Hard Knocks\". Here, he imparts on his more or less willing students the lessons he learned during his life. Students who are willing to give this perpetually drunken Dwarf a secod chance may, however, learn something more profound than they had expected."},{"name":"Samuel Sodder","genderRaceOccupation":"Professor of Magical Herbology","description":" A hulking man who footsteps crash through the halls Samuel inspires fear in his students. This firebolg stands near 8 feet tall and usually carries with him at least one book for either pleasure reading, research, or class. New students fear him until they take his class however, then they understand he is a soft spoken, kindly individual. He understands that not all students have vast interest in the world of magical plants and their many beneficial properties but he never the less expects his students to try. His office equally suited for him. No desk, just several large bookshelves, a fire place and several squashy armchairs. Students who choose to come to his office hours can expect to be stuck in a lengthy chat for upwards of an hour for a simple question. His passion and appreciation for his subject is endless and he hopes to instill that in his students. As a result his students tend to try harder in his class, less out of interest in the class but more out of appreciation for the professor."},{"name":"Ortyn Lutraine","genderRaceOccupation":"Urban Demography: Race Relations in Novo Kharkus","description":" Skyrocketing to academic fame with his recent treatise on the use of human negotiators in tackling Dwarven gang wars, Ortyn Lutraine is the poster child of Altus University\u0027s Sociology Department. The young human is as often found sitting in on council meetings to advise on civil unrest issues as he is charming students in his lecture theatre: his foppish mop of brown hair, dazzling grin and red velvet waistcoat seem tailored to the latter, however. Flamboyant appearance aside, the Professor is an inspiring man, delivering impassioned speeches fluently in any of the five languages of Novo Kharkus. If anyone were to meticulously trace the sacks of gold allocated to Lutraine\u0027s field work, however, they would find substantial amounts in the hands of Dwarven militants and High Elven supremacists alike. Having stepped into the scholastic spotlight and enjoyed the perks it brings, Lutraine is remaining relevant for years to come..."},{"name":"Verisimilitude Merkins","genderRaceOccupation":"Professor of the Illusionary Arts","description":" A handsome middle-aged male Tiefling who is a hit with most of the students and faculty. He is rumored to have crossed certain student-teacher boundaries more than a few times. Alumni of the schools he has taught at tend to develop arguments about what he looks like."},{"name":"Brinto","genderRaceOccupation":"Professor of Irritatingly Repetitive Melodies That Get Stuck In Your Head For Days And Just As you\u0027ve Forgotten About Them Someone Walks Past You Humming Them","description":" A balding, blonde, half-elf who is always under-dressed. Professor (\"Please, just Brinto\") Brinto is clearly something of an outsider to the faculty. He spends most of his time under the largest tree upon campus absentmindedly strumming his 9-string Lute. He never teaches formal classes, preferring instead to spend his time in one on one sessions with students he has dubbed \u0027visionaries\u0027. Murmurings amount the faculty suggest he was expelled from several bardic colleges and only retains a position at his current location because he holds knowledge over the Arch-Chancellor."},{"name":"Ruklau the Knobbed","genderRaceOccupation":"Experimental transmutation magic","description":" Short, ugly, misshapen fellow who looks a bit like a goblin crossed with a warthog crossed with a dirty leather knapsack. A tuft of black feathers juts out of his left eyebrow, and his right hand is a gnarled, arthritic claw. Despite his appearance, he is well-spoken and very articulate, and it\u0027s difficult to tell what his original race was. He doesn\u0027t seem the least bit concerned about his looks, and is certainly capable of changing his form, but no one knows why he chooses to look the way he does. He\u0027s always surrounded by the scent of aromatic pipesmoke, and particularly enjoys when the university chef prepares mutton stew."},{"name":"Rosaline DeVoute","genderRaceOccupation":"Woodworking and Survival Skills","description":" Rosaline is a tall and fragile woman. Standing at 6\u00273 she is very quick and nimble on her feet. Long white hair flows and borders her small fragile face. While she gives the cold shoulder to most, her students know her as a kind and gentle soul. She wishes only the best for her students and wants everyone to learn basic survival. While she loves the outdoors, nothing can be out of place."},{"name":"Avyer Thornen","genderRaceOccupation":"Royal Etiquette and Duties","description":" Avyer is an extremely proper (to the point of appearing snobbish) elf. This is largely due to his responsibility: Avyer has been the private tutor for more than a dozen generations of young human princes and princesses. Though he is mostly out of the picture by the time a ruler comes of age, Avyer is quite possibly the most powerful elf in the human kingdoms, and is always well regarded by his former pupils."},{"name":"Prestor Brine","genderRaceOccupation":"Non-mundane Animal Husbandry","description":" This professor is short-of-stature, with large gesticulations when recounting one of their countless stories on the field. Though they come across as blunt or loud to others, there is a quiet calmness when interacting with magical beasts. On both accounts, they are quick to attend to any action that subtle, passive aggressive, or \"raises flags\"."},{"name":"Milton Treadmoor","genderRaceOccupation":"Magic in Cosmetology: Skills, Theory, and Ethics","description":" This tenured elven professor has made a name for himself both in academia and business. No one is just quite sure how much of his work goes into his own flawless appearance, but many pranks of Dispel Magic have not yet revealed the answer. Despite the foppish demeanor, he is utterly serious about his work and refuses to teach anyone less dedicated. There are rumors that he wants to establish his own dedicated beautician school."},{"name":"Frida Darringer","genderRaceOccupation":"TA, Primordial 101","description":" She is a gifted tiefling with a fear of public speaking. Not that she is in public much; she tends to be deep in research or doing work for colleagues she was too meek enough to refuse. Her favorite activity is talking at length to students about shared interests."},{"name":"Hamish","genderRaceOccupation":"ninja edit","description":" An aged human with fading white hair and a tranquil presence. He is not a conventional professor, certainly not by trade. The most detailed of his past is that of a retired adventurer\u0027s, who ended a bout of globetrotting at the University he now resides in. Though he never speaks of his adventuring days, whatever he experienced doubtlessly impacted the man\u0027s mission to help the mentally-affected. It is also thought to have impacted his own sanity as well..."},{"name":"Hermann Kremmler","genderRaceOccupation":"Dean of Arcanarcheology","description":" Kremmler is an old human man with a bent back and thinning grey hair, fond of wearing patterned skullcaps to cover his head. He is ornery and grumpy at the best of times, but he is also one of the leading experts on magical items from previous civilizations. In spite of his advanced age, his general style of teaching is to bring students along to ruins and dungeons and lecture in between traps being sprung and skeletons coming to life. Some have accused him of using his students as expendable fodder so he can make more discoveries, but his fellow staff are willing to overlook any \"accidental\" deaths so long as his discoveries bring the university acclaim and funding."},{"name":"Johan Alkenstav","genderRaceOccupation":"Professor of Religious Artifacts","description":" A musclebound human man who would honestly look more at home in a gladiatorial pit than a classroom, Alkenstav\u0027s gregarious attitude draws in students from all over the university. He works closely with the local clergy to identify magical items of a divine origin and is remarkably open-minded in terms of religion, even collaborating with followers of faiths looked down upon in the city. This has caused him no end of trouble, but a combination of tenure and an odd friendship with Hermann Kremmler have kept him employed and teaching."},{"name":"Alienor Serre","genderRaceOccupation":"Visiting Professor of Underdark Botany and Medicine","description":" Serre is an elven woman visiting from one of the forest enclaves. She keeps her platinum blonde hair pulled back into a ponytail, her face set in a polite but cold expression. She doesn\u0027t speak much of her time back in the enclaves, but many suspect that she was a slave that escaped the drow before she became a visiting professor at the university. Those who believe this theory point to her area of expertise and how much she knows of the medicinal properties of the various fungi and lichens endemic to the Underdark. Serre remains silent on the subject."},{"name":"Instructor Aamin Marritza","genderRaceOccupation":"Proper Filing Systems and Book Keeping in the Military","description":" Marritza is a grey scaled Yuan-Ti Mallison (Type 1) who served in the military as a filing clerk. He was regarded as a superb military employee and his filing system was considered a masterpiece of meticulous exactitude. In all his years he never lost a single file and was offered a post at the military academy as an instructor to teach filing. He is very punctual, very thorough and very, very orderly. A single pencil out of place is almost insulting to him, a messy desk almost incorrigibly barbaric. Beyond that he is a very patriotic but also very moral man with no taste for torture, senseless killing and cruelty of any kind. In private he has uttered misgivings about past conflicts and the war crimes commited during those. His current location is unknown."},{"name":"Merrik Thicktail","genderRaceOccupation":"Taxonomy and Gastronomy of Swamp Creatures, Great and Small","description":" Merrik is of average height, but his course of study and eating habits keep him as close to obese and any lizardfolk can be. The course (known to students as \"T and G\") is a field study of fauna of a local swamp where Merrik and students learn to classify several species of creatures ranging from dragonflies to alligators and learn preparation techniques for several \u0027cultural delicacies\u0027 of the lizardfolk tribe that inhabits the swamp. Field gear and anti-acids recommended and additional fees may be charged for spices."},{"name":"Rogo Morihei","genderRaceOccupation":"Philosophy \u0026 Martial Wisdom","description":" Morihei is an aged male Dragonborn with narrow eyes and faded silver scales. He wears a long, stiff beard and loose, simply adorned robes. His bushy whiskers extend low, blending seamlessly with his white beard. \"The Way of the Warrior has been misunderstood. It is not a means to kill and destroy others. Those who seek to compete and better one another are making a terrible mistake. To smash, injure, or destroy is the worst thing Dragonkind can do. The real Way of a Warrior is to prevent such slaughter - it is the Art of Peace, the power of love.\""},{"name":"Quintus Epicurus","genderRaceOccupation":"Arch-Mage of The Geddaye Order, and Professor of Advanced Classified Arcana","description":" Arch-Mage Quintus is an innocuous looking human man of about 60 years. He wears the same indigo robes and enormously wide brimmed black hat everyday. He allows them to grow dingier with each passing day, despite having the ability to simply prestidigitate them into perfect condition with the snap of his fingers. Being too busy for even that, Quintus has a multitude of better ways to spend his time and he keeps track of all of them in his head. Well .... almost all of them. He often forgets about his \"Classified Arcana\" class when his attention is on important research. In fact, he only shows up to about a third of the classes, much to the chagrin of his peers in the College of Geddaye. He is supremely gifted in his intuition of Arcane arts, having mastered all 5 schools in only 30 years of study. There are whispers amongst the senior members that Quintus should be removed from the post of Arch-Mage in favor of someone with more... experience. After all, Quintus is the first Human to run the Geddaye in a millennia."},{"name":"Evelyn Nate","genderRaceOccupation":"Conjuration and Infernal Studies","description":" Professor Nate appears as a stern woman, wih sharp features that seem just on the cusp of middle age. She is known as a harsh but fair teacher, and anyone who gets top marks in her class is considered a rising star at the school. While she doesn\u0027t appear particularly old, the school records indicate she taught many famous wizards who are well into their old age, or even dead many years. Her seemingly wternal youth is the source of much speculation among students, ranging from an infernal pact, to being a pit fiend disguised as a mortal woman."},{"name":"Philister Carnival","genderRaceOccupation":"Artifact crafting","description":" Well known to academia as a master of his craft, he is also well known among his local peers as \"The Childish Professor\". While his perpetual enthusiasm is on first meeting intoxicating, his often meandering trains of thought, unrestrained manners and know-it-all arrogance can become tiresome if no-one is there to keep him in check. While many can criticize his person, nobody can deny that it is his odd imagination that has allowed him to make many advances in the field of magical items. Most of his students just study from the textbook."},{"name":"Grace Akita","genderRaceOccupation":"Tea-making","description":" While her course is often joked to be \"caveman\u0027s potion-maker\", the art of making tea is one that teaches less of the substances that are produced and more of simple meditation. Nobody has ever heard her raise her voice louder than necessary, and she is known for having the patience of a statue. Her lessons often stick with her students and show through in other fields such as advanced magika, fine arts and politics. When she is not teaching, she can be found meditating in her classroom with a hot kettle nearby for anyone who wishes to join her."},{"name":"Elyseus Longgrass","genderRaceOccupation":"are","description":" In all of the courses he teaches, he is praised by the students for his performence capabilities, and for the ability to explain difficult things in simple terms. He is rumored to work on some crazy idea -- something about shooting himself on the moon in giant firework rocket. It\u0027s probably fake news though..."},{"name":"Valentin Beaulieu","genderRaceOccupation":"Dean of the Department of Enchantment and Charms","description":" Professor Beaulieu is a charismatic dreamboat. A very charismatic dreamboat. It seems he is friends with everyone: students, faculty and beyond. Seen from the outside, the devotion he inspires actually seems a bit creepy and might lead one to suspect him of using his powers for evil. In actuality Valentin is just a really nice person to be around. He isn\u0027t even that good an enchanter, but have gotten promoted again and again, due to how much the head of the university likes him. He doesn\u0027t think he deserves the position, but he doesn\u0027t want to embarrass his friend, so he just does his best. Though, at least the students love him, and his underlings do their best to cover for their beloved dean."},{"name":"Tryskin Bridgetpants","genderRaceOccupation":"Professor of Applied Life Sciences and Regeneration","description":" Professor Tryskin is an energetic gnome with a short stature, an impressive moustache and an eternal love for his field. If you get him talking, you\u0027ll be hard pressed to get him to stop talking, as he wanders from subject to subject to off-kilter tangent. It is a moderately well kept secret that Tryskin is working on a cloning program to allow certain individuals of wealth and power to survive in a new body, if they should suffer an accident with their old one. It is a secret known only to the clone masquerading as Tryskin that the real Tryskin has been on vacation for the past seven months. The clone is getting worried, since Tryskin really should have been back by now."},{"name":"Crael Dusken","genderRaceOccupation":"Professor of Heraldry","description":" An unassuming, mousy woman with long blond hair, Crael loves the study of Heraldry and the study of noble lineages. She hates students. She hates people asking her questions. If everyone would just leave her alone to her studies everyone would be much better off. Her colleagues have taken to borrow scrolls and books from her extensive collection to answer questions for inquiring souls, rather than subject them to her acerbic personality."},{"name":"Durkin Trollkiller","genderRaceOccupation":"Professor of Monstrous Metahumans","description":" This stout dwarf with the big bushy black beard has found a new profession after his previous one as a monster hunter. He doesn\u0027t have any particular love for the subject, but he has learned a lot about it by necessity, and has found that the career as a professor is less dangerous than his previous one. He does need to stop filling half his class room time with anecdotes, if he wants to keep the position."},{"name":"Professor Hornsby","genderRaceOccupation":"Professor of Archaeology and Ancient Artifice","description":" Professor Hornsby is a typical dottering academic who loves to dig through ancient ruins to unearth ancient artifacts. He specializes in ancient writing, especially arcane runes, scrolls, and diagrams for lost magical constructs. Although he loves digging through ruins, he is rarely prepared for the dangers of what has since taken up residence, having no adventuring experience. His studies have taught him to cast up to third level spells, but he mostly prepares spells to help in his studies more than in combat, like Gust of Wind to clear sand from a ruined tablet."},{"name":"Kimri Godsblade","genderRaceOccupation":"Dwarven Historian","description":" Descended from a family of faithful Paladins of Moradin, Kimri bucked tradition a bit by becoming a scholar. She still retains some of the faith and training her parents instilled in her, but now she focuses on traveling the world to collect the histories of dwarvenkind from all kinds of isolated villages, from the lowlands to the hills to the swamps, in the hope of piecing together the true origin of her dwarves and publishing it in her magnum opus."},{"name":"Quilton Maxim","genderRaceOccupation":"Professor of Physics","description":" A devout, human professor who spends much of his time on his research and experimenting, however in truth, and it is known to his colleagues, he is a remarkably unremarkable individual. Having short brown hair and glasses while always wearing dull clothing, he has not contributed anything of note to the department or to his students, boring most of his students to death with pointless lectures. He does however, spend much of his time in the canyon near town observing rocks fall."},{"name":"Babus Turalius","genderRaceOccupation":"Professor of Archaeology and Language","description":" An old, renowned Dwarven hero who adventured the lands in his youth, Babus now teaches at Zarditar\u0027s University of Magic. He has long, gray hair that matches his equally long beard, and has a large, muscular figure. He loves to take his students to primary sites of research, such as abandoned ruins or excavation sites, and give them real-hand experience with the subject, something he believes is invaluable. He is known for his quirky, circular glasses that he always wears."},{"name":"Dianne LeMont","genderRaceOccupation":"Professor of Alchemy","description":" Dianne LeMont is an elegant woman from an exotic country. She has a sharp face, platinum blonde hair, and piercing, icy blue eyes. Her specialization is Alchemy, with specific interest in extracting the poison of Arachnids. Because of this fascination, she has a hidden closet dedicated to Spiders, including a full-body latex spider suit..."},{"name":"Captain Onestorm","genderRaceOccupation":"Tactical Training for Battlefield Combat","description":" Battle-worn, scarred and broken, but still as thick as a tree. Longor Onestorm, Captain to his students, The Hammers of Windspire to many songs and scrolls, has never lost his great courage, or his mirthful spirit. Great physical strength borne of a hard-scrabble childhood, the man is broad and tall. Having spent many years at war, he has lost much and yet he is always genial and full of hopeful optimism. Those he prepares for battle take away much more than skill in the art of melee. They learn from Longor the value in seeing each enemy as more than a monster, in imagining him complexly and understanding that his conviction is as great as their own. And, in the end, having the courage still to kill him in service to the cause; this, Longor holds, is true nobility."},{"name":"Kroggar Thindleburn","genderRaceOccupation":"Visiting professor of Survival Among Larger Folk","description":" Kroggar is an odd appearance in civilized society as he is a red kobold and insists on wearing clothing that accentuates his figure and natural beauty as he puts it and while some my find him unappealing there is no disputing he is an expert in his field. He is middle aged for a kobold and often shows disdain towards the larger races while assisting the smaller folk who take his classes. Kroggar treads a close line as he has been brought up to the university board a number times for down marking the taller of the humans and elves that take his class and passing failing shorter students."},{"name":"Zachariah MacRuaidri","genderRaceOccupation":"Professor of Demonology and Abyssal Linguistics","description":" Narrow-build and towering over most of his students and fellow professors, Xanthras is an individual of very few words and even fewer public appearances. When he does interact with others, the albino speaks his mind and with only the bare-bones of syntactical structure to get his point across as quick and simple as possible. When he doesn\u0027t teach his admittedly quite small courses on psyionics, he keeps to the university archives and tends to the tens of thousands of books with almost feverish tenacity and fanatic devotion - often not so subtly threatening painful, sometimes even lethal consequences to any fool who might damage one of the precious scrolls or almanacs. Most of the student body, and quite a few of his colleagues are relieved that he mostly keeps to the library. After all, even to the most seasoned of adventurers and arcanists, an honest to the gods Illithid can and will invoke a feeling of unsettling dread - even if he wears a professor\u0027s robes. With his fiery hair, sunken-in green eyes, pointed nose and lanky stature, Zachariah resembles more a crazed, animated scarecrow than a regular human being, and is known for his snide, with colloquialism and broad accent-riddled remarks and the sheer limitless supply of whiskey he is somehow able to pull from the insides of his coat. It is universally agreed on that the only reason he has not been kicked out of the university yet, is the fact that 1) despite his eccentrism and occasional spouts of jackassery, he is a very dedicated and capable teacher, 2) he possesses vast and intricate knowledge of the Abyss and its inhabitants, no doubt related to the warlock\u0027s fiendish patron, and 3) he proved himself to be absolutely willing to put an accidentally released glabrezu in a headlock if it meant protecting his students."},{"name":"\u0027Art\u0027 Damakos","genderRaceOccupation":"potent","description":" Edit: Some spelling."},{"name":"Bezeldore the Blue","genderRaceOccupation":"Hydromancy and the Finer Aspects of Bathing","description":" A bright-eyed, portly gnome with a welcoming smile and a light blue beard that is dyed regularly to retain its lustre. He is usually dressed in dirty, smeared robes and is always accompanied by an imp named Selimvad who carries Bezeldore\u0027s books. When not lecturing classes at The Starry Wisdom School for the Gifted, he can be found sculpting ice statues, reading a lengthy tome or performing short plays in the city square with his ice constructs."},{"name":"Shanu the Binder","genderRaceOccupation":"Strategic Enchantment and War-scrying","description":" Shanu is a slender dryad with a surprising affinity for studied magic and the nature of war. How she can live so far from her tree is likely beyond anyone\u0027s guess, but her mysterious green robes may have something to do with it — not that she\u0027d give a straight answer if one were to ask. She is usually pleasant when meeting new people, but suffers no fools. She is particularly protective of her students at The Auerbach Circle Institute (\u0027saplings\u0027 as she affectionately refers to them) and will not hesitate to dispatch anyone who appears to be a threat to the school."},{"name":"Lorne Proudstump","genderRaceOccupation":"Herbalism Professor","description":" Dirt on his coat, moss on his hat, and a smile that seldom leaves his face, Professor Proudstump is often a pupils favourite. Small, even for a gnome, he radiates an upbeat energy, genuinely in love with his field of study and eager to pass that love on. He is often seen trying to convince some of the more magically inclined staff to teleport him to other planes, in hopes of getting new and exciting \u0027friends\u0027. He does not abide people treating his plants poorly, and will threaten to prune the fingers of students who do so. It has only happened twice, and its rumored if he snips a third finger, he will be fired."},{"name":"Fonix the Barbarian","genderRaceOccupation":"crash courses on Goliath cuisine","description":" Fonix is a male goliath with deep green piercing eyes, extremely pragmatic, he with zeal tries the best to cook and eat the inedible, he dreams to one day be able cook even the common pebble into a dish worthy of the gods, cries if in the presence of anyone noticeably hungry."},{"name":"Gertrude Rosenburger","genderRaceOccupation":"Spell Pronunciation 101","description":" Gertrude always speaks with perfect enunciation, to the point that it is almost annoying how much she will slow down multi-syllabic words in order to emphasize certain parts. Gertrude is an elf with a very pronounced pair of lips. When she is not speaking actively, they are puckered. She wears a black gown and carries several of what she calls \"dud\" spell components for teaching class."},{"name":"Jarl Goondugg","genderRaceOccupation":"Somatic Components for Basic Spellcasting","description":" Jarl is a decrepit tiefling who wears a series of hats with holes for his curved, black horns. He has light purple skin, and wears a series of decorative bracelets a la Johnny Depp. Jarl is but 3 months away from retirement, and it definitely shows in how much his hands shake. The tremors in his hands (due to his age) have a way of twisting the spells he teaches, much to the dismay of his cautious students."},{"name":"Leowick Hieg","genderRaceOccupation":"Weaving","description":" This grizzled old man sports a beard that gets shorn, like his sheep, twice a year. He is patient and enjoys the company of people, but is slow to trust. He keeps a ledger with records of whom he owes favors to, but does not track the favors he is owed. He teaches courses in animal husbandry, and his pupils learn the skill of making cloth starting from the birth of a lamb. Only the most advanced students are allowed access to the workshop with the looms."},{"name":"Melinda Court","genderRaceOccupation":"Philosophy","description":" Melinda is a tall human woman in her sixties with very dark skin, her graying hair tied back in many small braids, then gathered in a bun. Her wrists clatter with wooden jewelry, and she\u0027s always accompanied by the scent rose perfume. She can be found around campus on sunny days, lounging in the grass with her students as they discuss ethical theory and the nature of truth as equals. In her spare time, she secretly publishes controversial anarchist pamphlets under the pseudonym \u0027A Thoughtful Lady\u0027, where she calls for the end of all social hierarchies."},{"name":"Arelias Verisaren","genderRaceOccupation":"Elven Studies","description":" Arelias is a slight high elf clad in colorful silk scarfs, with long silver hair and brows arched in an expression of wry amusement. He specializes in contemporary northern high elf poetry and the Elvish language, but as his university\u0027s token elf, he has diversified to teach classes on elven history, culture, and religion. With a dry wit and cynical sense of humor, Arelias is popular among his students, less so among his fellow staff. The students he develops close relationships with tend to confide in him, and he knows all manner of secrets. Arelias is married to the dwarven professor of history, Korren Silvervein, and the two can often be seen observing, assisting, and substituting in one another\u0027s classes."},{"name":"Korren Silvervein","genderRaceOccupation":"History","description":" Korren is well-built dwarf under is his tailored suits, his dark hair neatly trimmed, with olive colored eyes that beam benevolently from behind a pair of half-moon spectacles. He teaches the history of several civilizations, particularly that of human and dwarven kingdoms. Korren has a fatherly air, with a patient but serious manner that makes students inclined to please him. More than a few envied historical tomes and artifacts are secreted away in his personal collection. Korren is married to the elven professor of elven studies, Arelias Verisaren, and the two can often be seen observing, assisting, and substituting in one another\u0027s classes."},{"name":"Theda Norwood","genderRaceOccupation":"Physics and Chemistry","description":" One of the few faculty members at her university whose subject does not deal with the arcane, Theda has throughout her career been passionate about the value of learning about the universe(s) through a physical, rather than magical, lens. She is a short, good-natured human woman whose hands are perpetually stained with various chemicals, and she\u0027ll be perfectly willing to talk for hours about the recent scientific advances in the study of motion and the behavior of gases. She\u0027s very easily excited, and loves to learn."},{"name":"Sage Octavia Nymphidia","genderRaceOccupation":"Headmistress, formerly Application of Magical Theory: Advanced Transmutation","description":" A tall, poised, and long-suffering sun elf, Octavia was one of the most stern transmutation professors at Hellenes University. Tardiness is not tolerated except in the case of major injury, malady, or magical mishap. Her exam practicums also had a reputation for being exceedingly difficult. Even as headmistress, she continues to tolerate no shenanigans from students, and only barely from certain faculty members. The root of this sternness is her omnipresent no-nonsense seriousness. Normally this would be intimidating, but Octavia\u0027s possibly subconscious penchant for theatrics makes it quite comical. Not that anybody will say it to her face, of course, but the \"Octavia the Bard\" can be heard in whispers about her from students and faculty alike."},{"name":"Gavin Megarit","genderRaceOccupation":"Herbalism, Alchemy, and creation of useable consumables","description":" He is broad and imposing. Prefers to dress in work clothing and avoids fancy, formal outfits. His classes are fast-paced and students are often challenged to keep up. He is a great teacher for those students who have an inclination for the fields, but has no time or patience for those who have trouble following along. His homework assignments are in-depth to say the least; some former students have claimed to have PTSD from his assignments."},{"name":"Professor Windil Bimbleton","genderRaceOccupation":"Head Researcher Of Positive Energy","description":" An eccentric hafling that stands three and a half feet tall. He is high energy which he always claims is a result of the miracle working properties of positive energy. He has knowledge about the plane, substance, and spiritual nature of positive energy. He can go on for hours about the stuff. If asked he can provide accurate information about negative energy as well but doesn\u0027t seem as passionate about it. He also has a collection of manuscripts he wrote himself on varying subjects all some how tying into positive energy. One of his more unusual beliefs is that positive energy is the substance that makes up souls and therefore is part of the natural procreation cycle of all life."},{"name":"Ermgurd Longbreath","genderRaceOccupation":"Head Researcher Of Negative Energy","description":" Ermgurd is the head researcher of negative energy at the same university as Windil. She is a slightly short half orc woman. She has a heavy fatigued brow and she rarely expresses much emotion. She can answer almost any question about negative energy, undead, the plane of negative energy/shadowfell, or necromancy. She doesn\u0027t talk much and barely holds conversation. She has an odd yet understandable friendship with Windil. They work fairly closely."},{"name":"Melkin Vasnin","genderRaceOccupation":"Head Of Extra Planar Studies","description":" A gaunt half-elf male with a narrow face. He talks with sophistication and uses as many big words as he can. Some times he makes up new words when he feels that he can\u0027t express something with normal ones. He has knowledge about planar things. His focus is usually on the upper planes (Heaven, Utopia, etc.) although he can help with any plane. The more obscure the plane is the more he avoids talking about it. He believes all planes are just a strange demiplane of some greater plane. Every plane is encompassed by a bigger plane. He points to the Astral Sea and other such large planes as a good example."},{"name":"Kraddic Cobbhearth","genderRaceOccupation":"Philosophy of Babarianism","description":" Professor Cobbhearth is a halfling of middle age, with all the youth and vigor of one much younger. Built lean with a deep chest and broad shoulders he has strong arms and powerful legs. He is cagey and gleeful in his ferocity and he has a deep and impassioned reverence for primal rage, an emotion that he believes to be the only authentic thing a true warrior can feel in battle. While those raised in barbarian tribes either do not take to contemplative endeavors, or follow those endeavors far and away from the barbaric battle arts, Kraddic Cobbhearth embraced and enjoined the two. A professor keen on active praxis over hollow pontificating, his classroom is in the field. He is glad for his tenure as a professor, and has great respect for those students who veer from the traditional barbarian path into his class and into the underexplored study of barbaric philosophy. You can see him most days in the yard, his bald head bobbing and weaving around training weapons, and his great copper mustache, reaching to his knees and bedecked in gems and rings and bones, swaying as he deftly moves. Many years of deeply philosophical self-reflection has given Kraddic a level of emotional control uncommon among barbarians, fortunately for his students as his prowess in battle is surpassed only by a very few great dwarves and orcs of legend."},{"name":"Percival Sparktrap","genderRaceOccupation":"Archaeology \u0026 the Study of Ancient Civilizations","description":" Percy is a middle aged gnome of roughly three feet five inches who wears spectacles at all times and sports a rather haggard looking beard that\u0027s never quite filled out. He has tired, sorrowful eyes having seen many friends come and go all the while handling the stresses of working in some of the most dangerous locations in the world. He is a man of science and learning is his driving passion, even when it gets him into trouble. He and his wife Tilde are field researchers who lead expeditions for the Gnomish Research Academy and Museum (or GRAM for short, pun intended). Unfortunately, his risk-prone lifestyle has caught up with him and Percy now bears very serious scars over the right side of his head and shoulders where he was caught in the blast of a stray Fireball."},{"name":"Jhoira Douglass (neé Teamorr)","genderRaceOccupation":"Advanced Alchemical and Mechanical Artifice","description":" Jhoira is a female human wizard around 35 years of age. She was dropped off at the Academy at the age of 8, and excelled in her studies to the point where she was asked to stay on as a professor after graduation. As such she has not left the academy town in 24 years. For her dissertation, Jhoira \"gave life\" to several humanoid constructs that now inhabit the town around the academy and pioneered the field of alchemical artifice. Her life revolves around academia and has an almost visceral distaste for small-talk. [DM\u0027s note: if a PC asks her about anything other than her or her husband\u0027s research you should answer whimperingly and in as few words as possible]. However, when speaking about her or her husband\u0027s research her gregarious, bubbly, passionate personality shines through."},{"name":"Tavish Douglass","genderRaceOccupation":"Rare and Ancient Languages","description":" Tavish is an Elvish (raised by humans) Fighter-Wizard who\u0027s 342 years on this world have been filled with a few too many adventures. Over the course of his adventuring has learned nearly every language (he only knows insults in undercommon but claims that is all one needs to know). He retired from adventuring after losing his right leg and left arm protecting a nearby town from an ancient blue dragon 10 years ago. He now has mechanical limbs (of equal - perhaps greater - strength and dexterity to his previous limbs) made by Jhoira. He is a truly magnanimous individual and is the most energetic individual in every room that he is in. He misses adventuring but has accepted that his mechanical appendages require too much care for him to ever adventure again. Because of this, he loves to live vicariously through the lives and stories of any adventurers he comes across."},{"name":"Mamanto Tharl","genderRaceOccupation":"Etiquette and Subterfuge","description":" A haughty Elven dandy, Mamanto struts in front of his class, demonstrating how one walks like a noble. Sporting a frilled lilac chemise and skin tight black leggings, Mamanto projects his voice with volume and enunciates every instruction to his students like a real nobleman. \"Walk like them, talk like them or else you\u0027ll never get within a mile of them!\" His students try their best to focus, but his overpowering perfume clouds the air and dulls their senses. A similar perfume is given to promising students as a graduation gift; an alchemical concoction made to daze and distract those nearby, and mask the scent of any noxious poison one might carry."},{"name":"never","genderRaceOccupation":"Cleaning","description":" When teaching, there is always a scenario prepared, frequently from other instructors homework. He will point at important details such as spills or small \u0027evidence\u0027 (hair, dust, footprints, etc.), make demonstrations with various potions and magic items, and then leave the students to figure out what he means, only giving approving nods or disapproving stares. He will use useful magic for ease, but will never use verbal spells. Students tend to learn how to use corrosive potions, blood sponges, incinerators, spells (if capable), disintegration effects, flooding techniques, using bags of holding for corpses, and, if present in the world, basic knowledge of a sphere of annihilation in order to permanently destroy all that enters its shadowy domain."},{"name":"Professor Koro","genderRaceOccupation":"Working in groups","description":" The professor is not human, but some kind of aberrant squid from the far realms with immense power; he can move with blinding speed, is entirely immune to normal damage, and can channel his power into enormous explosions capable of destroying mountains. Koro is recognizably a threat to the entire world, but he teaches his class how to work together during assassinations to be able to accomplish feats they never could on their own, with the end goal being his own assassination at their hands. No class has ever been successful, but each gets slightly closer, and graduates with far more skill than most assassins who do not take the course."},{"name":"Drek","genderRaceOccupation":"Theatricality","description":" A lean muscled half-orc with a penchant for the dramatic. Named himself Drek, which translates into \"worthless\" in orcish, out of a constant melodramatic hate for his bloodline. \"Smoke and mirrors are just as valuable as a blade\" Teaches his students how to pull off a job in the most over the top way possible. Those who graduate from his course can make a kill look like an act of the gods, a devil\u0027s command, and anything in between. This course tends to attract mopey lone-wolf types."},{"name":"Dingo \"Silentfart\" Nackle","genderRaceOccupation":"Assasination in public","description":" Dingo is a smart and light hearted Gnome with bright, well trimmed hair, and sparkling green eyes. Excels at killing targets unnoticed, and finds great entertainment in taking out political targets among nobles. He\u0027s good with poison, and enjoys to use fairly unnoticeable tricks to kill his targets. Probably one of the most energetic lecturers, but tends to get really off topic, and regularly pranks his students."},{"name":"Oleg Bluntaxe","genderRaceOccupation":"Hitting people hard with an axe until they die","description":" Sometimes all you need is to kill someone without any form of grace to make an example, and Oleg is the man for just that. He\u0027s a bald, dimwitted ex-lumberjack, with scruffy beard and has a great passion for chopping more than just trees. Lectures usually revolve around hitting stuff. Hard."},{"name":"Toren Brightglow","genderRaceOccupation":"Dinner Etiquette","description":" Toren is a light haired, big bellied, constantly smiling dwarf. He teaches the proper methods of preparing a dinner for high class targets. The class focuses on such things as creating a menu, proper cooking techniques, silverware placement, and how to conduct light conversation. He makes each student throw a dinner party for the class each week, though its usually better to go hungry if you can\u0027t figure out if the nightshade is in the sea bass or the soup."},{"name":"Solana Ashaar","genderRaceOccupation":"Long Distance Targeting (Sniping)","description":" A cheerful half-elf with fiery red hair, unkempt and cut short. She is usually pleasant to be around, and she helps those who ask for it, but when she is serious about a topic she is intimidating. Students will need to have saintly patience and be prepared for plenty of... unorthodox training methods, as sniping isn\u0027t exactly a straightforward technique to teach."},{"name":"Sam","genderRaceOccupation":"Deception and Illusion","description":" While it is true that being a doppleganger Sam has an unfair advantage that they cannot teach to their students. Sam only takes in students with the drive to use spells such as \"disguise self\" and \"polymorph.\" Sam teaches that nearly anything can be hidden in plain sight, from the people next to you to the weapons on your person. Sam has a tendency to walk into the first day of class as a student in naught but their uniform, and then walks to the front of the class and pulls out all manor of weapons from misc. polymorphed items. They also teach a class on conjuration for the higher level students."},{"name":"Velyr","genderRaceOccupation":"\"You never climb a castle wall without knowing what you\u0027ll find on the other side. Many of your contracts will prevent you from simply murdering your target, my love. I assure you that, with the letters you write, you can kill without a weapon, from any distance.\"","description":" Velyr is, by all appearances, human. He seems to have short hair, trimmed beard, and very well fitted dress. His manners are fluid, automatic, and above all precise. By all appearances, he would pass by unnoticed in any crowd of well-to-do citizens. By all appearances, he has a warm, soothing voice which makes those unwary feel safe near him. The close observer, however, may find his cold stare and toothy grin unnatural."},{"name":"MINIMUM!!\"","genderRaceOccupation":"\"Which reminds me of how i lost my leg. You see...\"","description":" He is, however, an altogether wonderful guy once you get to know him. His classes, while challenging, are always reasonable and he takes a lighthearded approach to economic math. When he digresses though, his stories get a bit... intense. It\u0027s the mood swings, probably- or perhaps the whisky. Or maybe it\u0027s due to sudden, crashing memories of his past. It\u0027s tough to say."},{"name":"Varus Senepes","genderRaceOccupation":"\"Vivian you do realize that you have FAILED... to sterilize your knife, upon puncturing your finger? Supposing you did the mix CORRECTLY... you will be dead in thirty seconds, unless you prepare your antidote with... legendary, speed. ...Miss Vivian I do believe you have just committed not ONLY to the failure of this course but your own demise as well. Drink this... now leave, before I decide to make YOU my next... ingredient.\"","description":" Alchemy, poisons and oils. Varus is a black haired, pale, centuries old elf, who talks with quite... pronounced... articulation. His robes hide his features so well he appears as a specter most days, if he appears at all. It amuses him to teach while invisible, to better catch slacking or cheating students. Incidentally, it also aids with visual demonstrations some days. His class is the most difficult to pass in the entire academy, due to the rigorous study and absolutely vicious classes. Being called upon to recite ingredients or cooking methods is quite dreaded, as failure could mean imbibing any number of potions to demonstrate the antidote application method. It would be quite an odd semester if every student survived, though Varus has never deliberately killed any of them. Yet, anyway."},{"name":"Loraine \"Doc\" Highfellow","genderRaceOccupation":"Practical Anatomy","description":" A former medical practitioner during the days of the Great plague, Loraine is cold, calculating, and unforgiving. She is a slender human woman, rather unremarkable looking, with brown eyes and shoulder-length black hair. The first day of her class is infamous among students, as she brings in two live humanoid subjects, and orders a student to attempt to kill one by stabbing them once. Often, it results in several minutes of agonized screaming from the victim, during which Loraine proceeds to demonstrate the importance of a thoughtfully-placed knife, ending the other subject\u0027s life quickly and quietly in naught but a few seconds. Her final exam can be heard throughout the school as, for a brief moment, dozens of people cry out in pain and fear before their lives are swiftly and efficiently snuffed by the students."},{"name":"Darrio","genderRaceOccupation":"Culinary Animosity","description":" Darrio is a human male of average build with slightly graying hair. He is most often see dressed white, the way you would expect any good chef or cook to be. The first few weeks of his class always start with regular cooking lessons, to make sure the students can actually pass as, at the least, competent cooks. From there, he moves on to teaching them how to mix various ingredients into the food, to produce non-fatal effects such as diarrhea or vomiting without any noticeable unusual taste. The final portion of the course is fatal poisoning, by method. Successful students can induce death that looks like choking, heart attack, or almost any natural means. The absolute top students are those that can tailor mass consumption meals to specific individuals: A soup that targets only the duchess, bread rolls that only asphyxiate the diplomat from the foreign country, wine that only burns the esophagus of the famously vain opera singer, etc."},{"name":"Mordak Chainboot","genderRaceOccupation":"Prison Infiltration and Breakout","description":" Mordak is a worn, sickly-looking dwarf with a smoky-gray beard barely longer than a stubble. In his lectures, he has a tendency to wax on about his own claim to fame: infiltrating a supposedly inescepable dwarven prison and breaking out after assassinating his mark. Despite the occasional reminiscing, his lessons do cover all the aspects of assassinating an imprisoned mark, from techniques to learn the prison layout in preparation, to various ways of securing an unguarded moment with the mark to carry out the assassination."},{"name":"Jiang of the Silent Afterlife","genderRaceOccupation":"Professor of Making Sure Dead Men Tell No Tales","description":" In a world where ghosts exist, it can be hard for assassins to maintain their anonymity when their victim\u0027s spirit can still point fingers. Jiang has mastered the arcane arts of keeping ghosts silent, often by destroying the ghost as soon as the spirit leaves the body or by destroying the spirit before the body dies. She honed her ghost-slaying talents under the tutelage of a temple to Pelor, and has learned arcane rites to hurry a soul into its proper afterlife, where it can\u0027t tell stories, in a temple to the Raven Queen. Her classes tend to be underfilled, as few respect the value of her lessons until a paranormal investigation begins, and the spirit is at large."},{"name":"Matron Sarah","genderRaceOccupation":"Common folk manipulation and political subterfuge","description":" Matron Sarah is an elderly human, previously married to a farmer before he and her children were murdered by soldiers of his lord. She has a kind smile and kinder eyes, and teaches the better off students how to fraternize with peasants and urchins. This is a unique brand of assassination she teaches; turning once loyal subjects against their leaders, typically through violent revolution. Despite this facade, she cares little for the well being of the people, only taking pleasure in the upsetting of power balances and political instability that follows. The loss of her family broke her, and she sought vengeance by making a pact with a particularly capricious fey in exchange for the power to rein chaos on the material plane."},{"name":"Rylni of Grayshear","genderRaceOccupation":"Vice Provost for Faculty Affairs, teaches Scrying Ia","description":" This beady eyed gnome wears a light gray robe that contour her body just enough to reveal a gaunt figure unfit for strenuous work, unlike others at the academy. She has an oily and freckled face which both accentuate a scar that runs from her jaw line to her right cheek bone. Often mistaken for a student, Rylni distinguishes herself through her unforgettably explosive temper when she\u0027s outspoken. Rylni has the difficult task of performing fact checks on instructors who applied to the academy. Students taking her class learn elementary applications of the scrying orb, amongst other divination tricks."},{"name":"Lokeris Dark (the third)","genderRaceOccupation":"Justification","description":" A silver-tongued Tiefling fellow, always dressed impecably in the finest clothes, elven in style of course. His manners, always impecable, are totally disarming, charming even the most savage of beasts. His wit sharper than the finest blades the forgotten realms could offer. And there\u0027s the rub. You see, learning to kill subtly is one thing, learning to give a reason to kill is another. Under Lokeris\u0027 tutelage, students will learn how find their target\u0027s weak spot, whether it be cards, dice, or just their honour, and exploit it, needle at it until the target attacks. Remember, it isn\u0027t murder if it\u0027s self defense."},{"name":"Therian the Flame","genderRaceOccupation":"Making it look like an accident","description":" Seen as a joke by the other teachers LoneStar is, nonetheless, One of the most well known assassins ever. LoneStar\u0027s reputation exceeds his actual success rate by many levels, however. LoneStar teaches that one must take pride in their work, and everyone should know who killed the mark. Studebts practice boisterous monologues while hanging from rafters, taunting their target while it summons its guards, and develop their own flamboyant \"signature technique\" with its own equally edgy name.   Therian is a middle aged man, brown hair and bronze skin. He only wears a pair of white baggy clith pants, and his scimitar strapped to his waist. Therians class teaches students how to best utilize poor building techniques, such as weak foundations, or wood structural beams, to literally \"bring the house down\" on their target. Graduates of this class go on to become Expert serial arsonists and impromptu demolitions crews, as well as being highly sought after sappers in times of war."},{"name":"Daven of Crowbridge","genderRaceOccupation":"does","description":" Jethro Eckhardt is a lean, bespectacled, scholarly looking sort, often dressed in doctor\u0027s robes and accompanied by his distinctly humanoid Clay Golem, D4. Together they teach the principles of where to hit a target where it hurts most, and just how to do it, with Jethro covering the theoretical side of things and D4 acting as a living training dummy of sorts for practical demonstrations. A cheerful man who enjoys his work, Jethro has developed quite the bond with his classroom assistant, and has taken to referring to D4 as \u0027David\u0027, after the phonetic spelling of his College asset ID. It\u0027s this knowledge of preventative maintenance he tries to pass on through his course- \"Take care of your tools, young lot- and they\u0027ll take lives in return!\""},{"name":"Victor \"Jigsaw\" Moreau","genderRaceOccupation":"Remote detonation","description":" A human in his late 50\u0027s, hunched, twitching and covered in scars thanks to a few too many close encounters with his own creations. Victor has a soft Germanic accent and a simple rule when it comes to assassination: it doesn\u0027t matter how loud you are if you\u0027re not in the room when it happens. \u0027Listen vell, ladies and gentellmen. Ven ze general, king, queen or target of choice sits on zis cushion, ze pressure of ze bum on ze chair breaks ze sugarglass in between ze two vials, allowing ze reagents to mix. Vonce zat happens, ze fireball should consume everyzing in a twenty-foot radius, so I vould advise making a note of ze seating plan.\""},{"name":"William \"The Raven\" Finley","genderRaceOccupation":"Interrogation Resistance","description":" A calm old wood elf with dark brown hair, dull green skin, and hazel eyes, Silaneth sometimes spends an entire class with her nose in a book and her back turned to the students. The next day, they all receive marks. No one is quite sure for what. Some students leave in the middle of class and get a perfect score, others a failing grade for the same stunt. The joke around the academy is that it\u0027s a course in patience, not in stealth. Indeed, Sila often admonishes her students for excess haste. \"If you don\u0027t know more about your mark\u0027s routine than their own family when you go in for the kill, you are making a dangerous mistake. You can learn how to clean up the murder scene from Remmings, but if the mark\u0027s head of security walks in on you because you don\u0027t know his schedule, you\u0027ve got a bigger problem on your hands.\" Although she does teach various techniques in stealth and long distance tracking, the most useful part of her class is the weekly assignment to each student: to follow another professor in the academy, learn as much about their life as they can, and to not get caught. By the end of the course, the best students are more than capable of avoiding detection while tailing even an experienced mark. On the first day of the class, William scans the room with his deep, black eyes. Later, every student swears that his piercing gaze lingered on them just a little longer than everyone else. Everyone admits that when William looks at you, it feels like he can see directly into your soul. He was a human soldier in a special operations unit reporting directly to the highest officers in the military. A natural born leader, he did not have any profound or unique skills save that of his magnetic charisma and unyielding will. His class is well known to be grueling and unforgiving. There are no marks, only a pass or fail. Those who have passed the class, are known around the academy and either widely respected or else feared. He begins his first lecture with this, \"Most of you will fail. If you have a shred of doubt in your ability to pass this class, quit now. Nine percent. That\u0027s how many of you I can expect to pass this course. Just looking around the room I can already tell which ones of you will quit within the first week.\" He starts pointing at the students and calling them out by name. He makes an effort to learn the names of every person in his course before they start so he can verbally abuse them from the first day. Very quickly, the students realize that during his class, he can be abusive and cruel, but is kind and friendly when not in class. He was a POW of the Drow for over a decade and sometimes recounts the sickening torture they utilized to try to get him to talk. He likes to lead groups on hikes, go camping, and tell war stories around the fire when he is not teaching. During one week of classes, towards the end of the course, students must go through hell week. This is a week of no sleep, no food, no rest. They are tortured, they are poisoned, they are bewitched. Every possible things is done to get them to give up. All they have to do is say they\u0027re done and all the pain stops. They are given a warm delicious meal in front of their peers who are still struggling. Those who don\u0027t give up, have almost passed the course. They have one final exam: to not give up a piece of information to the students of Dareth \"Feelgood\" Woren through a day of torture. Selected Quotes: \"Your mind is your most powerful weapon and your biggest weakness. When I lived with the Monks in the mountains of Harkonell, I learned to strengthen my mind. Your assignment, from this day to the end of this course, is to meditate while in pain. Try for an hour a day. I have a list of sufficient ways to cause pain posted on my office door.\" \"Always remember, if you\u0027re being tortured for information, that is the only thing keeping you alive. Revealing it will result in certain death. We strengthen the mind and the will because when they are weak, death will seem like a welcome reprieve.\" \"The most powerful torture is psychological. They will tell you they\u0027re torturing your family. They will show you what may or may not be illusions of your family being tortured. They will force you to ingest poisons that cause you to forget who you are. Sometimes they will offer you something enticing instead. They might offer you riches, immunity, protection, freedom. These are all techniques to get you to break. Do not fall for them.\""},{"name":"Bob","genderRaceOccupation":"Erasing","description":" Bob is quiet and unassuming. You might have seen him, but your eyes probably just passed over him. He\u0027s about average height, and his hair is shortish, or maybe longer? But anyway, Bob gets rid of people. Very important people. Assassinating someone important is hard. Not the part with the dagger and the muffled scream and the look in their eyes as they come to grips with the fact that this is their last moment on the material plane. That part is easy. It\u0027s the part after, where the clerics come in and make a big show of speaking with his corpse, and the divination wizards come, all eager to curry favor with whatever poor bastard now has to sit his arse on the throne. Now there are people looking for you, and you\u0027re living out your life in a lead-lined room in some backwater safehouse. Bob doesn\u0027t teach you to assassinate people, like the others. He teaches you how to erase someone. Come dawn, no one will even wonder who used to eat the bacon and eggs the cooks are busy making or whether someone sleeps in that big bed. They\u0027ll just be gone, and you won\u0027t even have to hide, because no one is looking for you."},{"name":"Vulpis Dreamwine","genderRaceOccupation":"Truth And Truth-Seeking","description":" A sallow elf with sunken, always-wide eyes that hint at an untenable sleeplessness. Vulpis has a drunken gait, relaxed charm, and a penchant for purple in his shoddy patchwork outfit. \"Get comfortable. Sometimes what you seek is just a friendly conversation away.\" When he\u0027s not telling stories about epic triumphs and adventures-gone-wrong, he casually chats with his students about their past, their aspirations, which classes they\u0027re taking with which professors. A Nat 20 Insight roll on one of his stories will reveal that some part of it is dishonest. On the last day of class, each student awakens to find something precious has been stolen from them. The classroom is abandoned and locked. If investigated, the school has no records of a Vulpis on staff or a \"Truth And Truth-Seeking\" class."},{"name":"Alstair Horngrave","genderRaceOccupation":"Above and Below, or How to Use Infrastructure","description":" Alstair is not usually known for his manners or his appearance, however he is known for his entrances. At the beginning of each term and before any practical examinations, he makes a point of entering the room from somewhere other than the door, once even rising from the ashes in the nearby fireplace. His course mainly revolves around using sewers, rooftops, and crowded streets to disappear or approach your target unseen, taught through theory and anecdotes from his days as an urchin. On rare occasions, he\u0027ll have some of his colleagues play the role of a student as a test, blending in with their classmates for weeks at a time until that first test is deemed to be concluded. The more notable of his lessons are held outside the classroom, teaching students through real life experience in controlled environments."},{"name":"John Graves, Insurance Adjuster","genderRaceOccupation":"Chaos Based Magical Assassination","description":" John Graves, Insurance Adjuster, is a pillar of the community, often found helping the local priests, donating food to the poor, and helping people recover from horrific accidents that he often causes. The name, John Graves, Insurance Adjuster, is a legacy title, passed down to the highest ranked assassin in the guild (often with several \"John Graves\" active at a single time period, working independently). Each Graves acts slightly differently; however, they each have two things in common. They run a \"respectable\" business, often insurance, but another similar profession works too, such as pharmacist or banker, and Graves has made a deal with some sort of Chaos God or Great Old One, which he sells the souls of those whom sign his contracts to the chaotic one, whom eventually kills them in a chaotic accident and feeds upon the chaos surrounding their untimely death. (Chaos loves collateral damage, but the only person whom ever dies as a result of these accidents is the victim, no matter how much destruction of property or others whom are injured in the process.) Grave\u0027s weapon of choice for his assassinations is based upon a misleading contract which binds the souls of those he insures to be eventually killed in horrific accidents. Graves is able to prevent an insurance contract from causing an accidental death by burning the contract prior to the death of the signor, or instantly \"activate\" the contract (and cause the accidental death to occur before the next New Moon), by signing and executing the contract in his own blood. He trains new assassins by teaching them actuarial tables, and in all ways making them a perfect \"drone\" within his business. All initiates also sign a contract upon joining the Guild. Once an initiate has proven a perfect \"Insurance Adjuster\" or \"Bank Teller\" or otherwise, they are inducted into the secret society and given the option to become a new John Graves. If the initiate declines, the Chaos God eats the initiates soul. It is unclear how Graves monetizes his assassinations, and each Graves has independent motivations sometimes at odds with other Graves. One common tactic is to gain as many insurance contracts with high ranking members of society as he can infiltrate, and then \"selling\" the death to his target\u0027s enemies prior to their death."},{"name":"Haber \"Gasman\" Devronich","genderRaceOccupation":"Poisons, potions and chemistry","description":" Lastman, as he is most commonly referred to, is a generally unremarkable human, and comes to each class with a fresh costume, set of mannerisms and name. He never tells new students this, and one of the earliest \u0027grades\u0027 given is how long it takes to figure out that all the teachers they\u0027ve had are the same person. A tall, bulky half-orc, Shaav wears armor almost constantly, and will challenge individual students to duels if they slight him. He is surprisingly eloquent, and knows almost every book of sword theory front and back. He has never actually worked as an assassin, but quickly teaches his students that no fight will ever be between them and a similarly-sized individual. A tall, imposing elf, Devronich is covered in centuries of burns, scars and boils, and always wears an asbestos hazard suit for protection while in class, and more than once he has accidentally incapacitated his entire class. He constantly coughs and giggles to himself, and those who are in his classes rarely stay for more than a semester, and few have survived more than two."},{"name":"Kethan Quentith","genderRaceOccupation":"Applied Anatomy","description":" A scholarly Drow man with round glasses and tousled white hair, generally absent minded and gregarious but keenly focused when it comes to surgeries, dissections, and other less reputable applications of his craft (torture foremost amongst them). He left the Underdark not because of some innate goodness but because he wanted to work on greater varieties of species than could be found below the surface. Students under him learn how the bodies of most common races are put together and, consequently, how to take them apart in excruciating or efficient ways"},{"name":"The silent council","genderRaceOccupation":"stealth and distraction","description":" A tribe of feral kenku who use their mimicry and movements to teach their pupils the art of moving silently, knowing when to speak and not, causing distractions, and finding the opportune time to strike. They are highly intelligent but seem to care not for material things beyond their robes and daggers, though they do accept offerings of food in exchange for a chance to be taught a lesson in their art. The selection methods of the council are unknown. Some say they have the ability to shape change into monstrous forms of feather and shadow - known silent council students will not speak of this."},{"name":"Supremely Eminent Hobgoblin Cancer-Kill Educator VI, Whose Wisdom Mustn\u0027t Be Questioned","genderRaceOccupation":"Hobgob Campus V: The Very Best Campus on the Planet or in the Sky if the Sky Had Campuses","description":" This otherwise unblemished, jovial hobgoblin is stooped under the weight of an eyewateringly disgusting hump on his back that pulses in the middle of class. If he catches you staring he pulls his robe a little to show you more. He\u0027s very proud of his hump. He extracts all his best diseases from it. SEHC-KE4WWMBQ teaches the uniquely hobgoblinoid assassination tool of natural causes. Hobgoblins mercilessly execute any who use the sacred arts of battle to kill dishonorably. And since the only acceptable ways for a hobgoblin to die are in battle or of disease, hobgob assassins need to get creative. And they don\u0027t use poison. This isn\u0027t poison and if you suggest it is to SEHC-KE4WWMBQ he will have you thrown out of his class immediately. This is natural causes. In SEHC-KE4WWMBQ\u0027s putrid study hall you will learn about Slough Rot, the Masonry-disease of the Gibbering Mouther, and how to spread it from floor to man. You will be taught how to culture the Love-cancer, which metastasizes in your nose and spreads by kiss. You will learn the 50 ways to kill a man by leaving a moldy piece of toast under his sink. You will, Hobgob willing, grow your own garden of throwing viruses, whose protein capsids grow so long and sharp that they can be used as daggers. Due to a quirk in the hobgoblin code that last one still technically counts as kosher."},{"name":"Val Raveneyes","genderRaceOccupation":"Political and disguises","description":" A freshly groomed bearded human man. Wearing noble\u0027s clothing. Mastermind Rogue and Warlock levels a Raven sits on his shoulder when he rests. He is extremely blunt and prides himself on efficiency. Silver tongued through years of being a fence in a thieves guild, he has surpassed his teachers. Able to craft any disguise in hours, he has even disguised others to appear as him while he sat in on his own class to show how effective it is. \"Remember that saying? Keep your friends close and your enemies closer?\" \"Disguise yourself and your enemies think you friend, making it all the easier. Poison and a sharp blade can do the rest.\" \"Blue blood is as good as red blood. Ribs 5 and 6, dagger goes between those for best results.\""},{"name":"Phalin Ghandos","genderRaceOccupation":"Information with Style","description":" This happy-go-lucky half-elf plays everywhere, palaces, inns, taverns, and even town squares. While he\u0027s laughing with nobles, he\u0027s bedding the help. All the while gathering information for weak spots either in security or in court. Trained at the College of Swords, Phalin is as deadly with a blade as is his wit. Oh and to pass his class you\u0027ve got to gain information he doesn\u0027t already have."},{"name":"Sergeant Cutler","genderRaceOccupation":"Military Etiquette","description":" A grizzled human male, Cutler looks out of place in his worn mail shirt among the black-clad faculty. A veteran of many foreign militaries, militias, mercenaries, posses, gangs, city watches and similarly regimented organizations, Cutler\u0027s lessons can let any soft-handed assassin-to-be swagger into a barracks without a second glance from its occupants. A few brave souls refer to him behind his back as \"The Seamstress\" for his talent at repairing and imitating any uniform, a lesson he teaches under the moniker of \"Advanced Military Infiltration.\""},{"name":"Vrok Grathul","genderRaceOccupation":"Assassination for Haruspicy","description":" Vrok is an elderly orc with bone piercings across his face and arms. He speaks slowly and uses few words, but is not unintelligent. He teaches a method of knifework that assassinates the target but preserves the entrails in the best possible state for divination. He is disliked but acknowledged by other teachers due to his skill and long experience."},{"name":"Elden Vathir","genderRaceOccupation":"Post-Capture Diplomacy","description":" Elden is a broad-faced half-elf with a silver tongue. He is curiously still while talking; always active when not. He deals with what can be done in the event an assassin is captured - bribery, tricking guards, and other diplomatic subjects."},{"name":"Alexandros Cordini","genderRaceOccupation":"Enhanced calisthenics","description":" \"Nobody can get the job done if the body cannot follow the mind.\" This bald middle aged man doesn\u0027t like to brag about his kill score, or talk about it at all, but what he does brag about is his stamina and how good legs will bring your ass to places. He\u0027s a firm believer that 20 push-ups for each mistake and misstep will bring your mind where it needs to be, and that proper full body workout can forge the most lethal weapon in any assassin\u0027s arsenal: one\u0027s own body."},{"name":"Dargos Blackthumb","genderRaceOccupation":"Abduction \u0026 Extraction","description":"  This strangely quiet dwarf js good at not being seen and better at not letting a good kill go to waste. He teaches a type of \u0027business\u0027 where the actual assassination is only a mere step to a final goal, or sometimes isn\u0027t even performed until after the job is already done. Sometimes less than savory folk has less than savory needs for bodies. Breathing or otherwise. A gang may need a corpse to serve as a body double, a rich vampire may want a meal and doesn\u0027t feel like hunting it themselves, or a demonic cult may need specific body parts for their dark rituals. Whether the client will pay on delivery of a corpse, a living captive, or a just pint of blood, it doesnt make much difference. The victim dies sooner or later, and you\u0027ll learn to be paid either way."},{"name":"Hattori Masanari","genderRaceOccupation":"Manipulation and deceit","description":" The idle chatter filling the room quickly turns into quiet whispers as the door opens, and a skinny man enters. He continued towards the desk, his fine clothes formed a snug fit over his slender body, barely wrinkling at all as he moved. The most striking thing however were his unusually sharp features, aquiline nose, combed back hair, and seeming use of dark makeup to enhance the already prominent amber eyes, leaving him looking about as hawk-like as human can be, and a less wise man might even mistake him for a hengeyokai of that variety. There had been less wise men, but nobody believed them, after all they had all shown to be fools, scoundrels or both. The first one ended up on the streets after utterly ruining his merchant family\u0027s legacy. The second was nothing but a lowly thief and hung for his crimes. The third, he died to his brothers rapier, a befitting end for seducing the poor brothers wife. He had taken no pleasure in their deaths, why would he? He wasn\u0027t a monster, no; but seeing the hope in their eyes fade and be replaced with panic as their whole world collapsed around them, that, that was what made him feel alive, so there he stood in front of the class ready to pass on his skills to a new generation, his mouth forming a small smile as he spoke in the voice of someone knowing they own the world, \"Class is now in session\"."},{"name":"Lady Vivica Haverly","genderRaceOccupation":"Weddings and Wagers","description":" A thin, brunette woman of middling years. Impeccably dressed to the highest of society’s standards, just conservative enough but with a coquettish smile that’s lured in more than a few marks. Whilst she is all charm and graces when on a job, as a teacher she is exacting and methodical. She teaches her students how to goad their marks into their own downfalls, with weddings and wagers being her forte. Where time and planning is available, she can take a mark and have them under her thumb within a short few months; Marriage proposal to the aisle in under 6. Before the year is out she is a tragic widow with a dazed look in her eyes and many people falling over themselves to console her until she disappears to ‘recover’. Where she is short on time she has been known to use pride and folly to her advantage, convincing the unsuspecting into ill-advised bets that lead to their demise. Whether it’s to protect her honour, to impress her, or simply her gentle coaxing into a bad decision already waiting to happen, Lady Haverly has seen many a mark fall to their death on the duelling crowd, attempting impossible feats or simply falling into debt so heavy that taking their own lives seems the sensible option. Lady Vivica lives by the principle of why get your hands dirty if they’ll do it themselves for you?"},{"name":"are","genderRaceOccupation":"Planning and information gathering","description":" Tall and laid back, the human seems to have a natural charm to him. Able to make anyone smile, however his eyes pierce through you, which leads way to a different, aggressive personality. Elias teaches the importance of detail. Explaining how every detail must be fully observed, and fully absorbed, the smallest piece of the puzzle can save your hide. \"Don\u0027t write anything down, commit it to memory, because sometimes you wont have time. Plus, you can lose your writing, which leads me to my next point. Prepare for every plan you make, to fail. This is why you need to learn to improvise.\" He seems to observe everything for a few seconds longer than most, and has a mostly clear memory of everything within the past 3 days. \"The key to a clean kill is a solid understanding of the cage the animal has restricted itself to.\""},{"name":"Forlom Zuckus","genderRaceOccupation":"Magical Recon","description":" A tall, shapely human, Ms. Underbust is an expert in the arts of disguise, seduction, and blackmail. Her students learn to gain a mark\u0027s trust, then discover (or create) incriminating evidence. Her classes cover social customs and taboos, the practice of changing your appearance to suit your needs, and how to use information (whether it be true or not) as leverage. A successful student of her\u0027s will be able to turn an otherwise upstanding citizen into their own unwilling lackey or a social pariah fit only to be run out of town. She also insists on all of her students drinking heavily during her classes to build up their tolerance, \"You should always be prepared to drink your mark under the table.\"   Lockjaw is a no-nonsense goblin with a knack for remembering every face she sees. An accomplished networker and fence, she is as dangerous at a negotiating table as she is with a blade. Most any person is to have some personal items on them, usually in the form of jewelry, magical items, or heirlooms. While in some cases it is important to leave these identifying items on a corpse, you are more likely to live to see your next contract if the authorities have to ask who is dead before they can as why they are dead. You could destroy these items, but that would be a shameful waste. Better to sell them to someone who understands the importance of discretion. Prof. O\u0027Mally is a fence first and an assassin second. Her class is devoted to safely and secretly selling the goods of the recently deceased. She also teaches courses in negotiating contracts and sizing up potential employers to determine who is and is not safe to work with.   A tall, pale human who has clearly spent too much time in dark places, Forlom clearly emphasizes magical acumen first, meditation second, and hygiene last. Prof. Zuckus is a master of divination. His classes focus on learning everything you need to know about a target before you get within a days journey of them. He will set up traps days in advance, knowing exactly where and when his mark will be vulnerable. Graduates of his plan their strike days in advance, set their traps, and leave with enough time to be miles away before the hit takes place. There is no need to witness the kill in person when you can witness it magically."},{"name":"Lak \"lucky\" Lu","genderRaceOccupation":"The butterfly\u0027s wings. A form of assassination that exploits chaos theory. Like using an ice cube to trip a pedestrian into a horse sending it on a stampede that causes your hemophiliac target to break their wine glass in shock, cutting themselves and having a slow and painful death.","description":" Lucky Lu is a fat halfing that claims to be responsible for 70 high profile accidental deaths. He claims his skill is due to his 7 toes on each foot. It wasn\u0027t until he wasn\u0027t threatened by a thug with a knife and the thug was killed by choking on a pea that anyone believed him. He claims he is waiting for someone adequately accident prone to pass his methods down to."},{"name":"Ephut-Kai","genderRaceOccupation":"Headmaster","description":" Ephut-Kai is a bald man with bronze skin and scars running the length of his arms. Ephut-Kai is a silent, intense man who never says more than he has to. Most students are thankful of his silence, because Ephut-Kai has never said anything that wasn\u0027t at least mildly threatening or unsettling. Ephut-Kai runs the Academy, a mountain monastery which trains monks in the art of murder. The students are sold at incredibly high prices, and they never fail. Ephut-Kai was once a student, until the former headmaster murdered his twin-brother for insubordination. Then Ephut-Kai drown the former headmaster in a pool of lava. Since then, the Academy has been running smoothly and silently, just like Ephut-Kai likes."},{"name":"John Tark","genderRaceOccupation":"The Everyday Man","description":" \"If you want to know everything about anything, you need to start from the bottom. Students of my class will learn to infiltrate the deepest dungeon, scale the tallest towers, and be invited into the most prestigious of throne rooms and balls.\" \"The unkempt cleaner, the grumbling plumber, the amiable server. These are the roles you will wear in my class.\""},{"name":"Wymern Ravel","genderRaceOccupation":"Public Assassination","description":" \"No, no. Not like that!\" he yelled as a student detonated another Fireball. His scaly hands waved wildly, as chaotic as the commotion he caused when he performed one of his spectacles. \"You must make it bigger, brighter! A show so spectacular you can just fade into the crowd!\" \"Easy for you to say! You\u0027re a--\" complained a student. A fireball immediately blew up in his face, yet leaving him unharmed. Despite being only a human, Wymern had all the temper of a red dragon."},{"name":"Tilo Otto","genderRaceOccupation":"Character Assassination and Emotional Manipulation","description":" A silent and solemn tiefling, this pale pink-skinned assassin is neither wiry nor bulky in build. Mr. Otto, as he prefers to be addressed by his peers, wears a simple frock coat that matches his night black horns pulled close to his slicked back hair. His movements are slow and deliberate, much like his clearly enunciated manner of speaking. Mr. Otto chooses his students based not only on their criminal merit, but also their calculating and entrepreneurial goals. Students are expected to strip away their own emotions, because Mr. Otto\u0027s particular brand of character assassination requires lack of pity or empathy. Many of Tilo Otto\u0027s targets are driven to suicide after a long and drawn out loss of sanity. Through use of illusory manipulation, Mr. Otto teaches students to implant nightmares and hallucinations in the target. In addition to the practical application of illusory magic, Mr. Otto teaches his students the art of surveillance and creating a profile of their targets in an effort to better torment them."},{"name":"Brande \u0027The Voice\u0027 Preznal","genderRaceOccupation":"Baiting and Distraction","description":" Brande is a human built like a string but strung in a bow. What he lacks in physical ability he\u0027s made up for in taking hits and drawing crowds. \"Sometimes a job requires a distraction. Maybe the guards need a fight to break out and draw a guard. Maybe you\u0027re not suited for offing some bloat but you\u0027re still here to help. Or maybe you drew the short straw. One day or another you won\u0027t be the man drawing the targets blood. I\u0027ll be teaching you the ways of getting the attention of the right people to leave the opening for your mate to take the kill. First things first, someone show me your punch.\""},{"name":"Kor Chizael","genderRaceOccupation":"Philosophy and Ethics, and once a cleric of Bhaal","description":" A gaunt human with sunken eyes and wrinkled, waxy skin, Kor is a follower of Bhaal, a cult leader and professor of ethics. He appears to have burn scars on the right side of his face, or possibly some sort of disease of deterioration, possibly magical in origin. He constantly wears a deep scowl, and his emotions range from anger to apathy and nothing in-between. \"Life is a spider web that we are trapped in, slowly starving, awaiting the spider\u0027s fangs and final embrace and sweet release. To spill the artery of another is an act of mercy - and it is our duty.\""},{"name":"Langston Mandelig","genderRaceOccupation":"adjusts his hair and starts to pace","description":" A tall, lanky half elf in a rough coveralls. He is pale with unkept dark hair, wire rimmed spectacles and a distracted manner. He speaks quickly with a slightly high pitched voice and a tendency to go off on rambling esoteric tangents. Vain and sesquipedalian, he has little time and less interest in those who are beneath him intellectually. Quick to anger and defensive when challenged, he nonetheless is a skilled instructor for competent students. He specializes in obscure and undetectable poisons and deadly agents. Example lecture: \"Hello class\" \"Today we are going to be discussing the use of hormonally triggered toxins. Those of you who bothered to attend our last lab section... \"Will recall the value of decoupling cause and effect in a discrete assassination. A quality investigator will firstly attempt to link the motive, opportunity and action to the effect. The effect of course is the inhumation of the relevant target. By decoupling the apparent cause and effect we can disguise our connection, hence the value of asymptomatic pathological agents that are triggered by means at a far remove from our own actions. \"The classice example is what is crudely known as the \"Lecher\u0027s trap\" which you will find an in depth discussion of in Chapter 6 of Mironnel Krenski\u0027s text \"Obscure toxicological agents and Other Discrete Political Agents\" available at the university library. This is a sample of purpose bred sporulated Entamoeba histolytica. It is an anaerobic parasitic that may infect any known humanoid. This particular strain has been bred to enter the vascular tissue of any higher vertebrate. After amebiatic introduction, it takes 1-2 days to colonize and passively wait for the proper hormonal trigger. It may persist in its vegetative metabolic condition for at least 2 years. \"This is the extract of Hyoscyamus of the genus Solanaceae. When administered to a person results in a increased production of glucocorticoids over for approximately a week. \"Weren\u0027t you listening?!?! This vial is harmless!!! Our whole purpose is carrying two discrete agents that can trigger a deadly effect!!!!!\" \"The increased production of glucocorticoids can be noted in the affected creatures saliva and other mucosal secretions!!!! This glucocorticoid will trigger the amoebic agent and result in the rapid death secondary to uncontrolled bleeding over the course of 2-3 days approximately 1 week after the combination of these agents! Meaning we can infect a target and later place the trigger in a person who will shortly have intimate contact with our target allowing us sufficient time to absent ourselves and introduce reasonable doubt into the actual moment of poisoning!\""},{"name":"Velkan Artaner","genderRaceOccupation":"Camoflauge","description":" Velkan is a dark elf who has an eye for detail. He is very clean and presentable during lectures, and seemingly despises unnecessary dirt and grime. Some who only have a passing knowledge of him may even classify him as a \"neat freak.\" Despite being a dark elf, Velkan appears to be one of the most civilized, well-spoken, and hygienic people one could know. However, during practical training exercises, Velkan adopts an entirely new personality. He becomes manic and highly elusive, covering himself in dirt, mud, foliage, and any miscellaneous objects to assist him in blending in to his surroundings. His dark skin serves as a natural aid when stalking in the shadows and, in combination with his silent movements, becomes almost impossible to locate when he wishes to remain hidden. Students and faculty report Velkan sometimes \"appearing out of thin air, as if coming out of an invisibility spell.\" He will frequently stalk students and staff alike when he\u0027s in one of his moods. There are rumors that he startled the head apothecary by perfectly disguising as the intricate wallpaper that covered the head apothecary\u0027s study. After announcing his presence and starting a conversation with the apothecary, Velkan reportedly disappeared back into the wallpaper mid-sentence as soon as the Head Apothecary turned his back to him."},{"name":"Alana Lowe","genderRaceOccupation":"Non-magic Subterfuge and Manipulation","description":" The instructor known for having one of the most difficult classes to pass, Alana takes the phrase \"Know thy enemy\" and has turned it into \"Mold thy enemy.\" Alana is a human woman who, while she naturally looks humble and homely, is known for being beautifully seductive if it is what the job requires. Her class focuses on pulling the strings from behind the scenes. The best jobs are ones you can finish without ever having to divulge a name. Subtle suggestion, if implemented properly, is enough to control the mind of anyone without magic and, most importantly, without them knowing. You don\u0027t have to kill anyone if you can convince someone else to do it for you, and make them think it was their idea in the first place. Her classes are notoriously difficult because she employs her own lessons against her students. Frequently turning students against each other or starting feuds and fights between friends, Alana\u0027s students must recognize and resist her silent influence in order to succeed."},{"name":"Kerlead \"Big-Splash\" Ironleg","genderRaceOccupation":"Assasinations involving Heavy Weapons and Explosives","description":" At first sight, this stout dwarf, with wild brown eyes, a short, scruffy beard the color of rust, and clad in a too-large chainmail hauberk that drags and rattles across the floor behind him, appears to be anything but stealthy. That first impression would be correct. Kerlead is loud, bombastic, brazen, and can take out an entire guard barracks with a single spark. Kerlead\u0027s specialty lies in explosives and artillery, but is highly knowledgeable about most other heavy weapons. When stealth is not a feasible option, the constantly drunken dwarf\u0027s ideology is to \"level the playing field.\" Literally. With high explosives. His nickname, \"Big-Splash\", actually has more than one meaning. While he is highly efficient with area-of-effect weaponry, he is also infamous with the other instructors for spilling full mugs of beer when he is drinking, and he drinks often without regard for who is around him as well as without fear of reprisal for showing up to lecture, intoxicated, with full mugs in each hand. During his class, students will learn mostly technical information about various explosives, artillery pieces, fuses, and trigger mechanisms. Information includes kill radius of explosives, simple ballistic maths, ammunition types and uses for artillery pieces, and speeds at which different fuses burn in different weather conditions. The culminating event of the class is to make and implement their own chain-explosive devices, which must consist of at least 5 individual bombs linked together and all detonated via a single slow-burning fuse."},{"name":"Kelvius Argent","genderRaceOccupation":"High Level Improvisation: What do to when Plan B, C and D all go down in flames","description":" Middle Aged Male Halfling, scruffy, scarred, and weathered. Often stands on tables. His favorite way to measure his students resourcefulness is to sabotage their efforts towards other classes vital assignments and see how they compensate. Week 1 is about the tools that make any job easy, then he forbids those for the term across the board for his students. Often hated for driving students to tears, madness or embarrassment in their most difficult terms. After he feels he\u0027s thrown enough wrenches in any given classes work, his actions will eventually teach the intended lesson, but this can be as short or as long as the students make it. They just have to keep moving forward by any means. The only true failure is to give up."},{"name":"Sander Thon","genderRaceOccupation":"Convincing your Target to assassinate themselves.","description":" Sander Thon is a gremlin of a person. At his full height he might stand a good 5\u00275\", but his characteristic slouch keeps him just under 5\u0027. His skin is sallow and dotted with liver spots, and one eye drifts lazily about it\u0027s socket. The trick, he tells all of his students, is to convince your Target there is nothing left to live for. It starts, funnily enough, by making your Target very happy using a variety of tinctures and potions brewed specifically to lift the spirits. After a week or two of these raised spirits, life begins to take a turn for the worse for our Target. As you cut off their supply of joy, a beloved pet may die, a confidant may betray them, they may be mocked in the public eye, and they will find themselves isolated. A potion to dull the senses, but not the mind will make the quiet comforts of the Target\u0027s life do anything but. If done properly, a Target will take their own life within a matter of weeks, but if not, don\u0027t be afraid to give them a little push off a high building. As long as there is no evidence of foul play, most people will put the pieces together without a second thought."},{"name":"Hearken Ambrose","genderRaceOccupation":"Power Dichotomy","description":" Hearken is a human male of considerable stamina and charisma; his jokes are as legendary as his exploits. He once ran with an assassin\u0027s guild responsible for dethroning a king. He teaches courses on the importance of power--both in combat and in life. His most ardent belief is that no two different powers are equal and teaches his pupils to fight against unfair odds--how to fight multiple opponents at once, how to assess weakness of character or of body, how to defeat a superior opponent, et cetera. He is a master of the improvised weapon and the most famous tale of his assassinations involves Heaken killing a man with an urn full of his own grandmother\u0027s ashes."},{"name":"Sylux (the Swift)","genderRaceOccupation":"Masking and Unmasking","description":" Sylux is short for an elf, though his legacy makes up for his stature. He is paranoid about being spied upon via magic and has worn various masks for most of his adult life. He teaches courses in types of masks from a thematic standpoint--physical masks are certainly one part, but, he applies the theory to shadows, illusions, his feint-heavy fighting style, even written correspondance. He teaches that everyone wears some type of mask; the trick is figuring out what lies beneath. Hearken for instance, Sylux posits, is actually a dog in a man\u0027s mask--\"how else is one to explain the flaccid-armed technique Hearken uses? He looks like a dog bounding across a yard with a stick.\""},{"name":"Alrick Wiljin","genderRaceOccupation":"Improvised weaponry","description":" A gnome with a permanent grin on his pale face. Alrick is always busy and inseperable from his pet otter \u0027Lutrin\u0027. He specializes and teaches the creation of weapons out of everyday objects and nature. He is best known for his branch-blowpipe and darts, which he can forge in under 10 minutes out of the branch of a black gum tree without tools. One of his more elaborate pieces is a crossbow made out of 8 pieces of silverware and a single cloth. Don\u0027t let the quirkiness of the weapons distract you, because most of them are lethal. \"Everything is a weapon if you want it to\" Taking his class can seem quite dangerous as he likes to test new-made weapons on homemade armour. Despite frequent accidents with experimental weapons neither Alrick nor his students suffered any deadly injuries in the 13 years he\u0027s teaching the course."},{"name":"Quarn son of Nagus","genderRaceOccupation":"Economics","description":" This rock gnome is always dressed in the finest suits. His most disgusting features are his large ears. He has a meticulous set of 285 rules for any and all purchases or business deals. He views all interactions as transactions. Tends to caress the tops of his ears when happy. Class is taught in three parts. First, in a classroom, where he will lecture about how a good grasp of economy can be as useful as any poison. Then students are split into groups and made to run a tavern, each assigned a patron to learn about. Finally, the most promising students are sent on missions of an economic variety - which he gets a percentage of, of course. In his class you will learn how to acquire items needed for any mission. You will learn to bargain, trade, deal and swindle. Buy the loyalty of the targets\u0027 guards. Corner the market in their secret desires and force them to come to you. Once you have their trust, you ruin them. Take their house, income, servants and leave them with nothing. In the end, the target is no longer able to feed themselves reliably, let alone trouble whomever it was who hired you and you have established a profitable - and on paper - legal side business to supplement your income."},{"name":"Vagabond Tarris","genderRaceOccupation":"Suggestion and Persuasion","description":" A jovial halfling, in every way a deliberate stereotype of the wandering minstrel, Tarris claims to have never drawn blood by her own hand. Instead, every kill to her name or that of her students has been the result of some reckless course of action, provoked or inspired by Tarris\u0027s words, with the aid of some of the more subtle charms and compulsions. \"Assassinations are inherently suspicious, but fools chasing fables into the desert wastes are inherently mockable.\" Students of Tarris study ancient legends of lost gold, famous rivalries and their causes, various mind-altering drugs and poisons, and esoteric styles of magic that one could slip into a conversation without notice. She is notorious for her tendencies towards one-upsmanship, something she\u0027s aware of. She often claims she never graduates a student unless they can tell her a story she can\u0027t overtop."},{"name":"Kardal Illuthamae","genderRaceOccupation":"Mechanical Sabotage","description":" A huge goliath, nearly eight feet tall and 400 lbs of muscle, Kardal passes just a bit too well as a humble mechanic. He speaks street slang with the accent of the poor and working class, but with a gentleness long ago bullied out of those who didn\u0027t tower over others the way he did as a child. Kardal\u0027s style is in the failure of mechanical components: wagon axles breaking down in the wilderness, ships breaking apart at sea, traps triggering when they shouldn\u0027t, etc. He is a very patient instructor, and he prefers the hands-on style of learning, helping his students make clocks, springload mechanisms, pressure switches, and all sorts of other mechanical toys. Aside from his famously mellow demeanor, however, he has one other trait students remember him for: an alarming tendency to forget just how much stronger he is than everyone else. Stories abound of him accidentally injuring students by casually handing them hundred pound wheels and mechanisms, or foisting tasks like holding up wagons to those who can\u0027t manage it."},{"name":"Jorell Kazon","genderRaceOccupation":"Unarmed and Improvised Combat","description":" Jorell Kazon is an intensely humorless Aasimar man who by all appearances ran out of patience for his fellow man decades ago. He offers no lectures or practice; everything is sparring, and every mistake made is corrected by having the proper technique performed against the unfortunate pupil. The only reason he manages to keep any students among the living is because he is a skilled healer in his own right. \" Your body is the only weapon you have. All else is only borrowed. Borrow all you can, but master what you own.\" His fighting style is very atypical as compared to the classical ideal of a martial artist. His ready stances are mostly poses that would not look out of place in polite conversation: clasped hands, folded arms, etc. He tends to open with throws, shoves, and two-handed strikes intended to deny opponents the footing they need to fight back, and continuing that momentum into the nearest wall or other environmental hazard."},{"name":"Mali Kcarmb","genderRaceOccupation":"Killing and the Con","description":" Thin and elegant Mali\u0027s walk is more like a glide. He is in the corner of your eye unnoticed unless he needs you for something, like you\u0027ve not sat a test and he needs you to sit it in his office. A relatively kind and friendly man, he makes everyone feel welcome. But thats the lesson he teaches, make everyone love you and they will never suspect you. Mali likes to tell the story of how he once killed a wealthy merchant in an alleyway, then stabbed himself in the side, called for help from the gaurds saying how he and his friend were attacked. Mali had spent 3 months making himself invaluable to the merchant and was left money by the merchant in his will with a note saying \"To the brother I never had.\""},{"name":"Granny Nightdale","genderRaceOccupation":"Rumors and their manipulations","description":" A Venerable elven lady, she looks disarming on her blue cardigan and simple silken robe. However, her vibrant green eyes are still sharp behind her thick glasses, there isn\u0027t much that escapes her; and her tongue is much sharper than most daggers. Her voice carries easily to get pupils, whether it is in the classroom or in the field, but her frquent coughs and ocasional slip to outdated slang make understanding her difficult. Sometimes when your target is too high profile to be able to dispose of it on the more classic methods, so it\u0027s just more expedient to, ahem, \"convince\" them that it\u0027s on their best interests to skip town, or to step down from their public position. Whether it is a blattant lie or an elegant knot of truths, Granny Nightdale has toppled Kings and Emperors by getting the right information to the wrong ears. (or the wrong information to the right ears) She cares about her students as much as a teacher can, and will happily spend some extra time with all those who ask her, but this doesn\u0027t make them immune to her tender mercies. Of anything, she tries harder to turn friends into foes, explaining that they should expect betrayal even from their most reused friends. However, she is not cruel, and those who manage to unravel her web, or even better, use it to further their own ends, receive a pair of enchanted earrings to boost their memory. It helps to keep their lies straight."},{"name":"Thurl deMarque ap Leistairre, esq.","genderRaceOccupation":"Law","description":" Thurl is not the sort of assassin one typically thinks of, all dark hoods and gleaming daggers. He is the type of assassin who walks in the front door, greeted by a nervous looking butler who sweats and smiles as he is seated with you, and then nods pleasantly and shares tea and anecdotes as you sign away your life and everything you hold dear. Thurl specializes in legal assassinations. He hunts his marks not through the streets at night, but through the courtrooms and temples of justice. Should you find yourself his target, the guards will be tipped off about every crime you have ever committed, the judges will be aware of every character foible you posses, and the executioner will be aware of what you did to his daughter. The hands of justice will turn against you. Or, if he cannot find sufficient evidence, you will find yourself in a string of profitable deals, quickly climbing he ladders of wealth and society until suddenly one deal goes sour, and a merchant believes you have cheated him. Once that happens, he tells his friends, end every contract is re-reviewed. They\u0027ll find that the ore you supplied was sub-par, the wine was vinegar and water, the coins you paid were clipped. In class, he shows his students not merely how to kill, but how to work the system, and turn their words into their weapons, killing with tongue and ink while the actual risk goes to the poor guardsman bringing you into trial."},{"name":"Marcus Fletcher","genderRaceOccupation":"Preparation and Planning","description":" The first most common failing of assassins fresh out of college is a lack of foresight while performing a mission. Poison bottle cork get stuck, guard patrols are neglected, escape ropes are too short, the list goes on. The college deemed it necessary, therefore, to include a mandatory class to instill in students the basics of preparation and planning. Marcus Fletcher, having been the bottom of his class and having fought tooth and nail to his current status, learned the lessons he teaches the hardest way possible. Always check your equipment before proceeding. Always have a backup. Always have a way out. He is tough on his students, drilling them relentlessly and meticulously with his rules and refuses any compromise, for he knows that if he does not, he will have learned nothing in his entire career. Since the course became mandatory for students to study, the number of assassins who live beyond their first mission rose dramatically."},{"name":"Archmage Douglas Wilhelm","genderRaceOccupation":"Magical Applications in Assassinations","description":" Sometimes, mages will pivot from their preferred line of study into the Assassin\u0027s College. Wilhelm is calm and collected, even while murdering a person. He teaches his students not only how to abuse their magical abilities in creative ways, but also teaches general magika useage and some specialized magika such as conjuration, manipulation and illusion. (He\u0027s not Archmage for nothing after all). The course encourages students to reflect on their magika, to observe its effects and use it for more than it\u0027s obvious usage. For example, one student learned to choke a target with her own wine by holding the fluid in her throat magically. Another student cast a fury spell on their target during a military inspection."},{"name":"Kim Barth","genderRaceOccupation":"Improvisation","description":" While often looked down upon by many professionals, the ability to find solutions even when things go wrong is an useful skill nevertheless. Barth is excitable and takes a happy-go-lucky, if not completely flippant, attitude during her classes. She will often put her students into scenarios where they must use whatever tools around them to devise a plan within a set amount of time. They are graded on the time they take, the reliability of the plan, and how likely the student would die immediately after executing said plan. The course tends to attract jacks-of-all-trades and those who are mysteriously lucky."},{"name":"Shajar al-Durr","genderRaceOccupation":"Kidnapping and Ransom","description":" A tall dark-skinned human female with regal bearing, Shajar al-Durr may seem like a genial teacher from those who haven\u0027t taken her class, but any graduate can tell you (potentially through tears) of her sharp and personal lessons. Having taken one king ransom in her past, Shajar al-Durr does not hesitate to take her student\u0027s loved ones for object lessons in class. Class description: The fine art of assassination is merely one tool of many to achieve your goals. Many would give their lives for a loved one. Kidnapping and ransom can give you a cover for political assassinations, or you can keep one of your successfully killed subjects seemingly alive for months, or, if you prefer a more manipulative approach, kidnap (take for treatment) a royal and act as their liaison while they are \"ill.\""},{"name":"Catherine Breshkovsky","genderRaceOccupation":"Mundane Personas","description":" Breshkovsky, a stout dwarf, exudes a matronly aura. Nicknamed \"The Babushka\", most students love her class. She is always saying that \"The best assassin is the one they least expect, and nobody even notices an old lady with a face like a wrinkled apple.\" She has perfected her grandmotherly appearance and down-home appeal and encourages each assassin to find their \"mundane persona\" to extend into the world when being a polished assassin would stick out. She also recommends ways to hide your strength, for example, where with the Babushka you would see a rotund older dwarf woman bent with age, hauling some sticks, you do not process that her fat is actually entirely muscle, and her sticks are bristling with her swords. It is certainly jarring to see her demonstrations in class, where, in mere moments, she goes from hobbling about to a blurred whirlwind of blades and then back again."},{"name":"Sedrick Chancel","genderRaceOccupation":"Hideouts and Sanctuaries","description":" A middle aged man with a bum leg and a prosthetic hand made of pitted metal. Despite his gait and seriousness he is rather charming and must\u0027ve been quite handsome in his younger years. Word around the academy was that he was quite an accomplished killer until an ambush involving his safe house being compromised took his physicality from him. He is now the foremost expert at the academy at building and maintaining the secrecy of networks of hideouts and sanctuaries to organize and supply assassination operations all across the country."},{"name":"Shagram Doon","genderRaceOccupation":"Enticing the Masses and Guiding the Unguidable","description":" His view: \"Why get your hands dirty if you can convince a crowd to do the work for you?\""},{"name":"Rickert Oswald","genderRaceOccupation":"Leaving a Mark","description":" Rickert is a tan skinned human, wrinkles just starting to line his face and the color fading from his hair. This isn\u0027t uncommon with assassination instructors, as typically one doesn\u0027t become a teacher until they have retired. He teaches an art so often forgotten in a profession typically about covering up the messes they make, which is how to make an assassination look as grisly as possible. Clients who want their enemies to know they mean business seek him and his style out, as the body is found with marks of torture, or displayed in ways that invoke true horror. His most famous tale is a political assassination where he had managed to cook and prepare all the organs of his victim and lay them out at his estate for a dining party to find mere hours later. He enjoys telling this story as his class is eating lunch for the day, as he greatly enjoys the reactions. \"You don\u0027t need to make anyone suffer. As long as the remains make it look like they did, no one will even want to know the details.\""},{"name":"Gorg Aselif","genderRaceOccupation":"From Sewers to Skylines: Blending in and getting out in all occasions","description":" While there are many classes and ways to learn to get in and out of a kill, Gorg\u0027s class is one of the few that teaches you how to get from the sewer at noon, into the fancy ball before nightfall, and out the front gate a little past midnight while looking and smelling like you were invited. His tactics use previously learned material, such as moving through sewers and climbing buildings, and mixing in new methods such as stashing clothes and planting false evidence. The course also teaches other diversions, when to keep a low or high profile during an event, and how to properly judge the distance from a rooftop to the ground and tends to attract students that are less suited for an actual fight and more equipped to stir up a panic and leave. Gorg is a gnome with a varied past, supposedly raised by goblins and trained by noblemen, he teaches most lessons in the field, meaning in the sewers or on a roof, and often gets the class to go to royal balls, for free of course."},{"name":"Dedon Greschmach","genderRaceOccupation":"Tailing","description":" Greschmach is a short, dark-haired half-elf who teaches how to follow a mark in cities, towns and ports. He teaches disguise, distraction and movement techniques so his students can follow anyone through any crowd. His upper-level courses also include crowd theory, and there are rumors that the riots in Sevendar last autumn were his doing..."},{"name":"Maldova \u0027Quicart\u0027","genderRaceOccupation":"advanced wet-work and murder scenery","description":" Quicart was the name affectionately given to a young, Halfling, BnE and pickpocket artist with no father, and a whore of a mother. He was a prodogy, quickly surpassing long time felons and finding his niche as a reliable framing artist, and quick slit specialist. After half a lifetime murdering for money, he was recruited by your prestigious school, to teach and deal with any...liabilities. Seen as one of the more engaging teachers, Maldova entertains his classes with live demonstrations and games of find the teacher. He can always be seen picking at a pomegranate with any one of his ornate throwing knives, or charmingly whispering in any of the curvier students ears."},{"name":"Sir Willem LaFortier","genderRaceOccupation":"Last Resort Swordplay","description":" A large but old human man, built like a buffalo, and with grey hair. A laboriously curated handlebar moustache exquisitely curled. He talks like a gentleman, acts like a gentleman, and expects great honour and decorum in his class. Looking for busywork after retirement, he is employed due to his skill at traditional swordplay - an assassin\u0027s final recourse."},{"name":"Blake \"Shadowblade\" Carn","genderRaceOccupation":"Sleeping targets","description":" Half-orc man, Blake moves like a cat, utterly silent, and has a penchant for surprising his students at innoportune times. Though in class he is deadly serious, outside he uses his skills to play playful and innocuous pranks on both students and teachers alike. His class focusses on dealing with situations where an assassin has to deal with sleeping foes, and ensuring constant stealth and awareness."},{"name":"Freya Elardi","genderRaceOccupation":"Information gathering","description":" A high elf woman, Freya has flowing blonde hair, stunning good looks, eyes like an eagle, and a smug egotistical attitude. She teaches everything from spying to research to torture, in a varied yet harsh curriculum. Freya has spent hundreds of years perfecting her class, and brokes no failure from her students."},{"name":"Lord Ashcrofte","genderRaceOccupation":"Rumor Mongering","description":" Lord Ashcrofte is a tall, thin man of somber demeanor with a knack for charm. Having spent the majority of his youth in various noble courts, he has developed the acquired taste for politics, with especial love for the power of whispers. Lord Ashcrofte will teach these skills to his hand-picked students for a price, a favor to be claimed at a time of his discretion. Lord Ashcrofte instructs individuals in the ways in which they can become a trusted confidant, an ear to whisper into, a shoulder to lean on, a mistress to the target - whatever it takes to get the information which is needed. After all, everyone has secrets which can be advantageous to the holder."},{"name":"Quintius Auralea","genderRaceOccupation":"In Plain Sight - The Fine Art and Etiquette of Honorable Murder","description":" \"The way to a man\u0027s heart, they say, is through his stomach. But if you want to reach his brain, I recommend the eye socket.\" The mechanism of the honor duel exists in nearly all cultures, and the daring assassin may bend it to his will to kill his target publicly, decisively, and (most importantly) legally. Quintius, once the Count of Imperia, is a master of this technique, which involves drawing the target into an honor duel through social maneuvering. And, of course, winning the duel. He presents himself as a squat little pudding of a human with a ruddy complexion and drooping eyes, which he later reveals is part of the game. \"The target must see you not as a predator, but as prey. Draw them in, then, like the viper, strike. The involvement of disguises, aliases, and poisons where necessary are recommended, and the establishment of a reputation is the death of this art.\""},{"name":"Janus of Undertown","genderRaceOccupation":"Contacts and Conspirators","description":" Once a member of the Thieves Guild (or two, or three), Janus began applying his talent for gathering and organizing people to the cause of murder only a few years ago. Strangely, the course of study is taught by a different person each day, reading from a long scroll. \"The greatest assassin,\" Janus writes, \"are never seen and never heard. This might imply stealth, but simple absence can suffice.\" The class describes establishing and running relationships with a variety of agent types, including fanatics, patsies, hirelings, and even true partners."}]