[{"name":"Who are these demonologists, shadowhunters, crusaders, and exorcists?","genderRaceOccupation":"The old priest winks, drains his cup of wine, and spryly hops off his bar stool. \"Come on,\" he smiles, \"if we go now, I can get you in and out of the temple\u0027s crypt before the midnight devotions begin.\"","description":" Last week, we made some fiendish villains, so it seems fitting that we collect some NPCs who oppose such beings. These NPCs could run the gamut from eager allies to dangerous foils, but they should not be sinister on all accounts (to distinguish them from villains). The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples."},{"name":"Brother Calymus","genderRaceOccupation":"Male Human Scholar","description":" A priest of the First Order of the Light, Brother Calymus is a spry, balding old man who\u0027s been wandering the world for half a century, seeking out ghosts, survivor\u0027s of near-death experiences, and other strange phenomenon attributed to the Spirit Realm. He\u0027s written two popular books on the topic and is happy to talk at length about the mysteries of death, especially over a cup of strong red wine. Whenever you run into Brother Calymus in a tavern or brothel, he\u0027s bound to know where some dark presence is lurking nearby in the world (and likely, he\u0027s eager to investigate once he finds the right help)."},{"name":"Sir Harrisen Figg","genderRaceOccupation":"Male Human Knight","description":" Tall and handsome with long dark hair and neatly-trimmed mustaches, Sir Harrisen was the heir of House Figg, but after the strange circumstances of the death of his sister, he renounced his inheritance and left his family to join the Watcher\u0027s Swords, pledging his life to hunting down enemies of the Moon Maiden\u0027s church. Figg has been particularly prolific in seeking out and destroying demons who reveal themselves in the world. He carries an ancestral sword that had been called Greatknife which he has renamed Fiendbane. When you meet him, you\u0027ll find he\u0027s a bit stiff, but he means well."},{"name":"Sister Dierdre","genderRaceOccupation":"Female Human Priestess","description":" Sister Dierdre\u0027s wide green eyes smile, despite a sadness lingering about her young face. She often fiddles with her long blonde braid when she speaks, especially if asked about her past. Dierdre was the promiscuous daughter of a high-ranking soldier, who couldn\u0027t seem to keep herself out of trouble, so her father sent her away to join the Second Order of the Light. She always approached ghosts and demons with fascination and, of late, has discovered her own talent as a medium between the world and the Spirit Realm."},{"name":"Lady Joenna Longfisk","genderRaceOccupation":"Female Human Knight","description":" Clad in mail and leather, Lady Joenna Longfisk is a tall maid with short-cropped auburn hair. She took up the sword against her father\u0027s wishes, following her young liege lord to battle in his fateful campaign against the Ice Clans. The campaign was largely successful, save the death of her liege lord. Too proud to return home, Lady Joenna pledged her sword in the service of the Storm King\u0027s Temple of Winter. Never at home among the men of the temple guard, a powerful priestess who had befriended her sent Lady Joenna back among the lands of the Ice Clans to search for an ancient shrine to the Storm King that\u0027s been lost for centuries."},{"name":"Goodson Harbert","genderRaceOccupation":"Male Human Exorcist","description":" With a missing eye and a wooden leg, Goodson Harbert cuts an intimidating figure, especially for a priest. He reeks of booze and speaks in a growl, but he\u0027s a warm soul beneath the gruff exterior. People say Harbert has been to the Hells and back, and no one who sees him would dare question that rumor. He\u0027s never risen high among the Goodsons of the Traveler, but he is respected by all within the church\u0027s hierarchy. If you have to face a demon, a ghost, or a questionably-sourced cask of ale, you\u0027ll want Harbert\u0027s hatchet and his box of potions and powders at your side."},{"name":"Bifgard Stonehouse","genderRaceOccupation":"Male Dwarf Crusader","description":" His flame-orange beard a shaggy tangle, Bifgard Stonehouse is quick to draw his axe at the first whiff of goblins, ghosts, and wights. For years, he has been working in stages to clear the ancient dwarf-hold of Silverden of goblins and undead almost single-handedly. He comes down from the mountains twice a year to re-supply his camp and make half-hearted attempts at recruiting some help in his task. Bifgard speaks very little until he\u0027s had a few ales, and then he speaks too much–becoming angry with himself (and anyone around him) whenever he lets slip one of Silverden\u0027s secrets, setting himself to perform an awful penance to atone to the Great Smith."},{"name":"Quelma Starcircle","genderRaceOccupation":"Female High Elf Shadowhunter","description":" Quelma Starcircle remained in the World when the last of her people left centuries past, her task still unfinished. Her brilliant blue eyes are patient and her manner is as soft and straight as her flowing silver-blonde hair. With her sword and her bow, Quelma has dogged the arch-lich Arameedi from one end of the World to the other. She has slain it six times, and six times the lich has risen. Quelma will continue her dangerous game of cat-and-mouse with Arameedi until she finds the hiding place of its phylactery or until it destroys her."},{"name":"Goran the Grim","genderRaceOccupation":"Male Human Preacher","description":" A devotee of the Southron pantheon, Goran spends his days preaching the word of the God of Death in the market square (\"Prepare! Seek Death on your own terms, lest Trickery guide your path or Ruin take your strength!\"). Black-robed, gaunt, and pale with dark circles around his dark eyes, Goran\u0027s deep voice booms across the square beseeching all who will listen to make time for meditation on Death every day. Goran also sells a variety of amulets and potions that will ward off the curse of undeath, so that Death may be met peacefully and honorably."},{"name":"Al-bah Zorimun","genderRaceOccupation":"Male Human Paladin","description":" Al-bah Zorimun is a broad-shouldered knight who wears light copper scale armor and always carries a wicked scimitar on his left hip and several short spears slung across his back. Zorimun\u0027s head is shaved and his mustache is long and waxed, though he often keeps both hidden from the sun with a white cotton cowl has he wanders the desert on his trusted mare. Every sun up and sun down, Zorimun prays to the Sun God asking the First Light and the Last Light to touch his flashing blade that he might strike down the dark followers of the Dead God. Zorimun is quietly going about his bloody work, seeking out the tent-camps and caves where the followers of the Dead God hide."},{"name":"Inquisitor Marsolis","genderRaceOccupation":"Female Tiefling Priestess","description":" She tells her guests her name before they see her - Francesca. She lures them into confidence with a voice full of contrite abasement, sexual undertones, knowing humor. She laughs, she cries, she tells them she\u0027ll be flogged if she doesn\u0027t get the answers she needs. Whatever works. When she can, she walks behind them unseen, the soles of her boots whispering on the flagstones of her clean, spare chambers. Just as with any other tool, she uses violence sparingly and judicially... but first, if nothing else works, she steps from the shadows and pulls the hood from her head. When they see her crimson skin, they begin to scream; when they see the jet black ram\u0027s horns that curl from the back of her head and over her shoulders, they begin to confess."},{"name":"Sir Nicolas of Eastmark","genderRaceOccupation":"Male Human Sorcerer","description":" Sir Nicolas is a peculiar sort of knight; he doesn\u0027t joust, or compete at the sword, or do any number of things that your average everyday knight would do. Instead, he wears finely tailored clothes, tasteful yet expensive jewelry, and personally oversees all of the kingdom\u0027s dealings with adventurers and would-be heroes. Having retired from adventuring himself at the ripe old age of 45, his dark hair (with gray wingtips, lovingly maintained) and trained grey eyes are a fixture around the palace. He prefers to do things the easy way, rather than the way that involves copious amounts of explosions, but make no mistake: he isn\u0027t called the Mage Knight of Eastmark for no reason."},{"name":"Dame Elmeara Dragonback","genderRaceOccupation":"Female Dwarf Paladin","description":" The first impression most people get of Elmeara is her armor: a set of brilliant white enameled plate, which under sunlight shimmers with a faint opalescence. Most trained warriors, sellswords, and hungry bandits scoff at such extravagance; after all, how experienced can one be without any battle damage on one\u0027s armor? Unfortunately for them, they are asking the wrong question. The right question: How good does Dame Elmeara have to be to come out of every fight with immaculate armor? The right answer: Very, very good."},{"name":"Alexei van Valerya, the White Hat","genderRaceOccupation":"Male Tiefling Assassin/Guard Captain","description":" Assassination is an art, and a difficult one at that. For every noble who travels in an open carriage through a city filled with tall buildings, there are five more who don\u0027t eat their breakfast until their entire court has a bite first. And yet, a select few kingslayers still manage to turn a profit. Alexei van Valerya knows the art of killing important people better than any other bodyguard, mostly because up until a few years ago, he was on the side of the artists. The ex-assassin-turned-security-chief cuts an unassuming figure; at 5\u002710 he\u0027s not the tallest, and at 160 pounds he\u0027s not the bulkiest. What he is, is effective. From his swept-back black horns to his toes, Alexei is all business. Tales around the palace say that he personally kills at least one foreign spy before breakfast, and two before lunch. He fights with his bare hands, or with garrote wire, or with long, ten-inch dirks that he wears on his back, and when he does, he is completely silent."},{"name":"Sygfellow Ottman","genderRaceOccupation":"Male Dwarf Stonewarden","description":" Sygfellow comes from a long line of stonewardens whose job it is to walk the long paths between the eastern brunmallow and northern grasslands where brigands often lurk seeking easy prey, or roaming barbarians encroach. Because of the fact that he\u0027s constantly on the move going to town to hamlet, he has an intimate knowledge of the inhabitants of each and is often sought out for news and tales and, when the wine is particularly fine, a song. Syg is the fifth generation of his family yo take on the stonewarden mantle. Syg stands four feet, nine inches tall and has long brown hair and amber eyes. Syg is so used to traveling the long trade roads that he travels quite light and can live fairly easily off of what the land provides. He knows every nook on the forest\u0027s edge where he can find safe respite and where to find the best fish and game. He\u0027s seen these roads to often and knows the paths so well, that he can smell when something is amiss. You\u0027ll know him by his rough green cloak and his compact yew bow that carries with him, and if he asks you your business, you\u0027d do well to answer wisely. Sygfellow does not suffer fools kindly."},{"name":"Sir Aaron Irkell, the Beacon\u0027s Light","genderRaceOccupation":"Male Human Paladin/Cleric of Torm","description":" Sir Aaron stands at an average height of just 5\u00279\". His blonde hair is incredibly short, and he wears long purple robes under a breastplate emblazoned with the seal of Torm. You can find him, more often than not, tending to the wounded Lord\u0027s Alliance soldiers in the med tents of Qui. His words are brief and to the point, but he is kind and well-mannered. He heads a church of Torm in the city of Qui called \"The Beacon\" where he teaches mercy, healing and kindness. Those who meet Sir Aaron on the street or in his church will often find him lost in thought, dwelling on those he could not save and praying for those he is still trying to save."},{"name":"Brother Kiniffer","genderRaceOccupation":"Male Human Crusader","description":" A paladin of torm and war veteran, he wears a leather armored kilt and a light leather tunic at all times. He has seen more wars and single combat encounters in his life than most can honestly speak of, and its left him a bit crazed or blood lusted, its hard to tell. His eyes are wide, and his head\u0027s got patches of hair all about it in between the patches that have either fallen out or been ripped out. He is nearly maniacal in his desire to drive evil from the land and he\u0027s happy to engage in long conversations with those who would help him do it. You can find him training with the other brothers of the First Light Monastery, east of the High Forest."},{"name":"Talal","genderRaceOccupation":"Male Half-Elf Mystic / con-artist (neutral selfish)","description":" Moral ambiguity personified with sandy blonde hair and a charming smile; a wink of his green eyes invites you into his secret. Most faiths have a secret cabal wherein special rites, prayers, and practices are rarely disclosed to the layman. However as a man of half truths and half lies, Talal can fit in to any one of these. Talal\u0027s specialty is knowing where these rituals take place and either owns or at least knows the location of cabalistic items of power.  "},{"name":"Keandra","genderRaceOccupation":"Female Tiefling Warlock / demon hunter","description":" Not everyone believes that hunting demons is a fulfilling career path. Thus was the belief of the arch devil Ezatan, who therefore sub-contracted his end of a deal to a young and desperate tiefling girl. Now that she is older, Keandra hunts demons with efficiency and indifference. Having no personal vendetta against the abyssal spawns, she finds no joy ridding the world of their evil. To her, it\u0027s just a job."},{"name":"Balchenod the White","genderRaceOccupation":"Male Tiefling Investigator","description":" The body was finally still beneath him, but he could feel the blood soaking into his pants. Still, he held the knife, hilt against the body\u0027s back, a few more seconds until he was sure it was only his own breath rasping in the dark cellar. \"Balch, you\u0027re getting sloppy,\" he muttered to himself as he willed his left hand to release the quarry\u0027s horn and slowly withdraw the ten inch dirk. The darkened skin of the tiefling on the floor seemed to go ashy in the inky black pool of its own blood. He\u0027d earned this bounty, but at what cost? Licking his lips unconsciously, he knew the self-flagellation tonight would be particularly intense."},{"name":"Krind Steeltoe","genderRaceOccupation":"Male Dwarf Ranger","description":" A long braided brown beard and piercing blue eyes are the first thing you\u0027ll notice when see this dwarven ranger. He initially has a gruff demeanor, but becomes friendly enough once you known him for a while. A follower of Marthammor Duin, he aims to explore new lands and protect his fellow travelers and any people who he might meet on the road. Accustomed to hilly terrain and mountains, his recent travels though an unholy mountain pass have led him into combat with wicked undead far too often for his tastes, and he would welcome any help in exterminating this threat to the locals and travellers."},{"name":"Skrazano","genderRaceOccupation":"Male Kobold Soldier","description":" This loyal soldier is no ordinary kobold. Although he is at present nothing more than a soldier, he has been handpicked for the elite guard due to his skill and bravery in combat. Through his veins runs a sliver of metallic dragon blood, granting him power beyond that of an ordinary kobold. He is dedicated to his duty and speaks very little. And when he does speak, he speaks softly, barely more than a whisper."},{"name":"Aurak Gnar","genderRaceOccupation":"Male Dragonborn Paladin","description":" Aurak Gnar is a 6\u00278\" golden metallic dragonborn. Wearing shining plate armor, wielding his silver sword and garrisoning his shield. Aurak is stern and outgoing, taking command where possible. He prefers to lead from the front and take a cautious approach to most things. Having survived numerous battles where patience, not the might of a sword arm, was the deciding factor. He is merciful to most beings, believing that everybody has the chance to turn to the light. However he acts without mercy or quarter to beings of evil and those who help them."},{"name":"Sivak Nala","genderRaceOccupation":"Female Dragonborn Priestess of Bahamut","description":" Sivak Nala is a fierce silver dragonborn with a height around 6\u00273\". She wears simple armored robes and wields two short swords. Despite her cold outwards appearance, she is deeply caring for those in need and those who cannot defend themselves from the horrors of the dark. Her shy calm and graceful demeanor do not carry over to those of foul natures, even if they aren\u0027t innately evil beings. Driven and focused to the task at hand, Sivak Nala hunts down the dark forces of the world with equal measures of grace and cold malice."},{"name":"Bozak Rhogar","genderRaceOccupation":"Male Dragonborn Knight","description":" Bozak Rhogar is large, even for a dragonborn. Standing at a towering 6\u002711\", and seemingly built out of a bronze wall, Bozak Rhogar is a force to be reckoned with. Known as a dispassionate fellow, Bozak holds no quarter to any who hold themselves outside of the law, or worse, the paths of darkness. Beneath his bronzed exterior lays a heart of, more bronze. Bozak is quiet and pensive, often going hours or even days without speaking. Preferring to instead answer with a nod, grunt, or silver maul."},{"name":"FlyHandle","genderRaceOccupation":"Male Aarakocra Mercenary","description":" A member of a radical mercenary guild, FlyHandle speaks very little, takes orders, and has little qualms as long as there is pay. He builds trust with long term contractors, and will slowly open up about his opinions and knowledge. He wears light armor, can class as a barbarian, and prefers spear-like weapons."},{"name":"Cadrielda Sabreen","genderRaceOccupation":"Female Human Shopkeeper","description":" The owner of Cadey\u0027s Trinkets, an arcane pawn shop carrying a variety of handy gadgets and minor magical items. Her long black curls come nearly to her waist. She wears large round spectacles and walks with a slight slouch, but she is otherwise modestly attractive. Cadrielda is shy and fidgety, and seems to consider interacting with customers to be a necessary evil. She can barely stay afloat because she is always tanking in stray animals. Unknown to most, she was once a druid, but was banished from her circle for dabbling in science, and many of the goods she sells are actually of her own invention."},{"name":"Kaivoth the Tall","genderRaceOccupation":"Male Half-orc Hunter","description":" A massive, late middle-aged half-orc with scarred gray skin. He lives as a hunter and adventurer, and is known to be a man of very few words. He carries a locket with a tiny portrait in it, but refuses to say who is pictured there, and worships an obscure dwarvish deity but refuses to say why. Though he normally works solo, a couple rounds of ale might convince him to work alongside the party."},{"name":"Lazloch Sylveron","genderRaceOccupation":"Female Half-elf \"Bounty Hunter\"","description":" An orphaned teenage tomboy living in the slums of a large city. She was once a skilled pick-pocket, but after reading a book by the philosopher Picurales, she underwent a kind of conversion and decided to use her talents for good. Now she is determined to become the world\u0027s most famous bounty hunter. She cuts her blonde hair boyishly short and dresses entirely in black leather, as this is what she imagines a bounty hunter is supposed to look like. If pressed, she will insist that she is a full-blooded elf, though she obviously has some human ancestry."},{"name":"Name Unknown","genderRaceOccupation":"Male Human Monk","description":" A monk of St Cuthbert, he took a vow of silence at the age of 10. He has yet to speak and is reaching into his 70\u0027s. With his ageless body achieved at 10 he has not aged a bit. He spends his life guiding those who are lost in the woods near his Monastery to safety."},{"name":"Stakta \u0027Whistletongue\u0027","genderRaceOccupation":"Female Dragonborn(Brass) Captain of the Guard","description":" Stakta spent many a year as a thief, working in the underbelly of the city. One day she was given a job to assassinate a cleric of Bahamut. Not knowing this clerics strength, and falsely assuming in his age he was feeble and unable to defend himself she took a direct approach. She was swiftly beaten, and while lieing near death on the street the cleric began to heal her. Even though not a minute earlier she had tried to take his life, he was ensuring her survival. Thus began her repentance, and her worship of Bahamut."},{"name":"Vendrick \u0027Wildheart\u0027","genderRaceOccupation":"Female Gnome Bloodhunter","description":" A powerful bloodhunter, her first kill at the age of 12 she specializes in wielding weapons of uncommonly large size for her race. Constantly under the effects of an illusion she appears before her prey as an innocent human child. She preys specifically on demons, or cursed that hold weapons or items of sentience, even if they\u0027ve no other power to speak of. She\u0027s slowly expanding her circle of \u0027friends\u0027."},{"name":"Torbarth \"the Heavy Handed\"","genderRaceOccupation":"Male Half-Orc Paladin","description":" Among paladins, Torbarth has become a bit of a laughing stock. His approach to rooting out evil and corruption is ask those under scrutiny bluntly: \"do you serve the forces of order and goodness?\" In the case of a no, or an unconvincing response, Torbarth has been known to lurk just over the shoulder of the person in question, making note of their every decision. He has been known to keep this up for upwards of a fortnight before making his final judgement and moving on."},{"name":"Mill Burray","genderRaceOccupation":"Male Human Exorcist","description":" Genial and entirely average looking, Mill Burray makes a career of exorcising ghosts. His \"work\" uniform consists of an off-white jumpsuit, a backpack overflowing with dubious looking equipment, and his trusty ghost-dowsing rod. With proper payment delivered half on commission and half on completion, Mill will dowse any haunted site for supernatural entities, and capture them in spirit proof vessels using any number of appropriate rituals or techniques."},{"name":"Mekaela \"the Unremarkable\"","genderRaceOccupation":"Female Elf Demonologist","description":" Although nobody could tell you precisely what she looks like, Mekaela has built quite the reputation as a bottomless font of knowledge on demons and the abyss. If asked, she politely diverts any questions about her uncannily unremarkable appearance by saying \"it\u0027s just a precaution, strictly necessary in this line of work.\" Often the only thing that Mekaela will ask in exchange for a bit of information on demons - or any demon in particular - is that her client keep her informed of any new relevant knowledge they gain. That, and that they spread word of her services, as she is so unremarkable it is understandably hard to do much networking in person."},{"name":"Who are these crones, enchantresses, and fortune tellers?","genderRaceOccupation":"The witch smiles gleefully as she squishes the caterpillar between her fingers. \"Into the pot!\" she smiles as she tosses it into the bubbling, hissing liquid.\"","description":" Witches, seers, fortune tellers, and diviners are staples of fantasy worlds. Individuals who have glimpsed dark secrets or who can peer into the future. Sometimes these are villains, but most often they are following some agenda of their own that is unwholesome if not wholly evil. The NPCs don\u0027t have to be developed deeply, but they should have enough suggested content that any DM could quickly fill in what\u0027s missing. I\u0027ll post a few examples. (These may or may not have drawn some inspiration from these tables and these tables.)"},{"name":"Myrta","genderRaceOccupation":"Female Human Crone","description":" Myrta learned her craft from a half-elf witch who came to her aid after she was evicted following the death of her fourth husband. This cackling old crone saved Myrta and her young daughter from a beggarly life, teaching them spells that gave them the power to manipulate men\u0027s minds and the forces of nature. Since being chased from town after a few short years of scrounging in the allies, Myrta\u0027s made a cozy little lair for herself and her grumpy familiar Ormund the Owl in a cave in the swamp. She\u0027s a tough old bird, and she\u0027ll happily mix up a poison or curse an item for you in exchange for a few silvers. Her mistress told her about the staff of Hecate, the first witch, and Myrta\u0027s been gingerly probing for lore relating to the staff ever since. She\u0027s currently mixing up a terrible poison made from blindworm\u0027s sting, dryad\u0027s thorn, and stirge\u0027s foot. Who the poison is intended for is anyone\u0027s guess..."},{"name":"Marta","genderRaceOccupation":"Female Human Enchantress","description":" Marta is the witch Myrta\u0027s beautiful daughter by her second husband, and she learned the craft as a teenager on the streets from her mother. Marta left her mother\u0027s tutelage to marry some handsome lord, but he died under mysterious circumstances. When suspicion turned on Marta she fled to the mountains where she lives, conducting seances, reading the palms of travelers, and seeking the soul of her dead husband. Her familiar is a talkative snake named Hiss-Fiss, and her other companion in the mountains is a giant bat named Hipp-Fipp, whom she rides to and from the valley to her hidden lair. Marta has a nervous twittering laughter that shakes her pleasant features in an unpleasant way. She also has a real talent for love potions. Most men who drink these potions fall in love with Marta herself, but that works for her. She enjoys taking new lovers. She also enjoys casting old lovers from her mountaintop home when she\u0027s done with them."},{"name":"Morta","genderRaceOccupation":"Female Half-Elf Bogwitch","description":" Morta is the most mysterious member of the coven. She\u0027s half-elven with a very unfortunate wart on her nose. She\u0027s quite good at preparing alchemical concoctions, from magical cure-alls to pyrophoric substances. She lives on an island in the swamp and transforms into an owl to get from place-to-place. If you let on that you know magic, she\u0027ll pick your brain for ritual lore before letting you go. Once she let\u0027s you go, there\u0027s a good chance she\u0027s going to hunt you down with her bow and her spear. If you get far enough away, she\u0027ll transform into a horned owl and track you down. She consorts with a gleeful fire elemental familiar who delights in burning things and whom Morta is constantly trying to restrain as she prefers to kill things herself. Morta delights in the thrill of the chase and the adrenaline rush of making the kill to end a successful hunt."},{"name":"Laki","genderRaceOccupation":"Female Human Shadowseer","description":" Old Laki is a bent-backed creature of routine who knows the most unexpected things. Every morning, she rises to a cup of tea and dried fish before her morning walk amongst the beaches and meadows of the rugged coastland. Hobbling along with her crooked cane, she collects bits of driftwood, grasses, herbs, and shells for her fires. She sleeps the afternoon away under the watchful gaze of her raven, and receives guests in evening. All through the night, she prays to her dragon gods and works her spells, divining answers to her guests\u0027 questions by interpreting the shadows the flames cast on her tent walls."},{"name":"Margy the White","genderRaceOccupation":"Female Human Fortune Teller","description":" Robed in black with dark brown hair and tan skin, one may ask why is she called Margy the White? This sturdy middle-aged woman offers readings in her kitchen, during which her voice deepens and her face takes on a ghostly pallor. The local priest has been ranting about Margy being a fraud for decades, but that never seemed to bother Margy. She keeps offering to do a reading for a silver to any who ask and who have good manners."},{"name":"Glyddon Silverstrings","genderRaceOccupation":"Male Half-Elf Singer","description":" Glyddon Silverstrings has a handsome face and a golden voice and a pitch-perfect harp. He has recently been wandering the villages of the Borderlands singing for his supper and offering simple healing as his meager skills allow. Once in a while, he has had dreams that offer him glimpses of the future, including foreseeing his own mother\u0027s death while a youth in Brightharbor. After she died, he has been an unsettled rascal, never staying in one town for long. Some say he is wanted for the murder of a Southron merchant prince whom he tried to warn about his enemies\u0027 plans."},{"name":"Deepbrother Harridan","genderRaceOccupation":"Male Human Prophet","description":" A gaunt priest of the Sea Queen, Deepbrother Harridan preaches her dire message of darkness and suffocation for those who do not submit to her will. Harridan himself was the sole survivor of a terrible shipwreck as a young lad. So moved by his luck, he pledged himself as a deepbrother of the Sea Queen, claiming to have received visions of her plans when his lungs were filled with seawater. He has \"drowned\" himself dozens of times since, taking on seawater and asking that his assistants revive him. Recently, he has predicted a black vengeance will rise from the sea to consume those in the city who refuse to renounce their devotion to the Light."},{"name":"Borovurnum Jurtha","genderRaceOccupation":"Female Human Sailor","description":" On the languorous and rain-soaked coastlines there is a rowboat tied to a rotting pier somewhere. On this rowboat is Borovurnum, never tired, never hungry, with fire behind her huge pupils and teeth and deep blue tattoos of wide-eyed snakes up and down her muscled arms. She will row you to the nearest fishing hamlet, clam shack, or charcoal-burner\u0027s hut for only some conversation in exchange; and during the journey she will offer you to smoke from her pipe. If you interest her sufficiently with information—and, more importantly, manage to draw a mouthful of smoke from the pipe—then she will regard you highly and pleasantly, offering to row you anywhere you wish or could possibly imagine. However you will smell of, and constantly spit up, liquid smoke and heatless fire for a few days afterwards. Further, you will always hear the slight splashing of oars on water from inside your head, your appetite will be subdued and then all at once entirely gone, your eyes will feel hot and swollen."},{"name":"Malfra","genderRaceOccupation":"Female Human Enchantress","description":" Ever since Malfra was born, she felt different from the others living in the small hamlet. Her natural magical talents made her feel like an outcast. As a young woman she met her one true love. He was a soulmate: finally someone with whom she could share her gift of magic. One day, he gave her the most beautiful flower she had ever seen as a token of their love. When their relationship ended on his behalf, Malfra turned bitter. She grew envious of other young maidens who were happy with their lovers. Fleeing from her home and retreating into the neighboring woods, she set out to destroy their happiness. When young couples wander too close to her confines, she enchants the young maiden in love and turns her into a bird, to be locked into a cage at her hovel. Only the flower that reminds her of her long lost love will break the spell."},{"name":"Norgith the phasing","genderRaceOccupation":"Male githzerai wanderer","description":" Norgith is a tall, gaunt, hooded figure, always wandering through dark woods or climbing distant mountains, though sometimes he is seen passing through alleyways in bustling cities. Little is known about him, but whenever he is encountered, he is amicable, though impatient. He seems to know everything, and has an answer to every question, but he always speaks enigmatically, and also always claims only to have a few moments to talk. When people try to find him again, even moments later he is gone. No one ever sees him coming, and no one sees him leave. It is said that he phases across time and space, observing the world, but not staying in any one place for long, which is how he gained his knowledge."},{"name":"Giddy Cremm","genderRaceOccupation":"Female Half-Orc Suntouched Cragwitch","description":" She clings to the boulders and cliffs of her mountain home with hooks made from steel, woven through her fingers and along her arms with lengths of braided leather, hemp and hair. She wears the sun as a cloak, the wind as a bonnett, the sky as a dress. Her laughs (and her deep, unsettling coughs) echo for improbable distances, and it\u0027s always wise to make camp when you hear them, and soon; should there be a pot of something tasty awaiting her when she comes calling, she might be willing to overlook a trespasser on her land."},{"name":"Marin of the Lupines","genderRaceOccupation":"Female Human Oracle","description":" She lives in a sturdy cabin, tucked between two boulders on the edge of the wood, where the tall trees give way to to undergrowth and wildflowers. During the long springs and summers and autumns, she can be found wandering the the threshold - the divide, she calls it - harvesting the few Lupines that stray under the shade of the foliage. These, she says, grow with the shadow in them. She boils them in springwater and honeycomb, and as she whispers her hidden words, the bees from the meadow crawl through her knotted hair and across the glassy mirrors of her sightless eyes. Those who watch find it unnerving, but the wise know that the bees keep secrets."},{"name":"Twisted Tether","genderRaceOccupation":"Awakened","description":" She loves questions. Her only request for repayment is \u0027to discover something that she has not before\u0027. This can be a song, a riddle or simply showing her things she has not seen - be that with books, paintings, casting illusions or virtually anything else. The more impressed she is with this information or story the more forthcoming she is with answers to any questions. As she is well past three thousand years old so finding something \u0027new\u0027 can be very challenging - though it is suspected she \u0027pretends\u0027 to be surprised \u0026/or delighted to nearly any good company. She loves to share her ideas with those she enjoys and it helps her to pass the nearly endless time that waits before her."},{"name":"Throne of The Harvürdium Kingdoms","genderRaceOccupation":"at all costs","description":" To this day this wonderful throne sits alone within a mighty (albeit crumbling) castle, long abandoned in the middle of a ruined empire. To any who seek its hard knowledge, bitter wisdom and face-peeling sarcasm, the way is easily discovered."},{"name":"Gaglagabablagubb","genderRaceOccupation":"clear thinking","description":" Seekers that go to this talkative blob of mouths \u0026 eyes can get vast, complex and insanity-inducing answers to so nearly any question. Though admittedly, one has to not only keep their sanity but also avoid being eaten throughout the conversation - some habits are hard to break. Clever people bring along at least enough snacks to pre-occupy this creature until any would-be questioning is done."},{"name":"Ventelusall","genderRaceOccupation":"Reincarnated","description":" Centuries ago legend speaks of a great bard asking a powerful green dragon: \u0027what is treasure?\u0027 Much to her surprise she could not answer as she really did not know. Why was something valuable? What had true enduring value? How could one attain the most or all of these Eternal Goods... whatever they were? She became rather flummoxed for at least a few centuries."},{"name":"Garian","genderRaceOccupation":"Male Elven Researcher","description":" Seers: Othelius is a half-lich. He and his partner Garian were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Othelius is now effectively immortal, but must be constantly moisturized by an external source. He normally resembles a healthy, if elderly, elven man, but shrivels and mummifies within a few hours if not properly hydrated. Othelius can passively anticipate many possible futures, and can give general predictions as to the way things will be in the next several weeks or months. He doesn\u0027t do long-term prophesying. Garian is a half-lich. He and his partner Othelius were the victims of an unfortunate experiment in ascending to lichdom via an artificial, true-neutral-aligned phylacterial ritual. Garian, too, is effectively immortal, but must remain in an unnaturally dry environment or his body will rapidly putrefy and decay. His prophecies are of the more traditional kind - from time to time, he\u0027ll be inspired to write poems or songs that cryptically foreshadow events several years or decades in the future."},{"name":"Roland Roggeveen","genderRaceOccupation":"Male Elf Farmer","description":" A tall golden-eyed elf with hair the color of grain. He often wears a tan tunic, and grey overalls. He has a small farm of his own, and lives there alone. In the small windmill on his farm he practices his magic, and makes many things for his plants, magical fertilizers to cause plants to grow in wonderful and strange ways, mulches that push out weeds, and protect the soil, and sprays to dissuade the presence of vermin, and insects in his crops. He will sell these to anyone who can show a good interest in plants."},{"name":"Clara Sheehy","genderRaceOccupation":"Female Half-Elf Phytomancer","description":" A soft spoken and kind woman. Her hair is bright white with tinges of red, and green. She mostly keeps to herself, preferring the company of the magical plants that she creates. Her home is a small cottage with sunflowers and rosebushes growing around its edges, and many raised gardens scattered around it. She can be quite shy around new people to the point of misdirecting them away from her cottage with elaborate illusions. When she is outside her house she usually wears a large straw sun hat with a white ribbon on its top."},{"name":"Hubert Donnelly","genderRaceOccupation":"Male Leprechaun Shopkeeper","description":" A brown eyed leprechaun who wears a green tunic, and brown overalls. He manages his own shop, and sells various magical trinkets as well as gardening supplies. A few of his own gardening tools are quite magical. He acts kind to those that enter his shop casually, but when someone that has a great need for something enters his shop he will do whatever he can to trade them what they want at the cost of something they have great sentimental value in. He can be very mischievous, and even taunting to those that have traded something to him that the once greatly adored, and will not easily trade it back to them."},{"name":"Gerhard Katirci","genderRaceOccupation":"Male Ogre Geomancer","description":" A large ogre with dark grey skin, and piercing green eyes and a set of spectacles. He speaks very intelligently, but has issues with using profanity often. He wears a dense, grey, woolen shirt, and tan overalls. He works in mines to prevent their collapse, and to locate the ore or gemstones in them. Often he uses his own strength to amend issues in the construction of a mine. He respects the earth and stone of the mines he works in, and can speak to it in a way to find the best way to reinforce it."},{"name":"Haukvir","genderRaceOccupation":"Male Dwarven Watcher","description":" A quiet dwarf who lives in the ruins of a long-forgotten temple. His beard is glossy and black, as are his eyes. When he speaks, he speaks with many voices, in many accents, and none of them are Dwarvish."},{"name":"Bartholomew the Great and Powerful, First of His Name, Whose Arts Rattle the Vaults of Heaven","genderRaceOccupation":"Male Half-elf Charlatan","description":" Bartholomew (or, to his friends and/or paramours, Tol) is a lanky, somewhat frazzled half-elf with a shock of red hair. \u0027Shock\u0027 is an appropriate word; this stage magician uses what small sorcerous talents he has to swindle away the money of every backwoods family and small-town bumpkin from here to the Whitespire Mountains. Make no mistake, though: he might be terrible at performing magic, but he is a prodigy at summoning the eldritch horrors and assorted unsavory creatures that slaughter any who would turn him in to the authorities."}]