[{"title":"The Arcane Act of Spell Weaving and its Profane works in the History of our Great Empire","author":"Written by Illidan Windwalker, half-elf sorceror and Professor of Magic History at the University of Vinlheim","description":" Here\u0027s one to get us all started: This book was penned by Illidan during his second decade as a Professor of Magic History at the University of Vinlheim. The book has since been published in many copies and can be found in most libraries and book shops. The original still remains in the office of Professor Windwalker, who is working to update it and publish a revised second edition. In the pages of the book, readers may find the foundation of spellcraft, spells and runes lost to History that Illidan recovered, and historical information as to how specific spells have been used in the Empire."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vols. I - VII","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Arthur Serrowen served as High Sage of the College of Elemental Magic for nearly 100 years. Though not a magic-user himself, he held a lifelong fascination with fire magic. By the time of his death, he was considered one of the foremost experts on fire and flame based enchantments and magical creatures. A frequent collaborator in the development of new fire-based spells with wizards of his time, his \"Dissertations\" still provide insights to the modern practitioner. More details on the contents of the individuals texts can be found below."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. I: Wards, Shields, and Protections","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Volume I of the series consists of a detailed explication of all manner of protective magics that involve fire. The pages detail both protections against fire magic as well as those that employ fire in their effect. The author opines that any dedicated student would be wise to master wards against fire before including any offensive tools in their arsenal. Readers of the text often report that their defensive capabilities against fire are improved after careful study of the text."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. II: Sprays, Rays, and Blasts","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Volume II of the series describes a wide array of magical formulae for using fire as an offensive tool. The applications are broadly theoretically and have been praised for their ability to be understood across a wide variety of magical disciplines. The general principles laid out in the text provide an excellent template for the development of new offensive magic. Although a wonderful primer for others, Serrowen\u0027s lack of personal combat experience can sometimes be evident. His proposal for a \"sun burst\" spell, requiring a minimum of one hour of concentration to cast, was especially panned by contemporary critics."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. III: Natural Fire Creatures, Their Habits and Uses","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Serrowen provides a comprehensive overview of all known natural creatures that use, consume, or otherwise live alongside fire as part of their regular existence. A generous grant from a group of druids interested in cataloguing and protecting these creatures enabled the sage to hire an elite group of rangers to explore and document animals across the known world. Praised as one of the finest texts of its kind, it still provides invaluable information about the creatures within its pages."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. IV: Supernatural Fire Creatures, The Magical and Elemental","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Against the advice and better judgement of his peers, Serrowen went to great pains to contact an efreet noble from the City of Brass. Extensive transcription of his interviews with that noble were transformed into the contents of the fourth and fifth volumes. It is largely unknown what Serrowen used to bargain with (or perhaps even compel) the noble to share the information in the text. Many more learned scholars have chosen to disregard both volumes for fear that they might contain incomplete, or even misleading, information. It is unknown whether those fears have any real foundation, as no one has undertaken any comprehensive fact-checking of the work."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. V: The Elemental Plane of Fire, Its Geography and Environs","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Although tainted by the questionable interviews that plagued his fourth volume, Serrowen\u0027s geography of the plane of fire enjoys a slightly better reputation. His insistence on hiring a well respected court painter to record scrying of various features of the plane provide a vivid and colorful impression. Although the specifics of his descriptions are sometimes disputed, conensus tends to suggest that the text and accompanying images are a reasonably accurate presentation of the plane."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. VI: \"Gods\" of Fire and their Servants","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" An unfortunate low point in an otherwise excellent collection. Serrowen was vehemently opposed to any worship of gods claiming dominion over fire. The first few chapters provide a cursory overview of deities with a portfolio that includes fire. He then proceeds to spend much of the remainder of the text elucidating several arguments as to the \"true\" nature of fire and its independence from any divine control. It is unknown why Serrowen argued so passionately against fire gods in this text. Several late contemporaries have suggested that he may not have been the actual author. In a nod to prudence, later editions of the text omit the quotation marks in the title."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Vol. VII: Fire, Life, and Magic","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Believed by many to be Serrowen\u0027s magnum opus, this work combines the best of the High Sage\u0027s understanding of the nature of magical fire with his broad theoretical knowledge of magic itself. In its pages, the author draws parallels between natural fire, magical fire, animating life forces, and the core of magic itself. A dense and difficult text, it nevertheless represents some of the finest scholarship from a lifetime of study in the field. Few claim to have read the volume from cover to cover, but those who have are invariably among the most powerful practitioners of fire magic."},{"title":"Serrowen\u0027s Dissertations on Elemental Fire Magic Appendix: Enchantments, Instruments, and Artifacts","author":"Arthur Mendalon Serrowen, half-elven High Sage of the Magical Arts, College of Elemental Magic, Nevereth Royal University of Magical Studies","description":" Only included as an appendix to later editions, Serrowen\u0027s index of magical items involving fire was tragically incomplete at the time of his death. The text was clearly designed to consist of three sections. The first is a review of common and uncommon magical items using fire. The second is a discussion of a few of the better known magical artifacts using fire. The third is a theoretical treatise on magical frameworks for constructing these items. Rumors suggest that one of Serrowen\u0027s students may have stolen a more complete version of the final text just prior to his death."},{"title":"Grandma\u0027s Recipies","author":"Written by Saffron Grasskeeper","description":" Ooo i like this. A lengthy book about ghosts, spirits and the afterlife. Details many rituals describing resurrection and the maintenance of soul keeping. It\u0027s a fairly populair book amongst Necromancers, although not many of the books exist. This book contain an intricade study of demonoly, both the description of many demons along with their method of summoning. There are stories going around about one page being hidden inside the book, which contain the ritual to summon Arianna herself. Probably just rumors. As the title would suggest, this book is all about surviving in the wild. Which herbs to eat, what mushroom to pluck, and what you can do to help people turned to stone by basilisks. Has a handy cheat sheet where you can look up if the stuff you just ate is going to kill you or not. A rare book about the alchemy of poisons, and a study of poison in the wild. In the back there is a short section about his personal life, and how he endured the many stings and bites he has received. A book describing the strange ongoings in an even stranger tribe. They worship the sun. Are often found raising their arms in the middle of work and shouting \u0027PRAISE\u0027 while staring into the sun. Many of them have gone blind. This book contains an immense amount of knowledge about minerals, gems and crystals. It describes how to properly identify them based on geometry and size, and sometimes taste. usually comes with a small sample embedded into the cover, but cheaper versions simply have a colored piece of paper to replace this. The details of the author remain unknown, and not many copies of this book exist. It describes the act of taming wild animals, and which animals are actually safe to tame. Rumors speak of imbued properties in this book, that whoever reads them will be able to speak to animals. Sloppily written and difficult to understand, this book attempts to teach the reader the basics of Infernal. The useability of this book is long disputed, with many saying it is worth less then the paper it was written on, while others speak religiously of it\u0027s content. Many often blame this on the idea that Asmodeus was in fact a devil himself. William was ordered by his king to handle negotiations between the kingdom and an orc clan. The book details his experiences in setting up a peaceful agreement between both parties. Not long after finishing this book, war broke out between the two and this book was near-instantly discarded. Most dwarfs often consider this the finest in romantic novels made. Other races tend to disagree, the descriptions are very vivid and detailed. Not recommended for the younger public. This book tells of the requirements to become a true wizard; from wands to spellbooks to the iconic pointy hat. Also details possible complications that may arise from being a wizard - like sudden incineration or death by giant monster. As age takes most of us, the need to write down important details becomes imperative. It is to this end, that Saffron wrote a large collection of medicinal salves and healing artifacts for her grandma. In the end the book was cut short due to her grandma dying from a fatal sword to the chest, but this book is still considered prized for it\u0027s healing recipies."},{"title":"The Joy of Sects","author":"Dragar Darkstone, human warlock and high priest of the Old Ones","description":" Through his daily four hour meditations, Brownleaf discovered the secret to staying cool under pressure, whether it\u0027s collecting tuition fees from his students or having his adventuring companion being squeezed in a giant\u0027s fist. Brownleaf teaches you how to apply these lessons in your own life, from the battlefield to the boardroom. Found in most ancient temples. Legendary warlock Dargar Darkstone recounts his time in a Cult of the Old Ones, and how it gave the parentless human some much-needed direction, as well as lifelong friendships. A heartwarming tale found in all good bookstores."},{"title":"Catchy Harmonics as Spell Mnemonics","author":"Rimnjim Gnollbane, halfling bard, made famous by Catchy Harmonics as Spell Mnemonics","description":" A thick book of sheet music. Each song has accompanying lyrics and details on how those lyrics translate into mnemonics for remembering spellcrafting methods. Unfortunately, the songs and mnemonics are quite long and rarely does a spellcaster find it less tedious to remember the song. A few songs do stick in ones head and some readers have gleaned a new spell from its pages. Mostly, it\u0027s a common birthday present for any grandchild whose going to grow up to be \"grandma\u0027s favourite wizard\"."},{"title":"Interplanar Vortices and Their Interactions with Magical Forces: a Thesis in Three Parts","author":"By Alerio Findelkir, human student at Ulcaster\u0027s School of Wizardry","description":" Alerio Findelkir was a student at Ulcaster School for many decades before it was destroyed by Calishite mages. His book, \"Interplanar Vortices and Their Interactions with Magical Forces: a Thesis in Three Parts,\" was originally intended to be a simple thesis on how portals to other planes can affect the flow of magic in the surrounding area. However, after spending so long researching the subject, Alerio became obsessed with detailing the minutiae of the magical energies, and the project slowly became his life\u0027s work. This book\u0027s three parts are as follows: A small section describing the creation of these portals, a larger section on why they cause minor disturbances in nearby magic, and a long, convoluted dissertation on the minor shifts in magical energy caused by the merging of planes. While most of the text is nigh indecipherable to all but the most specialized of scholars, this work has been spread to many major libraries across Faerûn and is sought after by mages who need extremely accurate information on how arcane abilities can be affected by the intersection of different planes."},{"title":"The Vokhoriad","author":"Anonymous","description":" An epic dwarven poem that originated in oral tradition, passed down through the centuries until it was finally transcribed by a runesmith named Storvi Stonequill. It tells in ponderous, long-winded verse the story of the dwarven citadel Vokhor, which was destroyed by elves near the end of the creation wars. It is a tragic and haunting tale of brave dwarf soldiers led to ruin by a weak king\u0027s folly."},{"title":"Adventurers in the Wild: A Practical Survival Guide for Commoners","author":"By Clement Bosunsmate, tavern owner from Waterdeep and seventeen time unwilling hostage.","description":" This is a book of practical tips for avoiding contact with adventuring parties. From the best techniques for diving into a bale of hay, to making your house or shop look less interesting, this guide aims to aid common folk in the inevitable event they find themselves in proximity to one of the many dangerous companies of adventurers. Of particular note is a section dealing with identifying and disposing of arcane artifacts and how to locate a village least likely to be the site of demonic horrors."},{"title":"On the Minutiae of Romantic and Erotic Emotions: A Study in the Historial and Contemporary Differences in Courtship Tactics of the Academically Inclined, the Sociopolitical Elite and the Illiterate","author":"Harliban Silverbottocks, gnome genealogist at The Grand Athenaeum Historica","description":" An ambitious compendium over courtship, romance, companionships and procreation, of a frankly somewhat disconcerting scope. It includes historical records, mythological innuendos, interview transcripts, peer-reviewed user testings and more, compounding and analyzing all data within and between the different races, cultures and social ranks of the known world. In the 30 pages long foreword, the author reminds any potential interested parties that he welcomes any and all discourse, by letter or appointment. Tied together with the book is its companion book, which further explores the topic of securing potential aid from a third party, such as demonic pacts, a mind-bending Old One or a \"Winged Man\". It also includes the leaflet \"Survival Guide to Succubi\" used as a bookmark."},{"title":"The diversity of language: Common dialects and their interplay with other languages","author":"Cillain Roderim Du\u0027Hallae, High Elf, Senior Professor of Linguistics. Epthwitch Royal University","description":" Penned by Du\u0027Hallae in his 250th year, this is a hefty leather bound and rather plain looking tome. Du\u0027Hallae is a world renowned linguist, being fluent in over 20 languages, and conversational in many more. This book contains basic information on almost every language known to Du\u0027Hallae but it\u0027s main focus is Common. Du\u0027Hallae covers the many dialects of the common tongue, how they came into being and their relationship with other languages in their region of development. Including loan words, language change over time and mutual intelligibility. While a horribly dry read, working their way through this tome may assist readers in grasping a finer command of languages. As well as gaining some pointers in deciphering texts of unknown languages."},{"title":"The Infinite Joy of Husbandry","author":"Allen \"The Man of Tools\" Taylor, Human, Woodsman and Handyman","description":" Written in (Small Village of your world). It can be found in many libraries as it is among the most common for general handyman work, such as crafting and repairing wagons, chairs, furniture, sewing seeds and farming, how to build a basic irrigation system, things of that nature. Allen Taylor was thought to have been a man who created or invented many of the systems and methods used in common day workings, though whether or not these statements are true, he \"swears on me mum\" it\u0027s true."},{"title":"The Wonderfully Implausible Arcanum of Perplexing Conundrums","author":"(Or another arcane sanctum of thought and magic in your world)","description":" Herein lies the most confusing conundrums and perplexing pieces of odd and mismatched information from here to the nine hells. Those who wish to gain a greater understanding of all things that cannot be understood, need not look elsewhere for this is the book (since they\u0027re already found it). From confusing scripture scrawled on old moisture sodden tablets, unusual and cryptic runes from a forgotten age, or to the location of that other sock that you swore you washed last night, but when you went to put on your fresh socks this morning it was gone. There is nothing to obtuse or convoluted too study. Spending at least 40 hours over the next 7 days reading this, you may or may not understand the world better and might perhaps become smarter."},{"title":"Hot Tub Succubi Vols. I - IV","author":"Gweyndil Forrestrider, elven adventurer, skald, and playwright","description":" This four part set of novelas is written more for the lurid imaginations of the common folk who wish to indulge in a bit of extra-planar fantasy. Depended on the area, it is easily discovered under young men\u0027s beds or at a local printer\u0027s shop. Though considered trash by most scholars and writers, it has been pointed out that many of the \u0027facts\u0027 about succubi and their habits are rather correct."},{"title":"Forgeries and Fanaticism: Never Waste a Crisis of Faith","author":"Perwid Crashdawn, High Priest","description":" A short and cynical treatise on using trying times to turn the common people to one\u0027s will. The subjects are divided down into though, action, and outcome, sometimes summarized with bullet points. The writer is long dead, having been victim to a coup d\u0027etat organized along the book\u0027s lines. Existing copies are often found as a hand-copied sheaf of notes on the table of a would-be dictator, but libraries which specialize in social studies or collecting as many writings as possible are certain to have at least one copy."},{"title":"Rock, paper, goblin: 50 educational games and songs for children","author":"Vincent of Erdis, scholar at the Temple of Light","description":" A collection of games and songs for children that teach them about the dangers of the outside world and why they should fear it. It contains such classics as \"Rock, paper, goblin\", \"Tick, tac, terrasque\", \"Little red riding hood and the big bad warg\" as well as 30 completely original games and songs."},{"title":"The Evolution of Heraldry through the Later Years of the Ildan Empire","author":"\"in case the reader wants to conduct her own corroborating research\"","description":" Written in an exceedingly dry style, this massive tome describes everything known about the heraldry of the elven Ildan Empire, from the death of the Bright King Uldaril to the destruction of the empire during The Reckoning. The tome is a veritable gold mine for anyone interested in the Ildan Empire, but even among professional sages, few are willing to dig through the pages upon pages of the dry heraldic research to dig out the gold nuggets of information within."},{"title":"Roland the Magnificent\u0027s Comprehensive Guide to Wizardly Etiquette","author":"Roland the Magnificent, Human, Professor of Magical Etiquette","description":" This book contains a detailed guide on all things relating to Wizard Etiquette. Used as a textbook for Introductory Magical Studies classes at Colleges of Magic across the globe. This book provides students with a comprehensive understanding of the nuances of the wizarding world. A sample of chapters included: Wand using techniques Choosing a familiar so as not to offend Greeting older and more distinguished wizards The proper use and ordering of titles The meaning of robe colors and when to wear them Proper beard growing and grooming techniques Arriving precisely when you mean too"},{"title":"Summoning Familiars: How to ensure the inter-dimensional appearance of your companion won\u0027t create ripples through time and space","author":"Mureand Fulloveet","description":" This book contains a lengthy discussion on the effects on time and space of summoning a familiar."},{"title":"A Treatise on the Uses of Elemental Fire, its Evocations, and Conjurations; A Field Guide for Practical Applications","author":"Written by Aramil \"Cinderhawk\" Näilo, Elder Wizard of Evocation at The Spires: Arcane University of the Kingdom of Eredan","description":" Penned by a retired adventurer-turned-academic, this book discusses many common uses of elemental fire. While perhaps not as thorough, nor as heavily researched and theoretical, this tome stands as a strong resource for the adventuring wizard. The Treatise is broken into four parts: An introduction that discusses basic magical theory of evocation and conjuration. A discussion of the uses and applications of Elemental Fire in Evocation. Guidance on safety precautions and proper techniques of Conjuration involving Elemental Fire. A collection of common spells for the study of Elemental Fire, and application of the ideas disussed in the first three parts."},{"title":"Everything You Never Really Wanted To Know About Draconic Reproduction, But Are Going To Learn Anyway By Reading This Book","author":"Migulio Candlechin, gnomish wanderer-bard, First and only Graduate of the College of Suraz","description":" Despite the rakish title, it\u0027s a scholarly work dealing with the ecology of dragons; where they like to nest, their mating habits, how to best ensure the eggs hatch, etcetera. One chapter does describe \"the acts\", in even more detached clinical detail than the rest of the tome, albeit with little vomiting faces drawn in the margins."},{"title":"Where the Gold Flows Freely","author":"Airedhel Orson, human economist","description":" A book about taxation and trade, examining the various economic models of cities on the Sword Coast. It\u0027s a dry read even if you\u0027re interested in economics. For the unschooled, it\u0027s best used as a doorstop."},{"title":"Habits of the Wild Things","author":"Lephidiles Escthony, Half-Elf Chair of Improbable Zoology, College of Nulbanal","description":" The book is a chronicle of beast lore, focusing on rare and poorly-understood animals. Most of the information is second-hand at best and contains wild and unsubstantiated claims about wild fauna of faraway lands."},{"title":"Potent Poems and Skyclad Songs","author":"Argrama Hazescar, Halfling Bard of Baldur\u0027s Gate","description":" A book that was initially banned in Baldur\u0027s Gate for its explicit nature and ribald social commentary. After being banned, it went through three extra printings before being hurriedly un-banned by the Council of Four. Rumor has it that Duke Eltan\u0027s wife pressured him into relenting. Nevertheless, Hazescar has not returned to the city in some time, perhaps fearing some sort of social consequences."},{"title":"It Works Better If You Drink It","author":"Adanessa Venmeri, Elven alchemist of Marsember","description":" The book is a primer on basic alchemy - how to distinguish safe ingredients from dangerous, how to make healing potions and other useful concoctions. There\u0027s a special appendix in the back of the book that is encoded. For an extra 10 gold, you can send away for the means of decoding it. The appendix is a set of recipes for poisons."},{"title":"Our Friends Below: The Art of Demon-Summoning","author":"Tousba Autumnridge, senior Demonologist-in-good-standing, Faerûn Commission of Outreach and Tourism","description":" The book is, upon first opening it, blank. This has, not surprisingly, affected its sales. However, pages can be revealed through a series of rituals and bargains. The first page, usually activated through a paper cut, will reveal how to access other portions of the book. By the time you get to the end, your soul will almost certainly be the property of several malevolent entities, but the payoff is, we are assured, worth it."},{"title":"Naughty Nights in Nulbanal","author":"Nuwulf Ry and others","description":" This collection of ribald and satirical plays has become wildly popular in recent years. Most of the works are by well-known Halfling playwright Nuwulf Ry and tend to lampoon the upper classes and leaders of cities and towns up and down the Sword Coast. Needless to say, there have been official pushes to ban this compendium, which inevitably increases its renown."},{"title":"All That Glitters","author":"Haley Pridedraft","description":" This is a standalone volume that means to introduce its reader to the exciting world of mineralogy and gemcraft. From digging up your first specimens to producing jewelry-ready cut gems, this text has simple, step-by-step instructions from the novice all the way up to the journeyman."},{"title":"On The Basic Principles of Animating the Recently Deceased","author":"Zyten Aldnehere and others","description":" Very few booksellers will admit to selling this text, but there are some parts of the world where you would be hard-pressed to find a home without it. Hailing from the mysterious city of Eklanna, Zyten Aldnehere passes down rituals, techniques, and useful tips for re-animating the dead so that they may continue to be of use around the home."},{"title":"We Down Below","author":"Shadowbane Adran, Elven astrologer, and others","description":" This is a slim volume on astrology and - to a lesser extent - astronomy. It catalogues the movements of moons and planets against the background of stars and advises the student of astrology in understanding their meanings."},{"title":"What Dreams May Come","author":"Nidale Niswith, Gnome professor of Oneiromancy","description":" This is a very large reference text of dream imagery, attempting to catalogue and cross-reference common symbolic representations in dreams. The first hundred pages explain the referencing system. Once understood, the book can be used to decipher nearly any dream, although the author has thoughtfully left some blank template pages in the back for personal additions."},{"title":"Objects of the Gods: What Is Better Left Unfound","author":"Chelsey Dawnwolf, Half-Elf cleric of Jundard the Sun God","description":" While many adventurers search far and wide for relics of the Gods, Dawnwolf contends that they do more harm than good. The book is a catalog of catastrophic events surrounding holy relics, sacred weapons, and other objects that are god-touched."},{"title":"Nunc Id Vides, Nunc Ne Vides","author":"Qysan Kevald, Gnomish Illusionist and Faerûn Casino Commission Chairman","description":" This book, whose cover changes slightly every time you look away from it, is a combination how-to text and cautionary tale. It discusses common illusions, both magical and non-magical, their applications, and the possible consequences of their discovery. Much is made of the use of illusions, palming, and card-counting in gambling, with a very strong suggestion that it be avoided at all costs."},{"title":"On the Maintenence of Necrological Matricies on Skeletal Forms","author":"Written by Alther Gerredon, outlaw wizard, and leader of the failed rebellion of Malduren.","description":" The definite text on the creation and maintenance of basic skeletal undead forms, this text cover Alther\u0027s revolutionary mapping of the web of necrological energies that allow undead to maintain their form and mobility despite the lack of standard kinesiological structures. Ironically, the text is most popular among paladins, rangers and other dedicated hunters of the dead. Gerredon\u0027s work has directly lead to a number of advances in fight against the undead scourge."},{"title":"Stick \u0027Em With The Pointy End","author":"Grock, Orc, Master Swordsman and Skilled Stabber of Things","description":" This is a treatise on Orcish tactics and sword fighting. Grock himself did not write this book, but dictated it to a scribe. The book also contains detailed illustrations of a large well muscled, shirtless orc (presumably Grock) battling many different people and creatures. Properly studying this book may give a reader a better understanding of the combat tactics of Orcs. Giving the reader a good advantage in combat against them."},{"title":"The Poisoner\u0027s Bible","author":"Varryn \"just a pinch\" Sweetberry, Poisoner","description":" This small unassuming tome has no title inscribed upon the cover. It is wrapped in green dyed leather. It contains a comprehensive list of poisons, how to make them, where to acquire the ingredients and how best to apply them. It also contains advice on antidotes and making poisoning look like an accident. If readers know what to look for on the first page is a cryptic hint that there may be other books written by the author on subjects such as untraceable poisons, venom and baking to kill."},{"title":"On the Wilde and Barbarous Skinwalker Tribes of the Akadian Jungle Basin","author":"By Oswald Falerin Windsom, a human \"Member in Good Standing of the Orgnomian Explorer\u0027s Society, Itinerant Scholar, and Enthusiastic observer of all things Anthropological.\"","description":" One of a series of over-ambitious and somewhat inaccurate (not to mention unscientific) treatises on the peoples and cultures to be found on the other side of the Matagon mountains. His works are spared harsh criticism by virtue of being some of the very first of their kind, written centuries ago during the Explorer Society\u0027s heyday. While much of the accurate information has been lifted for later texts (guaranteeing these books a place in reference libraries throughout human lands), Mr Windsom\u0027s anecdotes lend insights to peaceful interaction with the peoples he met. These personal experiences were not carried over to the more academic books that came after."},{"title":"Thaumaturgy for Solitary Study Volume 1: Observation and Identification of Magical Phenomena and Auras","author":"By Charmaigne Garrick, human Archmage and Mistress of the Eight Spheres","description":" A curious tome that has been banned from the official Library of the Unseen, one of the few inanimate and non-sentient books with that distinction. The text itself is instructional, if cautious, though difficult to digest. Having received no formal tutelage in magic herself (thanks to the bureaucratic interference of the Library of the Unseen), the author has proven poor at instructing others. The series is still well regarded for its thoroughness, and copies can be found affordably in marketplaces in the magocracy of Daktare."},{"title":"The Curious Properties of the Frostsorrow River and its Effects on Nearby Indigenous Peoples","author":"By Decimus, changeling researcher for hire, commisioned by the Orgnomian Explorer\u0027s Society and an unspecified circle of Daktaran wizards.","description":" This treatise follows the titular river from the delta emptying into the Bay of Jewels north, through the Akadian Jungles, into the plains and steppes of Skromveldt. A trained alchemist, Decimus processes samples of the water at several points on his journey, noting the increasing magic therein. Using his shapeshifting abilities, he was also able to observe in unprecedented detail the rites and behaviors of the pirates, feral tribes, and barbarian clans that live near the banks of that river."},{"title":"The Compounding of Sin","author":"By an unknown human","description":" This rare and often discounted book is ostensibly a firsthand account of the first human empire and its war with the heavens. According to the text, the gods struck first and were driven by jealousy, as the empire would not worship them, electing instead to create their own deity. As this would make the work over a thousand years old and the survivor of multiple cataclysms, intact originals are unheard of, and the academic world has disregarded supposed copies out of hand (and are frankly doubtful of the existence of the work at all). If this tome were indeed real, and its text intact, inside one could find descriptions of weapons capable of fighting the gods and slaying their nigh-immortal servants."},{"title":"Surge: My life with wild magic","author":"Leilanna Stoutbridge, Halfling, Sorcerer and Esteemed Author","description":" This book is the autobiography of a cheerful, if a little self-absorbed halfing sorcerer. It details her experience of discovering she was a sorcerer, her experiments with magic, her conflict with her inner child, her brief encounter with a flumph and her eventual acceptance of the uncontrollable nature of her magics. This book was a best seller 20 years ago and can be found for a smattering of copper in most stores."},{"title":"Wild Magic: Understanding my power","author":"Leilanna Stoutbridge, Halfling, Sorcerer and Esteemed Author","description":" A much less popular sequel to her first novel \"Surge: My life with wild magic\". The contents of this book, while also semi-autobiographical, are a little more scientific in nature. Within this book Stoutbridge details all the times she has lost control of her magic, the results and possible causes for these surges of power. It also contains some useful observations on metamagic."},{"title":"An Intensive Study of the Effects of Electro-Majicka on Elemental Metals","author":"Written by Lantor Warybar, gnome professor of Natural Philosophy","description":" An incredibly dry tome describing in detail the effects of twelve types of electric magic on 20 known elemental metals of varying purities. It is intended to be used as a reference guide rather than a textbook, so it would be impossible to put into practical use on it\u0027s own, but should a question regarding electricity and metals arise, heavens know why, this book has all the answers. Currently, two copies of the book exist: One in the Natural Philosophy department of Yolin University, and one in the Grand Library, for record-keeping sake."},{"title":"A History of the Night-Wing Empire and the Destruction of the Aether Kingdom","author":"Authored by Master-Overlord Raven","description":" Required reading for any new acolyte to Night-Wing\u0027s ranks, it reads more like a storybook than a textbook. It was written by the leader of Night-Wing, Master-Overloard Raven soon after the founding of the cult to attract new recruits with the glory of conquest and victory. Despite it\u0027s obvious connections to Night-Wing, it is strangely persuasive to most kinds people regardless of race, alignment or personality. The original resides in Raven\u0027s personal library, but copies have been distributed across many dark alleys and shady markets under simpler or even blank titles."},{"title":"Wiljin Samulkin\u0027s Complete Omnibus of Mineral prospecting- exploration and mining: Edition with notes and commentary","author":"Wiljin Samulkin, Dwarf, Professor Geology at the Stouten University of Braedwardith","description":" During his successful (but rather lucky) career as a miner, Wiljin made a fortune and decided it was time to write down his knowledge in a vast, 14 volume, omnibus. As if 14 volume are not enough he recently decided to write an extended version with additional notes and commentaries. His notes are so elaborate an additional 6 books were added to the omnibus. Getting a copy of the book is not an easy task as Wiljin is also in charge of the production of it. He considers each buyer\u0027s worthiness to get access to his \u0027genius\u0027 writings. Because of this a lot of faked copies circulate, with varying accuracy of the information within. Getting an original copy can provide one with valuable information about possible valuable and untapped mineral deposits. But more often than not people based their mining endeavours on a fake copy and lost every penny they had, harming the credibility of Wiljin."},{"title":"The Lexicon of Ludicrous Luminescents","author":"Gerald Magnus, Halfling Wizard","description":" A comprehensive list of light spells, magic objects, magic creatures and naturally occurring bio-luminescence."},{"title":"Empire of the Risen Star","author":"Dullahan,","description":" The novel, however, does end on a positive note with Theodore Humphrey successfully staging a revolt from within the gulag before moving on to conquer its two neighboring camps and uniting them into the New 42nd. With a new front inside their own borders the Tides of War quickly turned against the Francs and the war would come to an end just over a year later in favor of the Empire of the Risen Star, ending an 18 year conflict."},{"title":"Psionics: A Guide to the Intricacies of Mind Reading, Melding and Controlling","author":"\"Healthy and wholesome psionic life.\"","description":" However, contrary to those beliefs those who actually strictly follow all the lessons, diets, meditations, pilgrimages and rituals held within this tome for exactly one year will gain some competency with psionics. These individuals are usually sought out and recruited to the staff at the University of All Things."},{"title":"Building Bridges: A Cultural Study: A Series: Vol I: Elves","author":"Bartholomew Goldthong Leopold the XII of the Magnanimous Barony of San Gordogia, Human Noble","description":" This book was penned by an egotistic nobleman who thought himself a scholar of the \"Highest Order.\" The tome contains many of the intricacies of details of life among the elves. It does in theory accomplish its goal of providing the reader with a broad understanding of elven culture, however, it is also noted to be incredibly self-indulgent and quite racist. Lord Leopold would go on to write six more full volumes in the series for Dragonborn, Dwarves, Halflings, Gnomes, Genasi and Tabaxi. Lord Leopold is thought to have been working on a volume to include the Gestalt when he suffered a fatal aneurysm before finishing the volume. The Gestalt reported that Lord Leopold\u0027s mind broke in his attempts to understand the small ratlike creatures."},{"title":"Of Dice and Pen: A bookie\u0027s guide to gambling","author":"By Pat the rat, human gambler and bookie","description":" From an insiders perspective Pat leads you past all the common cheats used in all major settlements from Waterdeep to Baldur\u0027s Gate. False bottoms, weighted die and common misdirections, he knows all the tricks (because he\u0027s used most, and invented some). After reading this you will certainly know how to spot the fish, capture them, put them in a barrel and fire away. If you want to make a buck - why put your trust in Lady Luck?"},{"title":"Maverick\u0027s Guide to Ethical Necromancy vol 1: The Importance of Consent","author":"Harridin Maverick, Human, Ethical Necromancer","description":" Harridin Maverick is infamous in Necromancy circles for his vocal campaigning about Ethical Necromancy. Volume one of his work, titled \"The Importance of Consent\" covers his theoretical framework of consent. He believes that before performing necromancy one should gain informed consent from those that they will raise from the dead. He insists that those raised in this matter must not be forced to perform tasks that they would have disagreed with in life. He details several methods for this including getting consent from next of kin, speaking with spirits to gain consent and his controversial stance, that has made him less than popular with naturalists and druids, that animals and creatures he deems of \u0027lesser intelligence\u0027 are not capable of understanding and thus can be raised from the dead without worrying about obtaining consent."},{"title":"Maverick\u0027s Guide to Ethical Necromancy vol 2: Reduce, Reuse, Recycle","author":"Harridin Maverick, Human, Ethical Necromancer","description":" The second book in Maverick\u0027s series on Ethical Necromancy covers environmental pollution, making good use of finite resources and the importance of his theoretical framework of \"The Three R\u0027s, Reduce, Reuse and Recycle\". He insists that practitioners of necromancy, and indeed all magic users, must be aware of the impacts of their magics on the environment. His policy on Reducing waste includes ensuring one only raises the required number of undead, and ensuring proper use of resources. His policy on reusing focuses on using the same raised undead for multiple purposes, decrying those who raise new undead for every task. His policy on recycling includes covering proper disposal and re-burial of raised dead, specifying that if possible they should be returned to their original source."},{"title":"Thoughts on creation and maintenance of golemantic magic, constructs and other nonliving animates.","author":"Calivius Senliv, dwarf animist and geologist","description":" The writer, Calivius Senliv, was a geologist and animation specialist working for the Miners Guild, suplying them with mindless drones to assist in heavy lifting. As his life furthered, he came to the conclusion that making and maintaining golems is, in fact, an incredibly tedious and mind-numbing experience and that it should be possible to expediate the process. The book exists in only 1 copy, written by Senliv himself, which is a highly treasured possession of the Miners Guild, since it details the fast process of making golems and the secret of indefinate animation. The dwarves treasure it beyind measure, and would-be-thieves are punished severely."},{"title":"The process for and applications of extracted beauty from the eyes of beholder\u0027s a dissertation","author":"by Arch-magus marud d\u0027chauncy, human seer and alchemist to lord Asatropva","description":" \"beauty is in the eye of the beholder\" However many fail to realize this is not just a saying, but in fact a quantifiable and reproducible resource with he proper synthesis tools, Arch-magus Marud D\u0027chauncy outlines in this book proper extraction and synthesis techniques as well as applications for refined beauty Side note: Arch-magus marud d\u0027chauncy is actually an alias to a known fraud, he is really a divination wizard of middling talent, who wrote many books with results that are almost impossible to reproduce. however this is the one tomb that while he wrote as bullshit, it actually works to everyone\u0027s surprise including his own."},{"title":"Alchaemical Extraction\u0027s and it\u0027s effect on humors and biles","author":"By Human Alchaemist: Atropa Dona","description":" This early medical text, advises on how using various extractions of alcheamical essences such as silver, gold, and lead. and various other alchaemical processes can be used to extract the various bile\u0027s from the body and re-balance the humors of those effected by various disease\u0027s as well as a detailed guide on bloodletting to supplement the healing effects of these tincture\u0027s."},{"title":"A field dissertation on the edibility of various non-humanoid\u0027s","author":"By half-orc \"researcher\" Drakus Red-rage","description":" A controversial book to say the least mostly due to Drakus\u0027s Loose interpretation of \"non-humanoid\" He goes into detail the multitude of ways an adventure could cook, prepare and consume A bestiary\u0027s worth of creatures, as well as the various other uses for the parts of creatures that you are unable to consume. and the various positive or negative effect\u0027s this gives you"},{"title":"Fungus for Life: Myconids, Spores, and Other Fungi for Healing","author":"Arkin Toosel, human male alchemist, Tribute to his late wife Dehlia","description":" Arkin Toosel was an esteemed alchemist in the farming village of Sandel who prospered in helping the town grown hearty vegetables, sweet fruits, and meaty livestock. He used his skills in alchemy to help the farmers find correct levels in the soil and food to feed to make sure everything was top of the line. His home expanded to the mansion that sits at the center of the village and is now known as the luxury inn, Sandel Suites. As Arkin aged, living out his life with his beautiful wife Dehlia, she was poisoned by a vicious illness that none in the land had ever seen. Arkin toiled in his lab, concocting serums, potions, salves and other ointments to help Dehlia. Which in the end - only helped, never healed. He eased her suffering as he researched more and more and delved into the world of fungi in depth, finding their ability to thrive in the the worst environments and on the wastes of others. Knowing an old Drow he befriended years ago, who lived in a nearby mountain entrance to the Underdark, he discovered many of the properties of the wild Fungi of the Underdark. In one final expedition, he kissed his wife goodbye and sought out more knowledge to see how it work. He left her in good hands of the village family and nearby city healers would check on her every 24 hours. He arrived home just in time to see her final goodbye. Held in his embrace, he kiss her lips as she parted to the afterlife. Forlorn from the loss of his wife, Arkin became obsessed with defeating the strange illness that over took his wife. He worked more and more. Pushing the boundaries of medicine like never before, using the Fungi as inspiration. Showing the ability for humans to learn to live off the negativity in their body and basically eat the illness that could hurt them. As he discovered more and more helpful things, many in the village found this to be... unsettling. Alone in his mansion, working in an underground laboratory Arkin was breaching into the world of Necromancy. The village would have no such thing and has a local city guard seek out Arkin for safety and possible mental help. Bursting through the door, Arkin was drug away from his home, his work, his life, to mental hospital in the city of Orndell. The mansion, inherited by his next of kin Sara and her wife Owen, they went to visit her uncle. Seeing him behind magic barrier and the madness in his eyes she pleaded for him to calm down. He looked her square in the eye and said he was not mad, he only wished to help those who needed it. He told her where to find his findings, to let others known there are ways to fight the worse diseases in the land. She nodded and sought out the hundreds of pages of treatise, essays, and studies Arkin had done. Some time after that Arkin has escaped from the mental hospital, visited his mansion one last time to seal his workshop safely, took the rest of his work and is currently missing."},{"title":"The Grimoires of Grepniak vol. 1-6","author":"Dictated by Grepniak the Destroyer (Orc), Penned by Hubert Longfingers (Gnome)","description":" Volumes 1-6 of the Grimoires of Grepniak relate to stories Grepinak tells of his interactions with goblins. Any one of the volumes on it\u0027s own seems little more than a smattering of ancedotal tales, but together provide a rather comprehensive account of nearly all facets of goblin soceity."},{"title":"The Grimoires of Grepniak vol. 7","author":"Dictated by Grepniak the Destroyer (Orc), Penned by Hubert Longfingers (Gnome)","description":" Volume 7 of The Grimoires of Grepniak tells of Grepinak\u0027s interactions with Hobgoblins. While the information on it\u0027s own is notable it builds largly on the foundations built in the first six volumes."},{"title":"The Grimoires of Grepniak vol. 8-10","author":"Dictated by Grepniak the Destroyer (Orc), Penned by Hubert Longfingers (Gnome)","description":" Volumes 8-10 of The Grimoires of Grepniak retell stories of Grepniak interacting with Orcs. These volumes tell much of orcish battle tactics and fighting styles."},{"title":"The Grimoires of Grepniak vol. 11-12","author":"Dictated by Grepniak the Destroyer (Orc), Penned by Hubert Longfingers (Gnome)","description":" These volumes tell of the Gnolls, largely stories or Grepinak and his associates fighing Gnolls and records of Gnoll warband movements during Grepniak\u0027s lifetime."},{"title":"The Grimoires of Grepniak vol. 13","author":"Dictated by Grepniak the Destroyer (Orc), Penned by Hubert Longfingers (Gnome)","description":" Volume 13 comes with a preface warning the reader there isn\u0027t much actionable information contained in the 13th volume but Grepinak refused to tell his stories if thses tales weren\u0027t included. The stories start in many diffrent ways, from casual interactions to the middle of battles, but all eventually turn out to be tales of Grepinak\u0027s sexual conquests. Strangly by far the best selling volume."},{"title":"Marland\u0027s Martial Manuscript","author":"Written by Marland Verifor, Human, Weapons Master and Instructor","description":" Written as a guide to weapons and their various uses in combat situations Marland considered himself a creative and infallible weapons master. While his instructions are clear, concise, and generally good advice its things most learn on their first day holding a weapon of any kind. Its still considered a good primer for those interested in taking up arms rather than magic and can be found in most libraries or martial training schools."},{"title":"A Guide to Consequence-Free Oaths","author":"Written by Grindoc Oathsworn","description":" An ancient text bound in the crinkly skin of some unholy creatures Akel\u0027s Text is a comprehensive guide to aberrant creatures and all aspects of the Far Realm. As the book progresses, the handwriting grows more and more unsteady, the language less precise and more esoteric, until the last couple pages are nothing more than a smear of unidentifiable liquid. Essentially a legal document, the Guide shows the reader the best way to maximize the benefits of magical dealings while minimizing the risks to ones soul or substance. It has sections on devils, demons, Yugoloths, fey spirits, and even the Gods themselves."},{"title":"Observed Behaviour: an essay concerning Understanding Humans and their Behaviour.","author":"By Johnathan Locksmith, Half-Elf, 2259 of the Common Count, written in Aramyr, city of Crystal","description":" This small book, written in the form of a field guide, has been a true saviour to many diplomats, traders and rulers of the non-human races. Written by the well traveled Johnatan Locksmith, a Half Elf who sought to make other races understand the often confusing means and motives of humans, Observed Behaviour: An Essay Concerning Understanding Humans and their Behaviour, offers a well researched and in depth study that truly teaches one the ins and outs of human behaviour. It has been transcribed in many of the existing languages and is widespread throughout the realms, with the original forever remaining in the possession of Locksmith. Some say that hidden in some copies are subtle tips on manipulating the will of humans, although that has to be nonsense, right?"},{"title":"A Cultural History of Vampires","author":"Zoltep, dwarf cleric and Chief Historian at the College of Korstadt","description":" This book was penned by Zoltep early in his career, long before he became Chief Historian. Copies are somewhat rare, as research into vampires is uncommon, but there are a few dozen libraries and universities which have one. The book contains information about the history of vampires, and their role in society, along with their appearances and role in fiction. The book also distinguishes from what is true about vampires from what is simply myth and rumour."},{"title":"Edible and Inedible Flora of the Seven Realms","author":"Reder Damsev, Human Ranger","description":" Reder spent much of his life in the wilderness, and became accustomed to recognizing which plants were edible, and which would leave you dead. Late in his life, he wrote down much of the knowledge he acquired, along with sketches and other methods of identifying these plants."},{"title":"Observations of an Ale Drake","author":"Dictated by Gabriel, Ale drake of Gunmars Rest to Vixus Plenni, Half Elf Skald visiting the Dwarven Citadel of Gahl-Marnok","description":" This beaten and dusty book contains hundreds of anecdotes, poems, limericks, short stories, jokes and illustrations of the life and times of an Ale Drake known only as Gabriel. Leafing through it is clear that some pages have been torn or cut out from the book, perhaps map descriptions, fragments or clues to great mysteries, tales of legends or possibly even incriminating evidence? Who knows what Gabriel overheard in his years in the Inn? Who knows what other things some people may find useful in the book? Gabriel also speaks at length about his long interactions with Dwarves and how better to lever coin from their iron grips through flattery and taking advantage of their stubborn but fair nature."},{"title":"Fey summoning, fair or foul?","author":"PROUDLY Written and Self Published by Veirfurn Blousiiere, High Elf, Former Student at the Arcane Zoological society, Til-Ferthic","description":" The book opens with a plea to the reader that if they are of the ability to summon creatures from they fey for whatever reason they give serious consideration to the feelings of the creature they summon. He goes on to express his sincere concern that so many times these creatures are brought into being only for them to be killed moments after summoning so that some ignorant and cowardly \"hero\" who has just this week grasped the art of summoning can run away from the fight he more than likely started. The book continues in a very rant like style and his message is all over the place, often repeating himself and dropping former colleagues names into the mix. However, Veirfurns illustrations and information on fey creatures is very precise and his explanations of what is actually occurring during the summoning process is very interesting."},{"title":"Toxic Flora and Fauna by Habitat","author":"Dr. Christa Koval, Kobald, Chemistry","description":" A compilation of the toxic effects to humans resulting from exposure to various plants / animals / natural substances. The effects are based on the real world results of contacting various poisons/venoms/etc. put together for a campaign taking place after I took step 1 of the U.S. medical board exams this past summer."},{"title":"Beyond the Hook: Mechanics, Magic, and Medicine to Mend a Man","author":"Written by Archibald BewCannon, human, former pirate, tinkerer and dabbler in the arcane arts.","description":" A rough and ready sort, BewCannon learned his craft at sea, applying tattoos and assisting the crew sawbones with his butcheries after each battle. Always fearful of the surgeon\u0027s knife, BewCannon applied himself to finding better solutions than the customary eye patch, peg leg, and hook hand. He left the sea to ply his trade honestly in Boca La Paz, a major trading port on the southern coast of Kalyva, where he opened BewCannon\u0027s Body Shop, \"specializing in tattoos and body piercings,\" though he also deals with the occasional slashing and bludgeoning. Known to customers as Bucky, he can fix nearly any injury. The book includes detailed notes on anatomy, metallurgy and materials, alchemy and medicines, and the magic that fuses it all together."},{"title":"A Contemporary and Critical Edition of Malfarin\u0027s Translations of Ur-Ruminations of Lingua Magicka Volume 1: Being The Editor\u0027s Discussion of Subsisting Research on the Field of Lingua Magicka and the Maligned Role of the Ur-Ruminations","author":"Professorial Inquisitor Hlaford, Human Aristocrat and master of Linguistics in the High Hall\u0027s inquisitorial researchers","description":" Written and held in the monastery of the Dead-Thulr in the warren of the High Hall. Volume 1 examines the concept of the \u0027lingua magicka\u0027 the long sought language of magic irrespective of nationality, race, or planar existence. The Editor argues that the Malfarin\u0027s translations of the ancient works called the \u0027Ur-Ruminations\u0027 are the closest that any scholar has got to finding some of the lingua magicka\u0027s words and grammar."},{"title":"A Contemporary and Critical Edition of Malfarin\u0027s Translations of Ur-Ruminations of Lingua Magicka Volume 2, part 1: Being The New Translation of the Ramblings of Wahida, Druid of Chaos and The Editor\u0027s Discussion of the Druid\u0027s Craft Including a New Insight into the Phonics of the Lingua Magicka.","author":"Professorial Inquisitor Hlaford, Human Aristocrat and master of Linguistics in the High Hall\u0027s inquisitorial researchers","description":" The unfinished second volume treats with Wahida, the Druid of Chaos who in former times founded the Druidic Circle of Unbalance which is still forbidden by most Druidic councils and indeed sovereign states. Dismissed as a mad woman she wrote a number of fragments of incoherent text in a language of her own devising. These fragments make repeated reference to a group of animals that she long traveled with. Unfortunately the Professorial Inquisitor Halford\u0027s promised revelations about the phonics of the Lingua Magicka are not contained in part one and as he disappeared during research the two volumes remain tantalisingly incomplete."},{"title":"Treatise on the Surlandian Environs: A Comprehensive Look at the Flora, Fauna, and Developed Geographical Formations of the Surlandian Continent","author":"Nightingale, Adventurer, Scout, and Former Gryphon Knight, serving as Cartographer for Solaria.","description":" Rathyn has written many volumes in his lifetime and this is one of the major texts of the Sunnarri Academy that he created. It serves as a guidebook and introductory level course material for new students of magic in the Sunnarri Academy as well as anyone interested in fire or light magic. This book is a large volume with expressive pictorial displays of flora, fauna, and topographical maps compiled and arranged by the enigmatic author Nightingale. He is well known throughout the Solarian realm as the masked hero. He has long been recognized by his signature mask and armor and now he is recognized for his contributions to the Solarian advance in Surland. He spent nearly a decade traveling in the Surlandian wilds and this book is the culmination of those travels. It is widely accepted as the only authority of the Surland continent and limited to only three copies at the time of this writing. I have lots more but I\u0027m at work will have to add more later."},{"title":"The Dragon Prince: Legends of the Lost Temple","author":"Maraxes Blackfyre, Dragonborn Poet","description":" In this tome, Vicerro Santiago goes over the steps for preparing for and starting a farm for Arcane and Divine flora in many of the world\u0027s biomes. In between chapters, he has his personal notes on how he got to the theory in the previous chapters. There have been three reprints over the years, but collectors have sought his original manuscripts over the years (which are believed to be in the personal collection of his master, Madre Bella the Crystalline Dragon), as they are believed to hold his discovery of trans-dimensional cabbages, left out of his later works. Many years ago, there was a pair of performers who changed the Art of music as we know it, creating a new college for bards who wanted to break the chains of tradition and create new music. This text book was created for first year students, and is altered every year by the top graduating students in order to keep the book from becoming the tradition it was created to resist. There are currently 73 different versions of the book (given to the students for free in their first year), with the original versions being heralded as collector\u0027s items for musicians around the world. Edit to add more books: In the first volume of her Dragon Prince series, Maraxes opens up the series with a story based off her real world adventures in the Dragon Empire. In here, a keen eye can actually find the Hidden Temple she references of they\u0027re looking hard enough."},{"title":"Of the Fey and Feywild, a progressive study into both courts including biological and behavioral observations made on their kind in their natural enviroment","author":"Bilmir Helleward, Gnome, Racial Sociology and planar sciences","description":" This comprehensive guide offers you all you need, want and ever could know on the mysterious dwellers of the Feywild, they Fey. Written, researched and compiled by the famous Bilmir Helleward! Bound in rich leather and capped with gold filligree, this tremendously treasured tome is not only pleasing to the mind, but also to the eye."},{"title":"Close Encounters of the Bird Kind; Living Amongst Our Winged Kin","author":"Maraval Holimion, Wood Elven Anthropologist.","description":" Written by an aspiring scholar in a mountaintop settlement, this book details the intricate aspects of Aarakocra society and behavior, covering things such as religion, art, music, fashion, and more. It has found it\u0027s way to libraries across the world, offering rare insights into the reclusive and claustrophobic species."},{"title":"Winning a War the Wizard\u0027s Way","author":"Quortho Jheeg, Human Evoker.","description":" This tome was submitted as Quortho\u0027s thesis paper, and it goes into long (and arduous) detail about the strengths of the School of Evocation, particularly in battle. There are two copies- one he carries on him, as it duals as his spellbook, and the original he sent to his college."},{"title":"Vascal Tiernath, Elven Hierophant of the Steppes","author":"The Cry of The Earth","description":" A treatise detailing the controversial position that civilization should no longer harness the powers of captured elementals. Major cities, and citizens with the means, began capturing and pulling the power from elementals to power flameless torches, land ships and all manner of new devices that offer creature comforts. While Vascal empathizes with the urge to create and our innate curiosity, she also claims to have felt pain from these creatures and calls their use exploitive. In a particularly ominous conclusion, she suggests that it may be necessary for.a group of agitators to rise up against the practice swiftly, should elementals ever gain the capacity to communicate and organize themselves."}]