[{"name":"Gregori Allson","description":" Bastard child of a noble and a half-orcish seamstress Gregori grew up an orphaned street urchin after his mother was taken by plague. Eventually adopted by traveling nomads he learned the old magics from his adopted family, but on experiencing the wider world became embittered with their pacifist beliefs and struck out on his own, seeking to unite the downtrodden in society and find the long lost homeland of the nomads. What started out as idealistic movement has become to turn more and more towards violence. Perhaps because of the increasing needs of the swelling pilgrimage/crusade, perhaps because of the more frequent, violent and organized opposition from local nobility or perhaps because of the slow influence of the forbidden killing songs that he finds himself forced to rely on more and more to protect and feed his exodus."},{"name":"Kordel the Black","description":" A mercenary leader and giant of a man Kordel is all the more fearsome for the stylized black plate armor he wears at all times and the swath of black scales that cover almost half his face. Rumored to be the descendant of a black dragon he is immune to acids and poisons, has been known to disarm opponents by shattering their blades with his gauntlets and is able to breath a black fog that causes his enemies to flee in terror, though in truth those abilities are all thanks to the powerful enchantments he\u0027s paid to have placed on his armour throughout his long career. Kordel leads his band of mercenary soldiers, the Sons of the Dragon, through an equal mix of fear and loyalty. Famed for personally killing anyone who harms a man under his command outside of battle he is an almost father like figure to his soldiers. He also is known to value honesty to a fault, the rare instance of any of his soldiers attempting to hide behind his reputation to pick fights has resulted in said soldier being horribly beaten and left lying near death and penniless in the village square when his band moves on."},{"name":"Zektral the Crazed","description":" Zektral is the closest thing most goblins will ever have to a commander. All he really is is a bigger than average goblin who really likes to hurt people. Zektral has a knack for whipping his allies into a frenzy, and the swarming mass of bodies that he commands can tear through the towns that border goblin territory. While he and his ilk wouldn\u0027t stand up to a real army, the goblin hordes are a terror to the militias that dutifully try to protect their little towns."},{"name":"Roderick the Abandoned","description":" Roderick was a regular sergeant in the army. He was bright, optimistic, and a fine leader. Then his division was sent into a suicidal charge. They were told they were going to valiantly repel the enemy, but what they really did was distract their foes while the real army moved in for a flank. Everyone died. Including Roderick. This betrayal by the army that he so valiantly served birthed a terrible hatred in Roderick. His soul was so twisted that it refused to leave the mortal plane, and Roderick returned in undeath. Now, he drags soldiers back from their rest in the afterlife, and wields them against the very nation he once protected."},{"name":"Necktearer the Top Dog Alpha","description":" Necktearer was once a normal man, whose name has been lost to tale and story. This man lived in a lovely little logging town, in a lovely little house, with his lovely little wife and two lovely little children. And then the howls came. Villagers started disappearing. Livestock were found picked to the bone. The little town had a werewolf. One full moon, things got even worse. Screams came from the man\u0027s house, and by the time anyone could arrive to help, Necktearer had devoured his family. He let out a blood-curdling howl, and the terrified villagers steadied themselves for a fight. But then the howls were answered. Werewolves poured out of the forest by the dozen, answering their new alpha. Necktearer\u0027s pack decimated the town, leaving nothing but splintered wood and bloodstains behind. And now, this veritable army of claws and gnashing fangs needs a new source of food."},{"name":"The Raven-Knight","description":" The Raven-Knight is rumored to be an immortal warlord who commands a small mercenary army. While few in number, the Raven-Knight and its band of merry men have been terrorizing outland counties for more than a century. Their list of feats include everything from robbing caravans, holding nobles hostage for ransom, and sieging small castles. The Raven-Knight\u0027s armor, along with its followers, are adorned with black feathers and imagery of birds. In truth, the Raven-Knight has been a title passed down from generation to generation of hearthless (and heartless) \"knights\". Due to this, tales of the Raven-Knight are never in agreement on the warlord\u0027s true identity."},{"name":"General Xiao Song","description":" Xiao Song used to live the ascetic life of a warrior monk. But when the Empire razed his temple, he led his brothers in a decade-long campaign of guerilla war against the government. When a new dynasty came into power, they granted him amnesty for his past crimes, in exchange for becoming a general under the new Imperial rule. With ruthless precision, he has been removing anyone and anything in opposition to the new Emperor. Xiao Song has earned a reputation of being absolutely brutal in his work."},{"name":"Malbro of Misfortune","description":" Malbro the gnome comes from a long line of necromancer-kings. But unlike his forefathers, he could never muster a kingdom-shaking army like the days of old. Thus, Malbro lives a life of a warlord, pillaging and animating his way across the countryside. He is best known for being very fond of animals. One such tale is about a gnomish lord who, after successfully retaking his manor from Malbro, was killed by a massive swarm of skeletal rats four years after. In the process of renovating his manor, the workers knocked down a wall which released the undead swarm. The mansion remains abandoned to this day, rumored to be cursed by the vile necromancer."},{"name":"Medea Cruitzmann","description":" Kicked out of the Rembrancers after seeking out hidden knowledge for her own power and gain, Medea has been one of the youngest and brightest initiates of that secretive school of mystics, academics and sages. Now working for herself, or occasionally hiring herself out to others, Medea is a keen shot with her trusty hand crossbow, and a proficient fencer, but prefers to rely on her hard-fought-for magical skills and knowledge, and her constantly changing cast of hired hands when it comes to a fight. Last seen in Gravelby area, Medea seems to be searching for tomes of power, rather than artifacts as she previously was..."},{"name":"Underseer Karnak","description":" Similar in rank to a Duke or Count in the human Kingdom above - or Obergraz as he would say - Underseer Karnak is responsible for a recent rash of raids, kidnappings and other crimes perpetrated by Duergar footsoldiers and their duped orcish allies. Seeking to gain blood sacrifices and slaves for the dark rituals of his ally, High Priest Corax, Karnak has let loose a war between men, duergar and orcs in the lands above with no care for the loss of life."},{"name":"Kradugg, Chief of the Blackbones","description":" Kradugg cuts a handsome figure—for an orc. Tall, well-muscled, with long, dark hair, Kradugg is well known for his skill with the spear on the field of batte as well as for his romantic escapades, having more than a dozen wives of orkish, human, and mongrel stock. The Blackbones were driven down out of the high passes of the northern mountains by the migration of the giants. He\u0027s been leading his raiders in burning and pillaging the Borderlands towns attempting to carve out a sizable enough territory that his people can live on hunting. Kradugg\u0027s armor is adorned in crow feathers and he takes a finger from every enemy he vanquishes himself on the field of battle. After the battle is won, he cooks a pot of \"finger soup,\" seasoning it himself and sharing it with his lieutenants claiming the fingers will point the way to his next great victory."},{"name":"Sir Symon Narback, Captain of the Greenscale Company","description":" Sir Symon was once the toast of the kingdom. A genteel knight and a champion of many tourneys, Sir Symon was outed as the queen\u0027s paramour and driven to exile by the enraged king. He found a home among the Greenscale Company and rose quickly through the ranks of that storied band of sellsword and ne\u0027er-do-wells. Symon has brought discipline to the Greenscales as well as several military victories which have led to increasingly lucrative contracts. The camp followers whisper that Sir Symon boasts of a plan to turn his company homeward soon to bring vengeance to the king who exiled him and to claim the queen as his own."},{"name":"General Mattos Gorakas","description":" The prince is wrong to trust General Mattos Gorakas, all his advisors see the ambition in the general, but the prince has been charmed by the dangerous hero who trained him in arms as a boy. Gorakas commands the city\u0027s legion and that same magnetic charm has won him absolute allegiance from the officers and enlisted men. Gorakas grew up a servant to royalty and has harbored a resentment of the privilege of birth all his life. His warm, mustachioed smile never touches his steely grey eyes."},{"name":"General LaMarchande","description":" A tall and imposing man he is the leader of one of the largest armies on the continent. They take on all sorts of jobs and often find themselves forcibly recruiting young men from villages they raid. The men \"volunteer\" to protect their homes and families who are then held as a sort of ransom for the loyalty of the men."},{"name":"Krulkut the Red","description":" Orc warlord who leads raiding parties into human lands seeking sacrifices for his god. As a young Orc he spent several weeks in the Craltur desert and his skin burned a deep red and has remained that way ever since. Upon his return he forcibly converted his people to their new god and begin strange rituals and regular sacrifices. He wields a strange and terrible power."},{"name":"Lord of War","description":" This infamous mercenary commander has an uncanny knack of sniffing out where and when the next conflict will emerge. The Lord of War and his company, the Bloody Boars, always seem to arrive prior to the outbreak of any major war, battle or skirmish. This reputation has spread far and wide, and now peasants cower whenever the banner of the Bloody Boars is erected near their homes. Rumours abound that the Lord of War manufactures these war through assassinations, subterfuge, blackmail and various nefarious means. There is only one tale that is demonstrably true; the Lord of War offers no mercy and takes no prisoners. Torture, pain and destruction are the preferred methods for the Lord of War."},{"name":"The Soulmancer","description":" The Soulmancer has studied a school of magic that has never been thought possible; the manipulation and binding of schools. Initially a field within the Necromancy school, the Soulmancer pushed the limits of studied until he found a branch of magic powered through the souls of living beings. His spells are powered by captured souls that were stripped from formerly living beings. This allows him to create spectral warriors, manufacture intelligent artifacts, and bind the souls of loyal servants to new bodies to extend their life. The one ingredient the Soulmancer needs is souls in abundance, and on the battlefield he can steal souls without causing too much ire or suspicion. The Soulmancer travels the world, offering his services as a war mage and accomplished strategist."},{"name":"Gullblaster","description":" Gullblaster is a fearsome bugbear general. He commands an army of goblins, and has proven himself time and time again an uncanny tactician. His three commanding officers, a goblin name Dart and two hobgoblins name Fink and Dongo, follow his every command, and show just as much cunning on the battlefield. His best units employ intricate wood-carved machinery, designed by his unnaturally crafty \"N-Gun Ears\". He wears a green amulet around his neck, which he never removes. He attacks human settlements, attacking at night and taking them by surprise. His conquest appears to be heading in a straight line toward an ancient, rotting forest, where a great lich was felled a long, long time ago."},{"name":"Schlechten Meister Kerker","description":" This powerful wizard commands his armies not from the field, but from his tower, through his unique scry-board. The battlefields are projected upon the board, and small figures appear to show the positions of his opposers, as well as his armies. Drawing upon the ancient knowledge of many great generals who came before him, he crafts dramatic battles, often taking the time to make a great deal of slaying the heroes on the battlefield. Though, he keeps an ever watchful eyes on those who oppose his power, and much prefers to craft innocent-looking situations that put the strongest warriors and most knowledgeable wizards in great peril. He wishes only to rule the lands, unopposed and with an iron grip."},{"name":"Admiral Khaadrun","description":" Race: Copper Dragonborn Class: Ranger (Hunter) The admiral of a rather unpleasant kingdom, Khaadrun hunts a variety of humanoids as well as innocent Merfolk for their treasures and magic. Once you are marked, you better armor up, because there is no running from the Admiral."},{"name":"Nitarog the Impaler","description":" Few orc warlords in history can compare to the legend of Nitarog Grimeye, Spear King and Impaler, and black-hearted mastermind behind the genocidal and destructive conquests of the Principalities of Allonel, and the nations surrounding them. He was an Eye of Gruumsh (Though not a spellcaster), possessing equal amounts of cunning brutality and brutal cunning, he was equal parts terrifying killing machine and master strategist. He possessed a single right eye, which was said to be able to kill the meek-hearted with a single stare. After first conquering the ancient mountain dwarf kingdom of Urshakd, he swept into the lowlands of Allonel, and struck down the human and elven Princes, burned their cities, and enslaved their peoples. By the end of his life, the once proud multiracial nations had been reduced to squabbling Orc chiefdoms, with the human inhabitants reduced to slaves, and anything even resembling a dwarf or an elf slaughtered."},{"name":"High Fang-chief Gurubayogg","description":" In an old deserted wood-elven realm, brought low by cultists of Baphomet, lycanthropy runs rampant among its current goblin inhabitants, at the behest of the Prince of Beasts. The various hobgoblin tribes, and the werewolf packs ruling them, have long feuded with one another, until one of the lycan Fang-Chiefs defeated all his rivals, and united all the various werewolf packs (And their tribes) into a single, great horde of primitive, barbarian goblinoids. With the unnatural werebeasts serving as a form of shock troops and cavalry, the hobgoblins swept into the other elven realms under the High Fang-Chief Gurubayogg, and were only barely beaten back by elite wood elf forces armed with magical weaponry. Gurubayogg survived, however, and still commands his loyal packs to raid the elven border hamlets. Should he be slain, however, the packs would fracture and go their own way..."},{"name":"Ser Dagmar, of Sevensooth Abbey","description":" Ser Dagmar was also a very possessive man. He coveted the wife of his best friend and arranged it so that his friend\u0027s legion was caught in an enemy trap and eradicated. He then moved to comfort the grieving widow. When his own wife discovered this, she threatened to expose him and he cut her down in a fit of rage. Unfortunately, the widow witnessed it and fled to the fortress at Sevensooth Abbey with him hot on her tail. He demanded that the priests turn her over to them but they denounced him as an anathema in the eyes of the gods. That night, he stormed the Abbey while they slept and tortured the priests to get them to reveal her housing place, but none could tell him because she\u0027d snuck away. Refusing to believe them, he tortured and slew every inhabitant of the keep until none survived. Outraged, the God of the Abbey cursed him to forever live a half- life, imprisoned within the Abbey, surrounded by the shambling corpses of his soldiers and haunted by the spirits of the priests."},{"name":"Grazlav the Fearless","description":" Few dare to stand in the shadow of this great warlord. He gazes upon armies with a look as were he superior to all. Hobgoblin in nature, Grazlav grew up with war. His father being a warlord and his brother being in the army, the fierce hobgoblin learned the way of war at a very young age. However, not much later did his clever prudence turn into rage and revenge, as his right arm was cut off in a battle against an elven soldier. Not much later was his brother kidnaped and eventually killed by the great Silverant Legion. It was then that his fierce and utterly ruthless rage for the elves was birthed. He grew into a full-fledged warlord, sometimes called the One Armed, though he did have a false arm in place of his stump. To this day, Grazlav has been feared and has earned much respect among hobgoblins and goblinoids."},{"name":"Fendris North","description":" A human with a number of magic items on his person and the abilities of a sorcerer, he wants to rule the plains and manipulates other villains(read as: \"Competition\") into taking over regions for him, he then inevitably betrays them and takes their lands. Expect him to be making deals with the major villains using false names."},{"name":"Admiral Eldrush Mac Drenghus","description":" The Mac Drenghus family may be a well-respected clan, but they bear a single shame: Eldrush, the only son of the famed general Ilrick. While Eldrush idolized his heroic father, there was a single thing he idolized more: gold. So much so, that he offered to tell the empire that his kingdom was defending against about his father\u0027s plans for the war in exchange for a hefty sum of money. Eventually, he was caught, but not before being responsible for the loss of countless battles. He was exiled, before swiftly finding his place as an officer for the empire for which he spied. As he worked his way up the ranks, he became the admiral of the imperial fleet. As well as leading battles, he enjoys raiding merchant ships and pillaging port towns. If he were not flying the imperial flag, he would be known as a pirate king. He prefers to stay on his fortified galleon far away from battles he commands, enjoying all the luxuries he can afford. He is a skilled duelist, but this is not a skill he uses much - underhanded tactics are much preferred in single combat, especially if his underlings are there to assist him."},{"name":"Johnny Snakeye","description":" A former pirate who is now the commander of the town guard, he is known for false imprisonment of innocent people and torture. Although he is a human he has a parrot that only speaks drakonic."},{"name":"Prince Radcliffe the Halfdead","description":" Feared by most of the nobility Radcliffe was given a position in the far northern edge of the Kingdom to defend it against the Barbarian tribes of the north. Here his impressive military mind was shown, and his skill with the blade. Upon the death of his father many will oppose the Halfdead\u0027s claim, and he will do anything to claim his birthright, even calling upon the powers of his ancient blade to summon the fearsome Order of the Grave."},{"name":"Zarintra Torghym\u0027tyl","description":" Zarintra was born a High Elf to two clerics of Corellon. She was kidnapped shortly after birth during a Drow raid. The matriarch of the Torghym\u0027tyl house thought it would be amusing to fully corrupt a child of Corellon devotees. The child was raised as though she were as a Drow, taught to find joy in subjugation, assassination, and torture. Her devotion to Lloth was absolute and she became a priestess at the earliest opportunity. With cold calculated intent, and a bit of luck, Zarintra ended up the only remaining heir to the Torghym\u0027tyl house. When she ascended to the position she found no respect or recognition among her Drow \"peers.\" Determined to prove her worth, and their foolishness, Zarintra packed up her house and took her retainers and slaves out of the city and into the Underdark. She was determined to find a way to destroy the nearest surface city. With this in mind she continued to do what she had been taught to find pleasure in. She subjugated, tortured and now conquered her way across the Underdark accepting any that would do her bidding and enslaving or killing those that would not."},{"name":"Warlord Valeth","description":" Class: Warlock Location: The Northern Dominion of Valkhan Flag: Two argent diagonals with demon’s head upon a field of Gules Motto: We Strike Fear The Northern Dominion of Valkhan is a young state, carved by Valeth Sunburst. Until very recently, the northern territories were mostly inhabited by different tribes of men and elves, nomadic hunters and shamans who would make their way from time to time to another city to trade the product of their hunt with the locals. Their land was strife with danger, from the wildlife but also from the conflict that would erupt between the tribes for dominance over the most frugal piece of land one could find in the Frozen Wastes. That changed with the arrival of Valeth. Found by the Jiansi Tribe when he was a young boy of three, Valeth was put under the care of the shaman, an old man name Xo-Shi and expected to learn the craft from him and replace him when death would claim him. The boy was talented and learn the craft quickly; Xo-Shi would claim that it was Jiansi spirit himself that had lead the tribe to find Valeth. Upon a very rigorous winter, Valeth’s mentor died of hypothermia and Valeth was left to assume the mantle of spiritual leader for his people. He served for many years in such a role, but felt that his talents were wasted as a simple advisor whose suggestions were often ignored because of his inexperience. Fed up with it, Valeth stood before the Khan and ask for combat. The fight was short and would stay engraved within the mind of all those present for years to come. Valeth’s blade struck true every time, drawing blood and staining the snow covered ground while his opponent never reached him. When the Khan had barely enough strength left to stand, Valeth struck with magic and the screams that followed were said to be heard for miles. Now Khan of the Jiansi Tribe, Valeth was free to pursue his own ambitions. He gathered the warriors and told them that a new age had come for the northern tribes. No longer were they to stand divided, unity was soon to be brought upon them. And so it was, that Valeth carved himself a path to power by defeating tribes after tribes and proclaiming himself leader of their people. When the last tribe fell under his sway, Valeth proclaimed the land that stretches from the Hoarfrost to the river of Syria to be under the control of the Northern Dominion of Valkhan."},{"name":"The Monster of Salt Rock","description":" Beneath the dungeons of the seaside castle of Salt Rock, a beast of many tentacles and malevolent thought sleeps in a frigid, briny lagoon of a large cavern. The monster wakes every dozen years or so and chooses one of the castle\u0027s gaolers as a messenger. Sending the poor man to whisper to the lord of the castle, reminding him of an old promise. A bargain struck in time of need by one of the lord\u0027s forebears, \"Keep me well-fed, and your kin shall e\u0027er rule these seas. Deny me, and I shall devour all over your line. Where\u0027er they may be, I shall find them and call them to the sea.\""},{"name":"Old Horace","description":" The man who is called Old Horace (best just call him \"Horace\" in his presence) is unusual to say the least. He haunts the Docks and the alleyways of the Thieves\u0027 Quarter hobbling along, sniffing. Bent-backed and with a necrotizing wound where one eye should be, he slinks about the city nibbling on dead rats, raw fish, and recently deceased humans when he can get his bony hands on them. Horace knows a great many things about a great many people in high and low places. How he knows these things is a mystery, but he\u0027s happy to talk to anyone who can stand his foul smell and who offers him some sort of human meat on which to gnaw. But once the meat runs out, he\u0027s likely to try to take a finger or a toe to feed his constant hunger."},{"name":"Gladda Grippyweed","description":" Gladda is an old night hag who delights in hunting the great white swans that nest among the lakes and ponds of the Whistlewood. She never eats the meat, preferring roots and the flesh of humans and halflings to poultry and gamebirds, but she has uses for fresh swan\u0027s blood in her spells and she delights in destroying beautiful things, especially with her long fingernails and teeth, each filed to a sharp point. There are herbs that can grow in fetid bogs that are of great use for Gladda\u0027s dreamwalking spells in which she catches glimpses of the future. The forest makes a home for creatures that eat these rare wild herbs before they can flower. Gladda aspires to burn the entire Whistlewood to cinders and then flood the region to create a vast, poisonous bog. Thus far, she\u0027s only managed that feat for a few hundred yards around the pond on which her hut leans against a dead oak."},{"name":"Yonal Yoglas","description":" A towering frost giant with rotten teeth and a short temper, Yonal Yoglas gathers allies and waits. The men of the North drove his people into the high passes of the Hoary Range two centuries ago, and rather than perish, he chose to wait. The cold, grassy meadows below mountains had been the winter home of the great elk herds and the wolves that followed them that once wandered the North. After the men slaughtered the herds, the giants took to eating the men\u0027s sheep and cattle when meat north of the Hoaries became scarce in the winter months. Yonal Yoglas decided long ago that to save the giants, they would have to face near starvation for decades as they gathered their strength from the scattered caves in the high passes. Now, he has over 150 giants, trolls, and other cast-offs of the Old North poised to launch a terrific campaign to drive the men back into the sea and reclaim the lands for the giants."},{"name":"Doom\u0027s Servant","description":" This agent of the Dead God often takes the form of a tall, roughly-humanoid figure cloaked in black with a hood drawn down over its face. Many sources claim the Servant favors killing by way of a huge scythe, some suggest a headsman\u0027s axe, still others by way of a poisoned dagger. Death is a mercy for all mortals who must suffer the uncomfortable pangs of life in this world. The Servant works tirelessly, wandering the lands, leaving plague, famine, and wars in its wake, striving to bring death swiftly to all so that they may find peace beyond the veil. One written account by a half-mad priest describes the visage of the Servant beneath the hood; the priest died three nights after putting the words to parchment."},{"name":"Alitheal, the Gentle Light","description":" At the dawn of the current age, the God of Justice weighed the hearts of men in the world and declared them unfit to continue. He sent his angel Alitheal to walk the world, bringing sweet and gentle death to the good souls, so they may be spared suffering this existence among such wickedness. Alitheal slips into bedchambers in the pre-dawn light to gently kiss the life from innocents. Whole villages have lost most of the infants and children in a single morning at the hands of this angel of mercy. In most cases, Alitheal has moved on to deliver souls in another place at the next dawn before any can comprehend what has happened. A few dreamseers have received visions of Alitheal\u0027s work, and their nightmares have fed a growing fear and panic that has called on the bravest hunters to slay the Gentle Light."},{"name":"The Archaeomagrix","description":" Prior to becoming the refuse dump for a succession of towns, cities and civilizations, the Glidden Lawns were home to one of the most prestigious universities of its time. The ruins are there still, buried under tons of offal and waste, and can be accessed via a lone smokestack that still (barely) pokes above the mounded garbage. Those who\u0027ve visited - and have had the pleasure of returning - speak breathlessly of bundles of wires as thick as your thumb, spun from gold, and studded with sapphires that seem to pulse with hidden light. They describe deep, thrumming engines and incredible heat; vast machines softly whirring in the dark. In hushed whispers, they tell of distant voices that seem to crawl around in the back of your skull, and an itching desire to go far, far away and never return."},{"name":"Sister Lunette","description":" The closing of the orphanage was considered by many a merciful thing. Already cool relations between the \u0027noble\u0027 races and their Orcish cousins had been exacerbated by the outbreak of the Patron Wars, and overnight, donating to the \u0027Half-Orc Orphan\u0027s Fund\u0027 went from high-profile charity to social suicide. As money ran low and the front moved closer, the working clergy found themselves in an impossible situation. Many fled from (or in some cases, to) the fighting, leaving only a handful of nuns to care for, protect and feed nearly two hundred children. With tensions fraying and food running low, Sister Lunette made the \u0027hard decision\u0027; in the early morning, just after prayers, she methodically slaughtered almost sixty half-orc children with a pair of pruning shears. The other nuns, hesitant to turn their friend over to the authorities, restrained her with yards of knotted bed linens, and locked poor Lunette in the farthest corner of the cellar. A fictional Orc barbarian was named as the perpetrator of the heinous (if understandable) crime, and soon after the remaining orphans were dispersed and the orphanage shuttered. In one last, merciful act, the departing nuns unlocked the cellar, leaving Sister Lunette to the mercy of their God."},{"name":"Haverplam, Chitterdale and Jormungroth, Attorneys at Law","description":" The facade is stately, the furnishings in impeccable taste. Most visitors never make it past the anteroom, where a fetchingly (if professionally) dressed succubus holds court in airy resplendence. She wields her power delicately, casting a judgemental eye on all those approach the massive double doors that lead deeper into the office, bidding them speak on what foul treachery led them there. Few can bear her scrutiny for long, and those who recant, or gibber, or collapse are led through a side door to be put out into a side alley, where they can slink away in shame. But the ones who weather her scrutiny - her litany of incisive questions and scathing analysis - are bid welcome to pass through the threshold, where an impish paralegal waits to lead them down an impossibly long, impressively ornate hallway. At the end, in a font hewn from ebony, under a fountain of putrid blood, awaits the trimulative. With a single bloated body between them, each head lolls sickly from its own withered neck, speaking in turn in singsong madness. A single voice speaks from somewhere behind them, \u0027We\u0027d be delighted to take your case! Now, if you\u0027ll join us in the pool, we\u0027ll discuss our nominal fee...\u0027"},{"name":"Gert, the Click-Clack Girl","description":" She taps her stick as she wanders, humming tunelessly with the beat. Where she goes, the world gives way - crowds part, alleys widen, puddles dry. Cobbles straighten as she treads on them; doors open as she raps on them; dogs lie down and die as she peers at them with her pearly, unseeing eyes. She\u0027s just a girl, they say, begging alms on the cruel streets... and yet, still. Still. You don\u0027t cross Gert. You give her your silvers as she passes (click-clack, click-clack), then move on with your life. Nevermind that in some light, you can see the cruel-looking things that gather and gambol in her wake, like snub-nosed lemurs with eyes full of glittering hate, but not at all like that also. Like sharpened shadows, perhaps. No? Like wheels, turning and turning with increasing speed? You don\u0027t think about those. You don\u0027t look backwards, and you don\u0027t think too hard about the ale your silvers would have bought you, \u0027cause they weren\u0027t really yours, anyhow. They were Gert\u0027s, and you were keeping them safe for her, that\u0027s right. Poor girl. Poor, sweet, precious (click-clack oh gods oh fuck oh gods click-clack), precious, lovely, sweet, wonderf...GRKKKKKKKKkkkkkkkkkkkk"},{"name":"Kral","description":" Kral is a kindly appearing older man, who runs an orphanage to care for the city\u0027s many poor orphans. But, in truth he\u0027s a nasty, vicious Goblin sorceror who alters his image to appear kindly and older so the cityfolk don\u0027t question his care of the children. Because the care he provides the orphans is to have them kneel and pray to their god while he puts a barrage of magic missles into the back of their heads. Then he teleports himself and the corpse to a butcher shop in a goblin town, where the butcher pays him quite handsomely for each child produced, as the meat is quite popular with the town\u0027s residents. Kral himself looks upon it as doing both places a favor. As the city doesn\u0027t care about the children, as rarely does anyone follow up to find out what happened to a child they drop off. When they do, he tells them that the child was adopted by a wandering family of caravaneers and could be anywhere by now."},{"name":"Bastion the Last","description":" Having seen his entire production batch smashed to bits in whatever war they were built for, the Warforged known as Bastion decided he would not suffer the same fate. Half-mad with terror and obsessed with his quest for indestructibility, he now attacks outlying towns to abduct their blacksmiths and wizards. This serves the dual purpose of finding new craftsman who can add on to his ever-growing defenses, and putting said defenses to the test; although he is motivated by fear, Bastion constantly seeks to ascertain his invulnerability in battle. His many layers of armor and magical enhancements weigh him down so much that he prefers to go about on all fours, and Bastion\u0027s original shape is almost entirely obscured by his new, hulking form."},{"name":"The Lord of Salt","description":" Not undead in the traditional sense, the dessicated body of Malchaster the Transmuter is conserved by the elemental spirit of salt he bound to himself. The century-long struggle between wizard and barely controlled spirit has driven both of them quite insane, and while nobody knows exactly what the Lord of Salt wants, sea-captains agree that the sight of his driftwood castle floating on the horizon is a bad news."},{"name":"The Croaking Man","description":" Appears as a disgustingly frail old man, constantly hunched over. It wears little to no clothing, and is covered with sores and pimples. Instead of a neck, it has a large flabby sack (like a frog\u0027s) that droops all the way down to its feet. It dwells in the deepest, most abandoned forests where civilization is far away. Its origins and motivations are unknown, but it dwells on one thing: to cause terror. The large sack on its neck houses a lung of poison that it secretes into the nearby atmosphere. One whiff of the gas, and the inhaler starts hallucinating: gigantic monsters chase them, they fall down a hole to hell, or their friends betray them. The hallucinations seem longer than they actually are. No harm is done to the person during the hallucinations, but almost all victims commit suicide or go insane due to terror. In their brief moments of lucidity, when their minds resist the poison, victims report a horrific croaking, and see a frail man perched on a tree fanning a large sack before they fall into another living nightmare."},{"name":"The Spindle","description":" A skeletal figure with incredibly long limbs, covered by a loose skin blotted with gasping mouths. The Spindle moves like a spider above the treeline of ancient forests, moving only at night as to not be spotted. When it finds prey (always someone camping or sleeping for the night), it perches itself at the top of the treeline and droops down its incredibly long arms above the entrance to the victims tent. From a distance, the creature blends in with the branches of the tree. Then, while the victim is inside, its many mouths begin to simulate sounds of a far away celebration or party. Once the victim moves out to investigate, the Spindle stabs the creature and absorbs its skin into its skeletal frame, adding another mouth to its collection, and another voice to tempt travelers with."},{"name":"The Dredge","description":" After a powerful storm at sea, debris from the bottom of the ocean often float to the surface for sailors to claim or avoid. Most sailors can recognize a normal salvage: seaweed, wood scraps, maybe a fragment from an old ship. However, the most seasoned sailors will tell the deckhands to never claim anything from the waves in fear of the Dredge. if you ever see a locked chest, a woman screaming for help, or something that seems too good to be true, it\u0027s often the Dredge\u0027s tendrils tempting a young sailor to his death. Appearing after storms, the mess of tentacles and tendrils called the Dredge displays a tempting display of salvage that it collects: the items often are exactly what sailors want, sometimes even personal items. It\u0027s unknown where the creature gets these items, but as soon as anyone attempts to grab one, even if they use a hook or net, the tendril reels them into the deep with amazing force. None of them ever return."},{"name":"The Blood Merchant","description":" Most cannot stomach the varied sacs and chambers that comprise the back of this creature, filled with the lifeblood of countless beings. While most often patronized by vampires and such bloodthirsty ilk, morally bankrupt mages also peruse the beast\u0027s services. It barters in some of its gains with those that would provide it benefit, but saves the choice liquids for itself. Its multiple needle-like proboscides twitch in anticipation of it\u0027s next meal."},{"name":"The Flying Madness","description":" The Mind Flayers desire to consume the minds of the living, but there are minds so powerful even the Illithids are mad to attempt them. Whether it was a single Flayer or a group, it will never be known, but they attempted to eat the mind of an ancient Gold Dragon. The might of dragons is not that of mortals, especially those old enough to remember the making of the world. But the Illithids are in their own way beyond the world, and instead of consuming the dragon\u0027s mind or being consumed in turn, a horrid fusion resulted. The Dragon, its original name now forgotten, has misshapen tentacles sprouting from where its face once was, like fungal bodies. Where its eyes should be are suppurating pits, forever dripping corrupting slime. Its once lustrous hide is now pocked and rotted. It flies randomly across the land, shrieking a terrible silent scream that is heard in the minds of people miles away. Anyone who falls under the shadow of its wings is driven irrevocably mad."},{"name":"The Cogs","description":" Long ago, a Dwarven king called for the creation of a Wonder, a mighty walking fortress that could bring war to the most distant enemy. The mightiest and most skilled artisans worked for ten generations, until the castle was complete. Taking the form of an enormous Dwarf, it could stride across rivers and smash through castle walls with ease. However, they made it too well. The complex mechanisms inside it, designed to allow it to repair itself, began to leech minerals from the rocks themselves, and eventually subsumed the Dwarves who dwelt inside it to become part of its mechanism. It is named after the tiny automata it creates, that form the first sign of its coming. Tiny things made of cogs swarm ahead of it, scouring the land of everything - animal, vegetable, or mineral. Everything is ripped apart into its component parts and conveyed back to the main fortress, now a bloated monstrosity of metal and stone. Inside, organic matter entwines around cog and wheel, forming a hideous fusion of meat and metal. Left to itself, it will scour the world clean of everything until it sits alone on the earth."},{"name":"The Eating Slick","description":" Summer is often a time of relaxation and ease, at least for those few that can afford it. One of the greatest pastimes of summer, then, is swimming, often in a lake, reservoir, or similar water source. In one such lake, secluded and idyllic, lives the Eating Slick. It is difficult to see, even under the best conditions; it manifests as a silent black circle that forms seamlessly to the water of its lake, not unlike an oil slick. Appearance is where the similarities end. The Eating Slick moves under its own power, and is utterly predatorial. It allows unsuspecting swimmers to move out into deeper waters, and once there, it consumes them. Whole. Its surface is like that of an Ooze, dissolving and searing flesh on contact, and with each eaten victim it grows. We are lucky that it lives in a lake; should it ever reach the ocean, there\u0027s no telling what horrors could result."},{"name":"The Unhappy Blob","description":" It was caught in the dark recesses of a cave and transported to the fortress where it was put into a deep pit. It wasn\u0027t happy about that, but then these strange creatures that caught it started throwing other such creatures down into the pit for it to eat, and that made the blob happy. It was quite happy for quite sometime, as the creatures would gather on the edge of the pit, make strange noises and then throw a usually still struggling creature much like themselves down into the pit for the blob to happily spend time digesting. But, then one day the Blob noticed that the creatures had stopped coming, and had stopped throwing him food. This made the Blob unhappy, and so the Blob decided to ooze his way up the sides of his pit and go in search of food. Which is really too bad for that nearby town."},{"name":"The Lady of Justice","description":" In a small mountain town there is a bronze statue of a woman holding an olive branch in one hand and a sword in the other. Before this woman is a bronze scale. Sitting in the basin opposite this woman are four small bronze men, sitting in the basin before this woman is empty space. Whenever a man or woman commits a crime, they are brought before the Lady of Justice, and put their head on the scales to be judged. Through strange mechanisms their sins are weighed. If they are innocent, the men will fall and the Lady offers them an olive branch. If they are guilty, the Lady swings her mighty blade and slays them. The angrier the townsfolk, the more vigorous the Lady strikes. A bloodthirsty mob throws a fugitive at her feet, willing the scales to tip. The criminal\u0027s head meets the scales and the men raise in judgement. The Lady tears away her face to deliver the kind justice the people truly crave."},{"name":"The Ashen Legion","description":" The Ashen Legion is a force of conquest in it\u0027s purest form. It has no king and no nation. The grey forms of men in armor from a time long since passed leave a thick cloud of choking ash wherever they march. People in their path of all races and creeds are cut-down without thought. Their mute commanders mull over the tactics to take whatever happens to be in their path, issuing commands only the grey soldiers seem to hear. They ignore any other attempts at communication, dumb to reason and curses alike. The Ashen Legion burns cities to the ground, the only resource they value the ash of things that men have built. Felled soldiers return to the cloud, where they accumulate into new recruits, just as strong as the last generation. They hold territory simply for the sake of holding it, and they expand their borders with little rhyme or reason. Cities are razed, resources are ignored. Even though they march without purpose, their commanders are wily, and will win battles without pressing the Legion\u0027s immortality. Kingdoms are eradicated, ways of life are destroyed, women and children slain without thought as the Legion marches forward. And at the heart of their holdings an angry god lays slain, bleeding a pool tepid, grey War."},{"name":"Resnin the Seer","description":" Best not to make deals with the devil, of course, you don\u0027t always know it\u0027s the devil you\u0027re dealing with. Resnin the Seer is not what you\u0027d call monstrous by first glance but if you ever see behind the veil, your mind just might come loose. He resides in the lesser part of town, living above his small shop where he grants healing, potions, and untoward favors in return for a small favor from you. Somehow the things he gives you always leaves you coming back for more and the favors he asks grow darker. Your soul is going to be his eventually, just give him time. Then you can join the others that are trapped, pushing forward beneath his gnarled olive green skin, unable to escape this horrid fate."},{"name":"Ol\u0027 Clayven","description":" Clayven was once an ordinary elf like you and I, or so the stories say. But Clayven, unlike most elves, was a greedy sort. He gathered everything he could and never let a treasure leave his grasp. As his horde grew, he had to grow bigger and bigger homes to store it all. He also had to create more and more guardians to keep others out, until he was eventually alone with only this constructs. Clayven grew more and more paranoid and mad going so far as to accuse his own constructed guardians of theft, eventually destroying all of them. Left to his own devices, he slowly grew malnourished, afraid to leave his treasures unguarded. With time, his body seemed to wither away and his home did as well. Those who have gotten close to his home, have been chased off by a nearly naked, pale, hunch backed creature with one large eye and long claws on each hand. As they ran, they swore they heard it scream, \"Mine!\""},{"name":"The Tortured Man","description":" Certainly the tales invented by mothers to keep their children inside at night, the tale of the Tortured Man is told at bedtime when the lights are low. It is said that a man, down on his luck and hungry, entered illegally, the estate of a mad wizard to steal some food. Unfortunately the man was caught and drug down into the basement laboratory. Not seen for weeks on in, the man was presumed dead and lost. Now, each night, a horrific creature roams within the walls of the mad wizard\u0027s home. Its eyes gouged out and its mouth sewn shut. Where it had hands now only two metal claws and its legs removed below the knee. Outside the wall you can hear the clank, shuffle, and scraping as it patrols."},{"name":"leg","description":" but if you ever see behind the vale vale Those two aside, I loved Resnin the Seer and the Tortured Man."},{"name":"The Green Caves","description":" Within the foothills of Mount Glamoral lies a cave entrance mostly obscured by shrubbery. From the entrance a sickly green light can be seen welling up from further inside. If someone goes deeper into the cave, as the tunnels bury deeper into the earth, past a glowing green barrier of sigils lies a race of misshapen abominations. The spawn of a pit fiend and whatever wildlife once lived here, and it is said that at the deepest depths lies their ruler, that same fiend, who nurses a bitter hatred for the light above and those born in it."},{"name":"The Breegard Gamekeeper","description":" Hunters and poachers know to stay out of the forest between Breegard and the mountain, but careless travellers are not so lucky. Those who make it into town will be told the story of the Gamekeeper. He was once employed by the local Lord to ensure a good stock of animals were available for the hunt and did his job so diligently that a deity recognised his labours and granted him an unnaturally long life. That was centuries ago, but far from feeling blessed the Gatekeeper is now insane, wretched and wracked by the years. He defends the forest from all intruders and has spent the centuries breeding his hounds into monstrous beasts which now only passingly resemble dogs. Now he seeks to extend his dominion to all the forests of the world, capturing and twisting any travelers he can find to serve his aims."},{"name":"Alumar","description":" Alumar, the beast of poisoned light, was an elemental who once shone with the gentleness of sunshine. But in seeking to enhance her powers, she became a monster of sickness and death. Her light burns living creatures, and even fleeting exposure leads to fatal illnesses. Folk who encounter her lose hair and teeth and their skin erupts with blisters. Alumar believes that she can leach away her powers by inflicting them on any creatures she encounters, and hopes that if she spreads her light among enough creatures, she can one day return to the creature of mild light she once was."},{"name":"Kain","description":" Kain is as old as mankind itself, created by a handful of Gods as their would-be Assassin. Forged as a Demi God, the soul of a Dragon, and the body of a Devil. Kain is a Godslayer, accomplishing this by seeking out worshipers of his target God and slaying them in masses to weaken the God\u0027s power as Faith is the resource for a God\u0027s strength and sets their hierarchy within the heavens. Kain is genderless and uncaring for mortal wants and needs and seeks only to rid the heavens of his former masters. Kain wields a colossal Scythe that opens portals to other planes/dimensions and makes wounds near impossible to heal from. There\u0027s a laundry list of powers, abilities, and feats Kain has, but if you want to use this character you\u0027re free to do what you want (but you may PM to ask as well). With picture! http://orig12.deviantart.net/be32/f/2010/350/1/7/174a0e5e16c2f90f441ad9c0761faae6-d350x51.jpg The picture is mine, I commissioned it and it\u0027s copyrighted. Fair use applies still anyway. Have fun with it, just don\u0027t sell it. (My personal version the left has all red skin as it\u0027s supposed to)"},{"name":"Mercer Leon, CEO Leon Trading","description":" The brand of Leon Trading is known to most adventurers as one of just enough quality to get by. Its rise to fortune and the mainstream was extremely fast, and somewhat suspicious. It is a common joke amongst the denizens of the Capital that Leon has some sort of oracular foreknowledge that prevents him from making a bad trade. They were more right than they would ever know."},{"name":"Kathera the Vengeful","description":" Once upon a time, there were two lovers, joined in heaven and earth. A star spirit and a moonfolk, their commitment to each other was known throughout the plane. Kathera knew of her imminent mortality, but wished to stay by Aquila\u0027s side for eternity. Using ancient magic, she sealed her soul into her masterwork, a silver sword of finest craft. They were together, but the star spirit found his feelings did not possess the longevity that Kathera\u0027s did, and he cast the sword aside. The spirit of the moonfolk overpowers those who wield her blade, forcing them to seek out and destroy her traitorous lover."},{"name":"Malandrach of Many Devices","description":" A dark elf who\u0027s quest to shift the world\u0027s political landscape from theocracy towards democracy forced him to take drastic measures, Malandrach achieved lichdom hundreds of years ago and has been gathering power ever since. Each attempt to realize his goal has failed, simply requiring more power. His research team, headed by the ingenious Doctor Cyrilla, develops creative new uses of the world\u0027s available technology, a notable one being a revolving barrel that allows quick access to different wands. Though his actions have in the past been towards the evil end of the spectrum, he is not evil for its own sake, instead hoping that this phase is a means to an end."},{"name":"Archangel Avalon","description":" The Forces (capital F) are not really gods in the same way that mayonnaise isn\u0027t an instrument. They are divine in a completely different direction than the world\u0027s pantheon, almost quantifying their strength with imaginary numbers. Most of them do not interact with the material plane, and to fight one is as much a folly as to declare war on a forest, or the sky. Avalon, one of the weakest of their number, is the only one that will even reveal itself. Its body isn\u0027t entirely contained within the three dimensions we are used to, resembling the biblical descriptions of angels. It appears to those who cross heaven and earth seeking to challenge it, almost like an immature child wanted to demonstrate its power."},{"name":"The Black Helm of Sunbury Vale","description":" Usually, things such as the Black Helm take shape in a wizard\u0027s laboratory on a dark and stormy night. The Black Helm, however, was created by an unremarkable blacksmith in the small hamlet of Sunbury Vale. The blacksmith had crafted a fine suit of armour for a noble to wear in an upcoming tournament, and an apprentice of the local arm of the Mage\u0027s College had been tasked with enchanting it. Unfortunately for all involved, his spell went awry - the armour, instead of receiving a defensive charm, received a life of its own. The now-animated plate mail attacked the blacksmith for berating the apprentice mage, and killed him. The mage was put to death by the inhabitants of the village - this enraged the armour [a Helmed Horror], causing it to wipe out the village. It\u0027s twisted and damaged consciousness began to reflect the fault for the mage\u0027s death not only on the villagers, but on all it encountered. The Black Helm now wanders the countryside, gradually roaming farther and farther from Sunbury Vale in order to sate its thirst for vengeance against those who it thinks killed its creator and master."},{"name":"The Reacher","description":" No one really knows what the Reacher is, or where and when it came from. Some say that its kind originate in the interstitial spaces between multiverses. To say that they exist there would be a mistake - no one knows if existence as we perceive it is possible there, even as a concept. What little is known about the Reacher is based on myth, speculation, and anecdote. Physically, it appears as a bright blue skein of energy stretched across a human skeleton - perhaps the Reacher is a parasitic organism still possessing the body of a long-dead host, or perhaps it\u0027s merely the Reacher\u0027s way of normalising itself to the Material Plane and existence as beings of this particular multiverse perceive it. The most interesting facet of the Reacher\u0027s existence is its interactions with matter. It has been hypothesised that the Reacher exists in five dimensions in this universe - the three spatial dimensions we can perceive, the temporal dimensions, and a fourth spatial dimension that is incapable of being interacted with by any being in this universe. This means the Reacher is able to pass through any form of matter directed against it, and even alter time as it pertains to individual objects. Indeed, the Reacher\u0027s name comes from a memorable incident in the 893rd year of the 4th Era, when it reached through the walls of a box that had been magically sealed by the six Archmages of the Adamantine Court, and in the process aging it into dust. Should the Reacher ever turn its azure gaze upon you, know that there is no escape - it is everywhere and nowhere, everywhen and never."},{"name":"The Lupenwald Fiend","description":" Deep in the heart of the massive Lupenwald forest, the trees all bend their branches towards a central towering pillar of volcanic glass. With the correct rituals, a little magic and an unwilling sacrifice, ancient oaken branches reach down and embrace the pillar\u0027s unfortunate victim. Then the Fiend rises. Eight and a half feet tall, it holds itself upright with four enormous, jointed branches sprouting from its lower back. The victim\u0027s body sways in the wind, little more than a warm moist shell for the Fiend. Soon people in nearby villages disappear, only to be found impaled on withered pine trees. The Fiend will not abandon its grim harvest till all the Lupenwald\u0027s trees may feed on blood and bone."},{"name":"Barg Greenblood AKA Pukefist","description":" Once the chieftain of several hundred goblins living under Rockbilt Mountain, Barg was content to run his little kingdom and get fat on the offerings of his kin. All that changed on the day a group of adventurers came into his cave, killing most of Barg\u0027s family and friends. The \"heroes\" attacked Barg in cold blood and left him for dead alongside a green ooze that had infiltrated the caves. The lingering magic from the spells unleashed in the cave reacted with Barg\u0027s hand and the dead ooze it was resting in. The reaction had a strange effect: When he awoke after the fight, Barg\u0027s arm was no longer flesh and bone, but rather had become a limb made of ooze. Fueled by fury and anger, Pukefist (as his legend is known among local goblins), ambushes humans and elves alone on the roads near Rockbilt. He uses his ooze-arm to choke his victims, and in some cases will even use it to melt the skin off their faces. All that was once Barg, happy, content and full of food has disappeared and a thin, angry, mutated mess is all that remains."},{"name":"Sek\u0027ril","description":" War is oftentimes a horrific, monstrous thing, and that\u0027s exactly what war creates. The embodiment of death and decay, Sek\u0027ril overtakes the lifeless corpses of war-torn victims. Most often seen in piles of bodies, Sek\u0027ril slowly feeds off of them, growing in strength. He speaks not in words, but with psychic abilities and cares for only himself. Sek\u0027ril desires nothing more than a meal, and if that means controlling weak minded men and women then so be it. At his peak levels of strength, Sek\u0027ril has been know to cobble together animated corpse golems to his bidding, as well imbuing conscious thought into corpses, creating horrendous zombified servants."},{"name":"Fargith, The Giver of Dreams","description":" It is said that there lives a roiling mound of flesh in the sewers beneath the city which possesses a malevolent mind. It kills two kinds of people. The first are blue eyed children. Some people who has seen the monstrosity says that it is incorporating the eyes into its own form. Forming them into a facsimile of a face; multi-faceted blue eyes, blue-eye-teeth, blue-eye-freckles. However, that is not all the eyes. Some are also found hanging on strings at random spots around the sewer. The second kind of people it kills are those that touch those eyes. Those people and their entire family. So, if you see a small, child-sized blue eye, hanging on a string, seeming like it is watching you, don\u0027t touch it. Just leave it alone. Said to be perhaps the most lethal assassin in the world. A figure wrapped in a hooded cloak of darkest black, beneath which appears to be only shadow. This is held up by those who proclaim him to have such abilities as being able to pass through barred windows and underneath locked doors. When the Shadow Assassin is hired, his victim is invariably found suffocated to death a few days later. But it is the payment that the Shadow Assassin demands that sets him apart: the person you love the most, passed by your hand to his. Nobody knows what happen to these loved ones when they are whisked away by the assassin. In the middle of the desert of Yum lies the City of Dreams. Some would say that it is ruled by a demon, but the demon himself and the people who seek him would say that it is served by a demon. For those that dwell in the City of Dreams have their every desire fulfilled by the demon. The resurrection of loved ones, a life in opulent luxury, the ability to kill and torture without risk or retribution. Newcomers to the city find it a kaleidoscope of dreams from the noble to the decadent to the horrifying. But all citizen are under the protection of the demon. By the power of the demon no citizen is allowed to experience any want or hurt or discomfort. Once a newcomer has accepted the demons pact and become a citizen, they never leave. Why would they?"},{"name":"Unodoche","description":" Cursed by some ancient magic to live in transition between the material and inner elemental planes, Unodoche has no clear form; to see him is to see a distortion. Materially, he is a giant tentacled mass of flesh and muscle with no distinct head, rather various eyes, nostrils and mouths are cut randomly into the rubbery flesh of his body. As he moves he passes between planes so that only cross sections of his corporeal form are visible, and so to any who behold him he appears to flicker in and out of existence like flames do, only where orange and red transparencies would be, solid fragments of muscle and bone and sanguine fluid phase in and out of sight, morphing and deforming, as though being sliced apart and healing over and over again. Tortured by his horrific existence, he has grown hateful and violent. In the vast desert dunes of the Dead Empty where he is known to roam, the native wanderers say to keep your wits about you, for Unodoche is cruel and devours all who meet him."},{"name":"The Bilker of the Belt","description":" Gauul, known to any who pass through the belt of fens south of Fort Gloomheart, is a giant fetid frog with a taste for wealth. His breath is so acerbic that being within 30 feet of one of Gauul\u0027s infamously nauseating belches will cause acid blisters and melt away flesh. He has a close-knit gang of troglodyte flunkies who collect for him seekers of highly appraised artifacts claiming to have them for sale. They are then liberated of their gold and fed into Gauul\u0027s giant gullet where he consumes them gleefully."},{"name":"Let\u0027s meet these soulmongers and destroyers!","description":" Powerful demons and devils make excellent really bad guys. Fiendish villains can cloak themselves in complicated schemes, hide behind the flesh of a mortal, and act on impulses and desires that mortals cannot comprehend. I\u0027ll post a few examples (which may or may not have drawn inspiration from here)."},{"name":"Plyrr, the Shard","description":" Plyrr dwells in the periphery of events, preferring to milk small travesties where others wreak terror on larger scales. Still, his presence is feared by the wee - many a pixie has come home to find their family pinned to a hawthorn branch, their wings scattered in the underbrush below. He appears to mortals as a small bird, with grasping, long fingered hands where his feet ought to be, and his song is said to give mild indigestion to the young and weak at heart."},{"name":"Sluuth, the Carrion Legate","description":" Rare amongst Devils, Sluuth is an honorable foe, hewing closely to an ancient (and staggering complex) personal code that governs his every action. Even rarer - his legion is a mixed one, made up of fiends, awakened monsters, mortal races, fallen celestials and countless others. He is not to be trifled with, and has been known to put entire kingdoms to the sword to prove a point, honor notwithstanding."},{"name":"Hgrph, the Seamstress","description":" The peak she guards is a lonely one, and she spends her long twilit days circling it on wings hewn from shards of ebon and flame. While most pass under her shadow unscathed, the unlucky few who catch her notice are rarely seen again. The hermits who dwell on the edge of her quotidian gyre advise travelers not to think hungry, lustful, or prideful thoughts, lest Hgrph take notice."},{"name":"Valnirith, the Crucible","description":" Valnirith was a Paladin in life, drawing on a vast well of personal fortitude in her pursuit of justice and righteousness. But when the minor God she served forfeited their glory in exchange for a throne in the hells, the power she had wielded was ripped from her. In her sorrow and terrible fury, she swore vengeance on her erstwhile master, descending into the pits to find him. She is quick to ally herself with those who will further her cause, but just as quick to cross those who run afoul of her paranoia."},{"name":"Maelfestryx, the Schemer","description":" Perpetually wandering amongst the mortals in the guise of a senile gnome, Maelfestryx randomly gifts travelers with small bobbles, trinkets, and gizmos that he uses to spy on the machinations of the world. He has gathered a vast repository of information, enough to blackmail a whole kingdom. His plans and motives at this time are uncertain, but when he finally makes his move you can expect that it\u0027s going to be a doozy."},{"name":"Geggomon, the Iron Toad","description":" Geggomon resembles a great muscular toad with the head of an ox. His massive stomach is filled to the brim with iron ore, hauled from the earth by his army of slaves in order to feed his insatiable appetite. What he eats in iron ore is eventually shat out as steel, stronger than any forged by mortal hands."},{"name":"Ebrudaal, the Bone Tyrant","description":" In life, Ebrudaal was a celestial prince; a great two-headed eagle with golden feathers. Cast out of the heavens for some sin long-forgotten, he spends his days in the depths of hell, now undead and in skeletal form. His rage at his punishment fuels a passion for violence and torture that he is all too happy to inflict on anything around him - even other great demons give him wide berth."},{"name":"Vak, the Void Shadow","description":" Vak\u0027s visible form is that of a man-shaped vortex or void; a hole in the universe from which erupts the wild winds of his hatred. It is said that the lightest graze from his finger is enough to utterly erase a being from existence. The only material thing able to touch Vak without being obliterated is the diadem that rests upon his brow, rumored to grant its wearer true immortality."},{"name":"Yissik the Friendless","description":" Yissik\u0027s passion is the perversion of loyalty and the twisting of alliances. He finds the most offensive state of the mortal world is the co-operation which some foolish souls call \u0027natural\u0027. Wherever mortals stand together, wherever common ground is found, wherever differences are put aside, Yissik will turn his gaze - and begin his plans. All too often they succeed as the mightiest of bonds may be broken by the simplest of whispers, if they fall in the right ears. His mortal form is fluid, though it remains simple and gregarious, full of the seeming of goodwill and bonhomie."},{"name":"Fzar H\u0027kat, the last necrophore","description":" Fzar H\u0027kat has always felt anger and ressentment for dragons, which had slaughtered most of his race several thousand years ago. The necrophore used to be one of the most powerful empire on the land and ruled with an iron fist, until they declared war to the emerald dragons. Necrophores are thought by most to be just a myth, as they haven\u0027t been seen aboveground in a long while. These cunning creatures have a distinctly creepy physique, with twenty long spider-like black legs under a green reptilian torso. Their small white eyes aren\u0027t of much use and they instead rely on their bat-like ears to navigate the tunnels where they live. A few decades ago, Fzar\u0027s village was found by a scout of the emerald dragons and subsequently destroyed. Everyone in his community was murdered, including him. Fortunately for him, he was a fervent cleric of one of the gods of death, which granted him a new life and some powerful necromancy abilities. In exchange, he has to garner 200,000 souls before dying again, or his own soul will be sent to the shadow realm and locked forever."},{"name":"The seventeen bastards","description":" Born of the union between a tricky gnome and several goblin widows, these seventeen half-goblin are especially dangerous. They have the savage cruelty of their mother but the cunning wits of their father, as well as a thirst for adventure that not a lot of goblins usually have. They look distinctively goblin, except for their orange hair which comes from their father. Quwip is the biggest and meanest one of the bunch, a large muscled half-goblin wielding two small waraxes and ruthlessly cutting down anything in his path. His fellow half-brothers and half-sisters are just as dangerous as he his and include talented sorcerers, agile thieves and battle-crazed barbarians. They managed to tame a pack of worgs which they use as mount."},{"name":"Kor, the fallen prince","description":" A red dragonborn, banished from his kingdom for trying to overtake his father\u0027s throne. He wanders the land, searching for wealth and glory to eventually build his own empire and army in order to take back the kingdom that he believes is his. He will stop at nothing to achieve his goal and would gladly kill any number of innocent lives if it could bring him a step closer to his throne. He would probably sell his soul to Lucifer himself in exchange for his throne."},{"name":"Juliet, the kyton mother","description":" Killed during a particularly painful sacrifice, Juliet\u0027s soul was taken by the devils of the darkest depth of hell, where she became a deformed and monstrous kyton. In time, she ended up becoming a remarkably mean devil herself, gaining pleasure in causing as well as receiving pain. She eventually amassed a cult of devilish followers and even sent some expeditions back in the mortal realms to bring back new corpses and souls. A group of paladin came down to her realm to stop her after one too many expedition and although they eliminated a good bunch of her followers, she eventually defeated them all. Before consuming their soul, she forced herself on the leader of the paladins\u0027 team, which resulted 9 months later in a kyton-spawn tiefling. She loved her son so much and it broke one of her hearts when he fled to the mortal realms at age 13. She has been searching for him ever since, sending devil spies behind him in the world of men. She will stop at nothing to bring him back in order to give him the punishment that he deserve, no matter how many souls she has to destroy in her path."},{"name":"Ghelia, the tormented","description":" Ghelia can take many form in our world and every single of them cause mishief. She walks the land in search of lives to ruin. Either by destroying crops, reputation, marriages, companies, guilds or kingdoms, she strives to destroy everyone\u0027s joy in life and reason to live. She has been doing it for so long that she doesn\u0027t even remember why and she doesn\u0027t even take pleasure from doing it anymore. She simply does it because it\u0027s what she has always done. She hasn\u0027t been back in Hell for so long that she doesn\u0027t even remember what her true form looks like."},{"name":"Bashkatet, also known as Hilderoy the cruel","description":" Hilderoy is the name of his human form. A bearded man with an eyepatch and a wooden leg, Hilderoy leads an armada of pirates that show no mercy and enjoy throwing people down at the \"sharks\". But Hilderoy is not human. His true form ressemble a enormous lamprey with twelve pairs of fins, that can stick his mouth to the bottom of a ship and wreck it from below. An army of smaller similar demons follow his ships along and wait patiently for the corpses of their master\u0027s fallen ennemies to be thrown from the side of the boat. If you see Hilderoy\u0027s flag approaching, abandoning your ship and jumping into the water is probably the worst thing you can do, for a quick death by sword is preferable to being eaten alive."},{"name":"He Who Walks Behind","description":" A fiend so foul and devious it managed to shed its true name so as to never be a slave again. Instead, this devil serves as a patron to several powerful houses across the multiverse taking a single first born warlock when they come of an age of use. Then it sends the father on a suicide mission to help further its plans and rid itself of a loose end. Trailing behind, whispering, demanding, empowering, forcing a hand to some knowable goal HWWB is a master manipulator. This being is so potent it can even infest anything around its slave with a portion of its essence ensuring that it can never be totally destroyed."},{"name":"Tychnazreht, of the Warp","description":" This entity is so profane it warps reality around it and even those who look upon it. Longing to reach the prime material and forge a dominion of its own, it throws a net far and wide so as to grab the attention of any sensitive enough to the demon\u0027s call. Hence, most worlds hold a cult or other group dedicated to bringing their master through."},{"name":"Melika, the Mistress of Torment","description":" Melika, often called the Mistress of Torment, has been hard at work harvesting souls hoping to purchase a place in the infernal high court. She takes delight in tempting souls to gluttony and over-indulgence just so she can take things away when it suits her. She enjoys screaming and beautiful music, particularly tragic songs of death and sadness. Her sadism is only outstripped by her ambition, and the safest course of action with Melika is to avoid her schemes altogether."},{"name":"Zelyria, the Flame Maiden","description":" Zelyria the Flame Maiden is a demonic being with a strong connection to Elemental Fire. She is fond of dragons and burnt bones. She just wants to watch the world burn, espousing the power and might that only destructive fire can unleash. If she has any plans or desires beyond the destruction of all creation, they are beyond my capacity to comprehend."},{"name":"Kalex, the Eater of Heroes","description":" Kalex is a potent shadow demon who styles himself as the Eater of Heroes. He loves bringing mighty warriors low by digging up their darkest secrets and using those secrets to exploit them to meet his own needs. He takes great interest in magical mysteries and odd lore. His schemes are complex, spanning continents and centuries. Some scholars believe he has had a hand in the fall of more than one of the great empires of the past."},{"name":"Gujerikk, Lord of the Blood Pits","description":" One of the most prolific soul collectors in the Hells, Gujerikk is an enormous being with skin of scorched crimson and curved black horns. He rules over a small domain known as the Blood Pits where he personally torments many of the souls he collects. Scholars attribute the Tragedy of King Berend to madness, but many superstitious Northerners believe that Gujerikk\u0027s scheming had a part in the horrific tale. Many of these claimants have been haunted by dreams of their loved ones suffering in a place that matches the only known description of the Blood Pits."},{"name":"Gobbluth, The Tricky Devil","description":" Gobbluth is a tall, handsome fiend, with a winning smile and neatly kept dark hair. He\u0027s not physically impressive, but he carries himself with confidence, and he thinks you should be impressed by his every word and every illusion he creates. Relying on his wicked good looks and his talent for illusions, Gobbluth\u0027s steadily seducing his way up the hierarchy in the Hells, and has made it as far as being a minor attendant in infernal high court. Perhaps, \"minor attendant\" is a stretch—he\u0027s a squatter. He snuck into the court and spends most of his time hidden in a large cupboard in the kitchens, slipping out to work his tricks on the low-ranking, female-identifying members of the court."},{"name":"Ohnalt","description":" Bubbling up from pits of black shadow and malcontent, the Ohnalt likens himself as a Dark God. As a manipulator of men, Ohnalt binds himself to the feeble-minded, such as children and elderly, and sets them upon their loved ones. Should Ohnalt be extricated from his victims he retreats to his lair, Abraxas, leaving a convenient portal in his wake. Should those heroes be foolish enough to follow, he toys with their delusions of adventure, presenting them challenges and traps and treasure, in some twisted game only he could dream."},{"name":"Dorkhulhu, Goat-Merchant","description":" Dorkhulhu has committed the greatest deception of all, appearing simply as some pagan god of trade to gypsy followers and bohemian merchants. He\u0027s become a popular entity to some, as tributes to him are made by trading and selling magical artifacts with adventurers. Gold that ends up in his followers possession causes his power to swell, and his favorite treasures all hold some deep connection to his realm. He schemes to draw the holders of his artifacts to the realm of Abracadabra, where he hopes to pit them against each other in a battle royale for amusement and coin."},{"name":"Praelix, Fiend of Battle","description":" All Devils have their own specialities and favourite targets for temptation, and for Praelix it is the battlefield that most readily draws him to the mortal plane. Unusually among the scholarly Phistophilus, Praelix loves to engage in discussions of strategy and tactics and will even don his custom leather armor (though best not to ask WHAT leather) and ride out on occasion. Some Diabolists consider Praelix\u0027s preference for claiming the souls of warriors to be a sign of intellectual weakness, a misapprehension Praelix himself readily encourages. Jovial and helpful, he affects the manners of a country gent - he even has a drawing room with weapons mounted on the wall. Each one is bloody and broken, and each is wrapped in a contract."},{"name":"Naim\u0027haera, Hateful Spearmaiden","description":" A fixture of goliath myth and superstition, Naim\u0027haera is the Diabolical Dame of Dishonor, and a brutally effective witch-devil. She often appears to weaker, less capable goliath, offering them power and prowess at a price. Her fee is always the same: the death of one\u0027s own family."},{"name":"Mordryn Wintersgrasp","description":" A demon, posing as a line of kings, each male descendant remarkably similar to the last. The secret to this demon\u0027s ability to maintain a stable kingdom for so long is his taste in chaos; rather than give in to gibbering madness and lose his playtoys in a month or two, King Wintersgrasp uses his influence to destabilize the entire political climate for miles around, always coming out thick as thieves with the winning side."},{"name":"The White Whispers","description":" Less of a single demon than a wholesale legion of them, the White Whispers are the single greatest danger to travelers in a particular area of high desert. Each demon is bound to the shape of a single snowflake, but when whipped up by winds or stirred up by the passing of an unwitting traveler, they form a maelstrom miles wide, full of the howling and horror of Pandemonium itself. With the right wind, they could create a swathe of frozen death and atrocity across entire continents."},{"name":"Hallyx, the Viceborne Star","description":" A devil of vast power of influence, made more terrible by the fact that nobody knows his or her true identity or location. The name \"Hallyx\" might simply be a title appropriated by one or many devils, or an actual name of an unknown being. All that can be known for sure is this: if you dig deep enough into the true roots of corruption and vice in this world, you will find your way back to one name."},{"name":"Grena Akssah","description":" The primal fear of the dark and things that go bump in the night can be traced back in history to Grena\u0027s more whimsical days. Grena is an Oni who stays out of the spotlight. He is the puppetmaster of the world. Pulling strings in courts, kingdoms and towns with no telling where his influence ends. Using his natural ability to shapeshift he gains access to the most powerful people in the land and gains their trust. The reason for his longevity is unknown though it is most likely due to the large sum of knowledge acquired over his time spent collecting artifacts and among the educated. The one thing he cannot hide with his shapeshifting is the eye of vecna that he has replaced one of his eyes with. Most if not all of his shapeshifted forms wears an eyepatch or similar way of masking it and they all tend to hum. Very few if any people can actually guess at his existence in the world however every child is taught the Oni\u0027s Rhyme: Lock the door, blow out the light; The hungry oni haunts the night. Hide and tremble, little one; The oni wants to have some fun."},{"name":"Miasmus, The Creeping Hunger","description":" Appearing often as an attractive tiefling wreathed in a cloud of grasping purple fumes, Miasmus breaks the mold of most demons. Not content with other demons\u0027 blind madness, the Creeping Hunger is driven and focused by his demonic desires. He plans and schemes like the best of devils, but ever the rage and hunger lingers beneath, cresting to the surface when things don\u0027t go his way. Of particular interest to him is answering the call of warlocks seeking a pact with devils. When he presents himself as such, he provides maddeningly complex contracts and asks for little in return for access to his power, masquerading as the lawful entities the warlock has planned for. However, he devotes himself to twisting the warlock\u0027s goals to base consumption and destruction, culminating in the eventual ruin of the warlock and the acquisition of many souls for Miasmus."},{"name":"Malerus, the Man-Eater","description":" A massive centaur, covered head to hoof in thorned plate armor. A bloodthirsty warlord, but also a superstitious being, he believes that devouring the hearts of his enemies will imbue him with their strength. Hunger never sated, he and his barbaric tribe roam the land as a nomadic scourge that crushes opposition under hoof and hammer."},{"name":"Nurilla, the Stone-Mother","description":" A first glance at Nurilla would give off her vaguely humanoid form, however, a closer inspection would betray her shimmering snake-like lower body. Don\u0027t look too closely though, her beautiful face is framed by a writhing mass of snapping snakes and an off-glance in her direction could be enough to turn you to stone. A freak of nature, her nest lays in the center of a garden of petrified victims. She lives in constant pain, laying clutches upon clutches of sickly, fragile eggs, which spawn chittering collections of colossal cockatrice. The nearby river is tainted with her infectious influence, and the local settlements are constantly under siege by her oversized offspring."},{"name":"The Beast of Brightmill","description":" A seaside town, Brightmill\u0027s economy is heavily weighted in their fish market. However, a huge increase in missing persons cases have befallen the town as of late, and their economy has fallen into a depression as a result. A gargantuan Merrow, referred to as \"The Beast of Brightmill\" has been spotted on several occasions, lunging from the water\u0027s edge, and pulling people into the cloudy water. A well-fed creature, at nearly 15 feet long, many fisherman have lost their lives, trying foolishly to predict the Beast. The houses nearest the ocean have been abandoned, as huge claw marks line their doors and windows, and body parts won\u0027t stop washing up on the beach. Boats that are left near the docks are frequently missing, presumed to be either sunken or dragged off to sea by the creature. \"The Beast\" emanates an overwhelming aura of malicious intent, and some citizens see it as a punishment sent by the gods for the town\u0027s prosperity."},{"name":"Thom, Fiend-Lord of the Ordinary","description":" Wherever Thom appears, magic disappears. His fiendish nature sucks out the magic out of reality itself. Every spell with a duration just flickers and fades once he nears. Magical fires dim, animated golems break down, and enchanted swords become, well, just swords. Thom hates all that is out of his daily routine, which mainly consists of an ordinary peasant\u0027s routine, with no magic involved and he\u0027ll go to incredible lengths to make sure no one breaks his routine. Wizards, Warlocks and sorcerers beware."},{"name":"Nycrosh, Duke of the Dead","description":" Nycrosh is a small-time God of Death, who lures the souls from dying villagers into his own pocket dimension. His dimension is small, and only attracts the souls of specific areas, but he aspires to be a great god of death. Sitting rotting and decaying in his throne of bones, Nycrosh tries to make his afterlife the only afterlife."},{"name":"The Unseen and The Unheard","description":" Two fiendish brothers that respective dominion over the sense of sight and the sense of hearing. The Unseen can completely escape the eye, as if he was invisible, sneaking through busy streets unseen. The Unheard eludes the hearing, slithering through creeky mansions unheard. They\u0027re assassins for hire, but ask for more than just gold to complete their job."},{"name":"The Sword of Rhaggash","description":" Like many legendary swords, especially those stuck in rocks, the Sword of Rhaggash promises the wielder to be king. However, once someone removes it from it\u0027s stone seal, the sword\u0027s dark tendrils overtake the wielder and take it over as a host. Rhaggash, king of a kingdom long forgotten, takes over, and will stop at nothing before it reclaims it\u0027s long lost kingdom."},{"name":"U\u0027rg, A\u0027rg and I\u0027rg, The Endless Debaters","description":" U\u0027rg, A\u0027rg and I\u0027rg are the three fiends with severly clashing personalities, inhabiting a demonic host.. U\u0027rg is the enslaver, and dreams of enslaving entire realms to supply him with luxuries. In battle, he tends to charge the strongest of his foes first. A\u0027rg is the murderer, and dreams of a realm with bleak burned trees covered in innocent blood. In battle he goes after the weakest opponenst first. I\u0027rg is the peacekeeper, and would love for everyone to just get along, and not fight for once. In battle, he\u0027s defensive, and tries to come to diplomatic compromise. Only one of them can be in control at the time, and they randomly take over from each other. If you listen very closely, you can hear the three argueing eternally in their collective head."},{"name":"Losum, False Hope","description":" Losum is a powerful contract devil that approaches people in the most desperate of situations and offer them a way out in exchange for their soul. He works hard to make his quarry extremely happy and accomplished. When they\u0027ve reached a peak in their happiness he rips it all away and delights in their pain and grief."},{"name":"Silas, the Vengeful","description":" Silas is a devil that lives of pacts. He finds people who seek vengeance and helps them get it. He provides his contractees with a weapon that must be used to slay the targets so that he can claim their souls."},{"name":"Kraxan, Lord of Undoing","description":" Kraxan was once the most powerful demon until the Order of the Iron Scales locked him into a book. Every page in the hefty book is a binding to keep him in place. That doesn\u0027t stop him from communicating with people who come near him. He\u0027s waiting for the day he can convince a fool to help free him."},{"name":"Baroup, the Eternal Torturer","description":" A being powerful enough to challenge Gods over dominance of the souls of the deceased, Baroup feeds with the pain and anguish he inflicts on the souls he snatches before passing on to the afterlife. His pocket demiplane, The Prison, is a locked place of eternal torture, and anyone entering would be hard pressed to get out."},{"name":"Und\u0027Aliber, the Shadow in the Light","description":" Und\u0027Aliber is a being of pure darkness encased in a shell of light. Shining like a (fake) beacon of hope, it takes on the form of whatever its interlocutor desires the most. Und\u0027Aliber takes extreme delight in tricking followers of the Path of Light into taking evil actions, while still appealing to their sense of \"justice\" or \"honour\"."},{"name":"Balladar, the Infernal Seneschal","description":" Diabolic Patron of courtly manners and intrigue, Balladar has agents in the most powerful kingdoms in the world, manipulating events behind the scenes. Not for any eventual goal, but for the simple joy of causing drama in the courts of kings. Backstabbing, secret deals, and lies are his domain, and whenever they are committed in the name of his worshipers, he gains power, no matter the goal."},{"name":"Solzerik, the Whispering Shade","description":" Solzerik is a petty demon, not powerful enough to be of any importance in the Abyss. He instead turns to petty murder, terrorizing villages and small towns. His true joy, however, is what comes after. Using illusions and other magic, Solzerik turns the townspeople against each other, eventually inciting riots and anarchy."},{"name":"The three breakers of the great demon halls of the Grir\u0027lith mountains","description":" The breakers are three powerful demons who are the torture masters of the great demon halls. they are known far and wide for their malice and their horrible techniques"},{"name":"Barluq Breaker of Body","description":" One of the three breakers of the great demon halls of the Grir\u0027lith mountains, Barluq is called the body breaker because he enjoys not only defeating his opponents in battle, but utterly destroying them, he wields a massive greatclub with which the bodies of his victims crumble a sunder"},{"name":"Garlrup Breaker of Spirit","description":" The second Breaker of the great demon halls of the Grir\u0027lith mountains. as the second Breaker, Garlrups task is to break the spirit of his foes. he fights them, then raises them from the dead, then he fights them again, carefully making sure not to completely obliterate the bodies of his victims, the victims come back with weaker and weaker bodies. but the fight does not stop untill the victim has lost all hope and surrenders itself to the third breaker"},{"name":"Lady Grith Breaker of Mind","description":" The third and final of the breakers, Lady Grith tears the victims mind to shreds, she uses her powerful illusion magic to create horrible scenarios in which her victims are forced to abandon all of their principles of not only moral code, but logic and reason as well. the victims will make choices so difficult and twisted that in the end, their mind will be forever broken by the powerful influence of shadow magic, infesting and corrupting their mind as they work their way through her maze of horror."},{"name":"Grazzab, the Lightdrinker","description":" Grazzab is a Shadow Demon who detests all light as an unnatural corruption of the chaotic void in the depths of the Abyss. Grazzab traveled the Planes, hoping to snuff out all sources of Light, and made periodic trips to the Shadowfell to try and heighten its influence over the Prime worlds. Unfortunately for him, he was snared by an ambitious wizard who imprisoned him in an idol on a Prime World, but Grazzab had the last laugh when his counterstroke ripped the wizard\u0027s soul from his body and became an energy source that Grazzab uses to spread magical darkness that literally steals, or \"drinks\" the light from the surrounding area. The wizard\u0027s tower is now Grazzab\u0027s lair, and though he is imprisoned in the idol, his influence over the local area is significant, and he can manifest himself within the total darkness of the tower\u0027s confines. Unwary treasure hunters looking to steal the wizard\u0027s old loot find their sanity wrenched away if they\u0027re lucky; if they\u0027re unlucky, they join Grazzab\u0027s retinue as Shadows that help guard the idol housing the demon\u0027s essence."},{"name":"Chamdar, the Soul Binder","description":" Chamdar is a Chain Devil who delights in tempting mortals into dark pacts and contracts, and then using said mortals for sadistic experiments into the nature of suffering and torment once the terms of the deal are up. Chamdar first began to exert influence over the Prime when a sorcerer in a war-torn country sought to keep his family safe from the fighting--in exchange for helping construct an arcane sanctuary, Chamdar wrenched away the sorcerer\u0027s soul and tormented his family mercilessly in the sanctuary, often using the sorcerer himself to inflict the torments. Every night, the sorcerer had his sanity ripped away and he murdered his family in cold blood, only to later be confronted with what he had done. However, due to the nature of the contract, each day his family is restored to life, their memories fully intact, but the sorcerer\u0027s recollections were wiped away. Chamdar delights in watching just how torturous the family relations have become."},{"name":"Bizuloth, the Betrayer","description":" Bizuloth, a powerful Archdevil, was imprisoned by Asmodeus for breaking an oath of service he made aeons ago. His once sharp wit and cunning intellect has decayed across millennia into a twisted mind bent upon the destruction of Asmodeus and all who have wronged him. Bizuloth\u0027s few remaining lesser devils seek those who could free their master and seek to make a deal for his release. Bizuloth, however, cannot be trusted, as he has lost his honor and any deals he makes are meant to be broken."},{"name":"Steve, The Gruesome Trickster","description":" As easy as it would be to kill anyone in his way on the path to his goal, Steve would much rather hire you to achieve his goal for him, then stab you in the back at the last possible moment. An expert shapeshifter and impersonator, Steve has walked many paths on the Material plane. The lives of the adventurers he has mislead have always been met with abrupt and unfair ends. Steve appreciates a good joke, and he has a ghastly smile to prove it. His name in itself is a ruse, as he guards his true calling as a secret known only to himself. His natural form stands 8 feet tall with smokey grey, spindly arms brandishing foot-long fingers with curled claws at the ends. http://i.imgur.com/Gt4G1WH.png"},{"name":"idea","description":" Allison, the Vengeful (Gnoll) Once praised as a hero for quelling the Laughing Ones, her tribe settled near a human kingdom. The humans and the gnolls did not get along; her tribe did not survive. Once herald as an embodiment of peace between the races, now feared as her bloodcurdling laughter echoes in the night, her fur forever stained red.   Nobb O. Dee (Doppleganger) Some say the scariest assassins are the ones who can strike anybody down without being seen, Nobb disagrees. Others say the scariest assassins are the ones who can over power the defenses, Nobb disagrees. Nobb says the scariest assassins are the ones that kill without anyone thinking it was an assassination. The best assassins are not known at all...   Aurora, the Spider (Aranea, Drow, or Dryder)"},{"name":"The Fuckbird","description":" Flayed, fallen and charred, feathers half-melted onto its flesh, filthy and flaking off as it becomes covered in calluses and skin tags. Its has teeth, which no bird should have. Eyes like an unseeing milky constellation across its face, neck, and chest. Extremely knowledgeable about emotions, psychology, and neurology; is able to make a person loved by all by physically extracting ambient bad feelings about them and placing those bad feelings into itself. Kind of an asshole about this talent, demands to be held on high in exchange for its services since it cannot and could not ever fly. Insists that it is The Fuckbird, not merely a Fuckbird."},{"name":"That Old Time Religion","description":" Pontifex regaled in stories as a gentle guide and storyteller, always offering sympathies and applicable parables to whatever troubles burden a listener. Has never once led a wanderer astray. Instead asks if they would be able to place a nickname upon their companion, a name between friends, a personal signifier that the pontifex can remember in their growing age—there are so many similar names in the world, after all. They have been doing this for some time now, and have only ten names they need to shed that remain. Despite the title, this being is not solely a withered pontifex, but can also appear as such: the pontifex regaled in milky robes and holding a candelabra, the goat-priest adorned in woad and untanned skins; the pilgrim full of pestilence and sunburned flesh; the lamplighter prophet with flame behind their teeth."},{"name":"Toad-Killer Tracker","description":" Valet and majordomo to The Devil Himself, The Betrayer, The Tempter, The Opposition to God. Maintains an underhanded series of contracts with every devil in existence to funnel every single sinning soul towards Hell; this is not to torment them, but to relieve the strain on all the heavens from containing so many virtuous souls. Hell is spacious enough, and the souls are kept sleeping until they may be sent to their just rewards. May or may not be an actual toad, or every toad in existence that has ever been. Was recently pinned to a tree and is impatient for the nail to rust away so it may continue organizing the dead."},{"name":"Aspects of the Blood Crystal","description":" Shardmind come from the outcroppings of huge astral psionic crystals. This, the Blood Crystal, was tainted by Fel influence. The whispers of devils, demons and dark gods warped the psionic crystal entity and formed the Blood Crystal. Blood Red Shardminds do its bidding, connected to a mental network. It\u0027s not uncommon to see one of these curious Bloody Shardmind in an orcish meeting of clans, warping the minds of lesser beasts to their bidding. They manipulate, work from the shadows. Their agenda would be incomprehensible to lesser mortals."},{"name":"The Lady Shiver","description":" Dragons Hoard. This white dragon hoards not gold or gems, but real estate. She owns large swathes of lands... and while she takes humanoid form, a pale white lady with beautiful shimmering scale dresses, the serfs and peasants of her lands speak rumours. They see the dragon in her eyes. Those that do not pay their fealty and taxes go mysteriously missing. Curiously at the same time the Lady speaks of the great feast she just had. Her keep has a kitchen built for cooking humans. Giving the Lady the most taboo, sinful and exquisite taste she could imagine. While she seems entirely evil she does protect those that obey her word. Her dragon knights are treated with castles and keeps, and no other evil dares invade her lands."},{"name":"Vagrunad, the Warchief of Warchiefs","description":" Making Orcs behave is hard. Often bands work together. Shamans bow to those that create and weave powerful magics. Feral orcs kneel to the one with the biggest sticks. Vagrunad is beyond all of them. Born with slightly more sense than most orcs, Vagrunad realized that there is no sense in leading the common rabble, the warboys and beserkers. No. Vagrunad started leading the other chiefs, the warlords of the orcs. He started a campaign, beating warchiefs into submission with the raw power of his muscles. Within four years now all of the orcish clans are under his hand. Entire orc clans and warbands are used as a human warrior would use individual bands of soldiers. And now that the orcs are under his control Vagrunad looks to the rest of the world, to conquer."},{"name":"Cyrix the Immortal","description":" First of the Aboleths, spawn of their eternal memory, father of their hatred and mother of their contempt. Cyrix has existed for longer than we can conprehend, he witnessed the birth of our, so called, gods and the deaths of some of the same. He festers in the deepest pit of the most ancient aboleth city, his hatred and contempt for all other beings flowing from him like a miasma. He considers all others to be below him and even his spawn as dissapointments. His contempt the only thing that kept him from unleashing his devestating will upon the world, but now as the gods grow weak from their squabbles and the mortal creatures delve deeper into his domain, he moves... and the world shudders before his coming."},{"name":"Ssaris, the Viper","description":" Although some whispers speak the name Ssaris, most everyone only knows the name the Viper. The Viper is the demon that strikes from the shadows. He\u0027s an assassin known to only the wealthiest of patrons, but with his body count people can\u0027t help but wonder if paid work is just a hobby. No one knows what the Viper looks like, or even if he has a physical body, even those wealthy enough to buy his services. All of his clients can only remember the overwhelming sense of fear they experienced when giving him a contract because of the all too real possibility he could turn them down, or just decide they were an easier target. Everyone knows that if you choose to wander into the shadows, you may not come back."},{"name":"Anarak Icewind","description":" A human wizard/sorcerer who was infused with magic after an encounter with an ice devil in his childhood. The ice devil subconciouly whispers to him and incites his hatred for and anger at others. Because of the devil\u0027s whispers, he considers sorcerer\u0027s magic more pure than wizard magic (\"it comes from the soul\" etc...) and was greatly angered by most wizarding schools for his inability to produce or use any sorcerer spells that did not involve ice or water, and has withdrawn to a keep made of ice to attempt to learn how to produce any non-ice related magic. He is very bitter and hateful of the wizarding community and is very hostile to any other sorcerers\u0027 use of non-ice magic. (When he left one of the schools, he stole a wish scroll from one of the teachers and used it to imbue himself with the natural ability to detect magic. As a sad sort of irony; due to his inexperience with any non-ice magic, the effect the wish spell granted him was the ability to detect ice-related magic only, which only makes it easier for him to become angry at the use of non-ice magic.) All of his sorcerer spells must be ice themed/related: Ex. Magic missile shoots ice bolts, he cannot cast fireball with sorcerer slots, Floating disc and Mage armor are made out of ice, burning hands deals frost/cold damage, etc. He much prefers using his sorcerer spells than his wizard spells as he considers them \u0027unpure\u0027, but he considers himself worthy to use them over others because he has innate magical ability as well."},{"name":"Artrinek ColdBlood","description":" The aforementioned ice devil that rules a small domain in the Abyss. Among his other endeavors, he is attempting to prepare Anarak as a blood sacrifice to further increase his own powers and challenge his rival neighbors in the abyss. He is partial to ice magic and his ambition includes the eventual freezing of hell (the Abyss)."},{"name":"Ngoro\u0027th, the bloodthirsty","description":" A demonic existence, which nowadays needs a host to survive. The host, usually some powerful humanoid fighter, might not even be aware of the demon possessing them, as he usually just subtly, slowly influences his hosts towards achieving his goals (and also towards the things Ngoro\u0027th enjoy, which is things like gambling and fighting, or rather killing people). However, when it suits him, he can take over control of his host, and exhibit great martial strength as well as minor magic tricks. His ultimate goal is to recover his own body, which is held by a demon prince in one of the Hells, but in the meantime he\u0027s quite happy with just starting trouble anywhere he goes."},{"name":"Rithari the Hidden","description":" Rithari dwells in plain sight within the homes of the wealthy and the palaces of kings. He whispers to those who gaze upon him and fill their minds with greed. He delights in watching the downfall that is brought about when one hungers only for gold. Rithari hides in paintings. He is the strange figure staring out from the background, he is in the eyes of the portrait hanging over your bed, he is the birds in the sky of the landscape greeting your visitors at the front door. But Rithari only reveals himself when you have failed. When your last copper has slipped between your fingers and your family has left you alone, that is when Rithari steps out from those brushstrokes and devours your misery and your pain and your soul."},{"name":"Ugarhutt the Vile","description":" Not every demon dances in the moonlight or skulks under your bed, some dwell in the very place you would never wish to visit. Ugarhutt the Vile gorges on your waste. Sewers and cesspits are like gardens to Ugarhutt but he hates to till the soil alone. Anyone who comes too near will be enslaved and forced to shovel the rot and refuse into Ugarhutts maw until they can feed him no longer and are devored themselves."},{"name":"Lorael, the Broken Judge","description":" Lorael, not originally a demon, but rather a mortal so enthralled in his own desires that he eventually became such a creature, started life as a paladin of all things. Through his journeys, he tried to make the world a better place, to stop the suffering of others. However, as his journeys continued, he saw over and over again that much of the intelligent races\u0027 suffering came not from some horrifying creatures from another plane, but rather the intelligent creatures themselves. The more he saw this, the more shaken he became in his faith, until he cast it off entirely, believing with all his heart that the only way to end suffering was to end all life. Realizing he didn\u0027t have the power to do it on his own, he began making deals with other being, terrifyingly powerful beings, to help him gain the power to continue on his righteous quest. Eventually he grew more powerful than even the entities who granted him this power, and so he turned against them, breaking his word and slaying them all. Now, he turns to the world, the intelligent races, and his quest to end all suffering."},{"name":"The Blackest Tide","description":" The Blackest Tide is a creature that defies explanation. Something that has lived in the bowels of the oceans for as long as their has been history. She, if it has a gender, is said to be the mother of all the terrors in the water, the creator of sirens, krakens, even the aboleths. In fact, it is said that she created the Aboleths in her own image. She was locked at the ocean\u0027s floor by the elven god Deep Shashelus (I think that\u0027s how you spell it), and run through by a great fish hook, chaining her to the bottom of the deepest ocean, where she has sat, and waited, and birthed more monstrosities, waiting for someone foolish enough to free her."},{"name":"Pemiri","description":" An imp. More than anything, he despises chaos and demons, and so could be a valuable ally for a brief time. However, he will turn on the innate chaos in the PCs, and even a lawful party will not be spared. Uses magic to disguise himself."},{"name":"Sarangesset","description":" At earlier levels, as he is still gaining power, he would perhaps be a serial killer that turns his victims into animals first, viewing it less immoral. At higher levels, he has changed his ways. He is an animal lover, but a hater of humanity, believing that humans are merely twisted, immoral mockeries of the animal world. Eats humans, but is otherwise a vegetarian. Seeks to use turn all humans into animals using a dread ritual from an ancient warrior race. If he succeeds, he will make himself and a few others who have curried his favor into predators, and all other humans will be prey animals like deer, sheep, mice, etc. to be \"cleansed\" by animals and new-made predators like himself."},{"name":"Norm Mayfield","description":" Norm Mayfield was not originally a villain. He is one of the common people, a philosopher and mathematical scholar, a man who has become annoyed by the adventurers callous and often inefficient uses of power. He seeks to force the adventurers to help him in less heroic ways. (ie a wizard will be taken captive and forced to research spells that improve irrigation and crop yields rather than simply fighting larger evils) He believes the power of adventurers, especially magicians, should be harnessed not is existential risk prevention, but in making the lives of enormous numbers of common folk just a little bit better. Especially seeks to enslave clerics to create a system of free socialized health care in the Kingdom. Works especially well in a world where less magic is common."},{"name":"Christoff Williamsson","description":" Male Bullywug Inquisitor A powerful member of the church of the Sun God, Christoff is an inquisitor, a hunter in the name of all that is good. His small stature and semi-comical appearance as a Bullywug disguise his ferocity and innate wrath, often to the detriment of those who have betrayed the Church. He has a penchant for liquor made/garnished with lemon, as well as fish. Any commoner on the street can point out the warm affectionate glow that seems to emanate from behind his form, and are touched by it in a spiritual way they can scarcely describe. Enter Christoff\u0027s ultimate betrayal and greatest deception; there is no Christoff. The Bullywug died as a tadpole decades ago, and this Rakshasha has assumed his identity in his plan for world domination. He never truly slays evil creatures, but banishes them to a hellish demiplane of his own creation. Soon he will unleash this army of pure evil on the world, once he can move all the pieces into place, especially once he can trick those pesky PCs into giving him the evil artifact they\u0027re trying to destroy."},{"name":"Mal\u0027kozov, the Instigator","description":" Within every generation there are always those among the civilized races who wish to usher in the fiery apocalypse ahead of schedule. When such aspirations turn to deeds, and portals are created or fiends are summoned, there are inevitably whispers of a shadowy instigator. \"the Instigator,\" as it has been named, seems to act as a catalyst: infecting, goading, and feeding on the desires of these malcontents until their dark dreams and anger bubble over into reality. There are no records of the true name, appearance, or origin of this fiend, but such scholars as have studied it mostly agree on it being a harbinger of some sort. The truth is that Mal\u0027kozov has lost their first purpose, and now delights only in stoking the fire, uncaring of the outcome of the events they set in motion."},{"name":"Garillosh","description":" One of the Lesser Lords of the Nine Hells, Garillosh is a fearsome beast: an eight limbed gorilla of massive proportions, with hair of the deepest crimson. It has gained many names over the eons, but none so apt as \"the Devourer,\" as at the end of every conflict it scours the battlefield, consuming the flesh, bone, and gristle from its fallen enemies."},{"name":"Al","description":" With his entire race enslaved by shadow demons since he was young, the deep gnome Al had right to be jealous of the overworlders. After possession by a powerful \"sympathetic\" shadow demon, Tenebakalo, his new powers allow him to finally bring an end to the surface dwellers."},{"name":"Tenebakalo","description":" Possessing a weak deep gnome, the powerful shadow demon feigns sympathy with his cause to use him as a conduit for his powers, and allowing him to take reign of those on the surface. His ambitions will be his undoing."},{"name":"Euryndas","description":" This guy is one of the sneakiest pieces of scum to ever hit the streets. But, the thing is, the guy didn\u0027t just win the streets, he\u0027s the puppet master that controls the king too. With a hand in the empire, he makes sure that his little gang can do whatever they want making him the wealthiest person in the city."},{"name":"That Damn Magpie","description":" It\u0027s a regular magpie with uncanny knack for pinching shiny items and avoiding arrows, bolts and stones. It\u0027s universally hated by everyone in town and many young men have tried to find it\u0027s nest, either to try and get back their stolen items or in hope of getting their hands on it\u0027s hoard. So far it managed to outsmart it\u0027s pursuers."},{"name":"The Shambles","description":" A group of downtrodden people have had their minds linked by some spell, these people function with a hive mind. The collective intelligence is enough to predict the future accurately, these groups may start with positive motives, but often devolve into evil schemes."},{"name":"The pink rose assassins","description":" The members of this group are difficult to distinguish. The members dress as local knights often very convincingly. They will lead their targets to out of reach places, killing them with the weapons of knights. The nature of their façade often leads to questions weather they are just an excuse for murders done by knights. Many insist this group is very real, as they kill commoners and nobles alike."},{"name":"The brown rag assassins","description":" Dressing as poor farmers and peasants, they only take jobs to kill many. Unlike most assassins they travel in groups just as peasants often do. They will kill off everyone in the building, they are usually hired to send a message rather than to remove an individual."},{"name":"The noble politician dossier","description":" A wide spanning group of organised nobles usually of low standing. They affect political decisions en mass and are not above dirty tactics to get what they want. Occasionally they get one of their own to the top at which point the group tends to take commands from them. When a leader from their collective begins to do things for themselves the group tends to turn on them, often leading to assassination."},{"name":"The God Hunters","description":" They do not kill people, but attempt to kill ideas. They have their own god and try to remove faith from others. Their methods vary but they do whatever they can to test the faith of others. Their methods include destroying religious artifacts, burning down places of worship, and openly denouncing other gods."},{"name":"The Roving Bear Man","description":" A strange man, with an odd fascination for bears, from brown bear cubs to owlbears. He is very unsociable but will behave mostly normal when human. When he takes the form of a bear he tends to steal all he can from small villages and takes them back to his small hut in the woods."},{"name":"Raakar Longhouse","description":" An advisor to the king, only appointed recently. Raakar has a fascination with voodoo, this is not a hidden fact. His appearance is somewhat warped from his practice of voodoo. Many says he pulls the strings of the king, however the king is protective of him. As such many cannot question this."},{"name":"Poynt Araderano","description":" An exceptionally stealthy assassin. Unlike most Poynt is not motivated by money, instead only desires a spectacle. He enjoys killing in front of a crowd using his signature needles, carefully piercing vital bloodlines and muscles."},{"name":"Shelly Baker","description":" Corrupt, the one word to describe Shelly. While maintaining a near flawless public appearance despite the rumours, she pulls strings behind closed doors. Industrial espionage, assassination and sabotage. Nothing is too low, or immoral to keep her business right at the top. This is of course at the expense of the locals who are forced to pay her extortionate rates."},{"name":"The Red Woman","description":" A succubus would be considered evil on its own merit by some. The Red Woman is one of the oldest living of her species. Many say she has played a part in every major war in the last thousand years. Coercing kings and raising tensions. She did this because in times of war men are not picky of who spends the night with them, and her sisters have benefit from this greatly."},{"name":"Archmagister Yura","description":" The leader of a hidden colony of an ancient, forgotten race. The Archmagister and his council are incensed when they learn of interlopers within the lands they consider their own. But it is not enough to drive off the settlers, for they want to retain their secret existence. If they force the settlers out, stories of them may be spread. If they kill them all, perhaps others will come looking. No, obviously the only solution is to wipe out everyone on the settler\u0027s own continent. To this end Archmagister Yura leads his people in the completion of the greatest and most terrible ritual ever performed: the Ritual of Undoing."},{"name":"Callus Val","description":" A ghoul warlock promised to the demon prince of undead, Orcus. Callus was once the king-in-waiting of the now ruined city state of Valhazar, where he still dwells. He heads the mockery of an undead kingdom from within his own family\u0027s ancestral tomb, deep in the heart of the city\u0027s catacombs. Callus was not a brave man when he was alive, and feared assassination attempts from his ambitious younger brother. He made a deal with Orcus for power over death, though he was not careful about the terms of his pact. A demon horde appeared to claim the souls of everyone in Valhazar, and those that were killed in the attack - including Callus - rose up as undead. Callus may have hoped to be brought back as a Lich, but Orcus has a sense of humour. Callus has the horrifying hunger of a ghoul. Yet he retains the intellect he had while living and has used it over centuries to amass equivalent knowledge and power to a lich - he even has managed to create his own phylactery. Callus intends to carve out an empire. The more mobile of his undead servants are sent abroad, for few living people willingly come near Valhazar these days. These undead raiding parties take as many prisoners as they can back to Callus. Some sate his ghoulish hunger, while others are slain and risen again as the newest recruits in his unliving army."},{"name":"Jorus Val","description":" The younger brother of Callus Val, in life Jorus harboured ambitions for the throne of Valhazar and would gladly have assassinated his brother to claim it. His ambitions drove Callus to make the pact with Orcus that would bring ruin to Valhazar and it\u0027s people. Except for Jorus, who was acting as ambassador to a neighbouring nation and away from court at the time of the attack. Jorus\u0027 ambition did not abate. He seeks to reclaim and rebuild Valhazar, with himself on the throne. But since he can\u0027t do that until Callus and his horde are removed from the ruins, Jorus was forced to investigate how to extend his own life. He has since become a lich. He is attempting to amass a large enough mercenary force to make a foray into Valhazar and slay Callus and his lieutenants - killing the undead minions is not essential to his plan, indeed he would like as many of them to survive as is possible, so he can bind them to his own rule. and may therefore seek to contract powerful heroes. He hires them through a proxy, but if he is forced to meet any hero he presents himself as an archlich (a good-aligned lich), who seeks only to undo the evils of his brother."},{"name":"Ludik Russell Vansar","description":" A genius, blue-blooded human artificer and serial killer driven by only two desires: firstly, to create artificial, intelligent life. Secondly, a need to prove himself to an uncaring father. He is totally absorbed in his own problems and unfeeling; he sees other people as insignificant, and resources to be harvested. He suffers feverish nightmares that on the completion of his work, its first act will be to kill him. Yet these fatalistic dreams don\u0027t stop him - if anything, they seem to drive him on. More details available: https://www.reddit.com/r/DnDBehindTheScreen/comments/2xrrpm/its_terrible_tuesday/cp3yfha"},{"name":"Rupert Larrat","description":" A mortal man, Rupert Larrat is nevertheless one of the Succubus Queen Tulsami\u0027s more powerful lieutenants. He was corrupted by her and brought into her court centuries ago, and his soul nis now so twisted it is more like that of a fiend than a man. He has been promised Tulsami\u0027s wayward half-succubus daughter Raina, but is spurned by her. He is a swordsman no warrior should be keen to clash swords with: in his time he was one of the world\u0027s greatest duelists, and several hundred years full of practice and a great deal of practical experience have passed since then."},{"name":"Tulsami","description":" A powerful Succubus, and a rival of Malchanthet for the title of Queen of the Succubi. Both claim the name within their home plane: while Malcanthet and her faction dwell in the Abyss, Tulsami and her followers call the Nine Hells home. Their rivalry is legendary, but Tulsami\u0027s ambitions extend far beyond this rivalry, as well as the politics of her own plane. Her succubi and incubi work to corrupt the residents of the material plane in a long-term plan that ends with her taking a realm of her own, and giving the succubi race a purpose in existence other than the work of other fiendish lords."},{"name":"Lajixl","description":" Sahuagin wereshark priestess. She was afflicted with lycanthropy a few years back and has found a way to use it to her advantage. She is now in control of her tribe, and is working to manipulate (through terror and brute force) several other marine lifeforms (Koalinths, Merrow, \u0026 Kuo-Toa) into making massive attacks on local coastal cities."},{"name":"Fanderful Winkletoes","description":" Gnome vampire. Fanderful was once a local hero, being a part of Graken\u0027s Crew, who are known for slaying an ancient blue dragon who terrorized the region. He disappeared ten years ago, and has returned to the local capital and has started working his way up through the political ranks. Many talk about how his temperament has changed drastically since his return, and how many of his old friends now fear him. Many of his political competitors disappear."},{"name":"Shansa Fazel","description":" Human monk of Bane. At an early age, Shansa was forced into servitude to the Black Hand, a secret sect of monks who promote (enforce) Bane\u0027s worship. She is known for her exceptional cruelty in battle, and infamous for removing the eyes of those who refuse to convert to Bane, often while they are still alive."},{"name":"The Claw","description":" Elven rogue (assassin). None alive know his true name. He is the mysterious leader of the Ravens, the capital\u0027s thieves\u0027 guild. Very few encounter him directly, but his hand is in almost all the crime that happens in the city."},{"name":"Karl of the North","description":" Human barbarian king. Brutish barbarian king who united the six northern barbarian tribes five years ago after murdering all the previous clan chiefs. He is the epitome of a raging barbarian in battle, going berserk and killing dozens around him in one sweep of his great axe."},{"name":"Faladorel","description":" Ancient shadow (bronze) dragon. Faladorel was once a noble, wise dragon, known councelor to the Elven Courts. Unfortunately, as has the same weakness as the rest of the good dragons\u0027 kind, and was corrupted by the Shadowfell. Over time, he grew darker and more malicious, and eventually took fully to the shadows. He is now the most fierce enemy of all the elven kingdoms, and instead of aid, offers only death and destruction to his once-allies."},{"name":"A\u0027kin","description":" Mysterious owner of the local magic shop who always seems to know things he shouldn\u0027t or couldn\u0027t. Likes to give out magical baubles and trinkets to those who visit, but who knows what they do? Always polite and quick to ask about folks past, often using their names before he\u0027s given them. When asked about his past he\u0027ll reply \"I\u0027m merely a humble shopkeeper\""},{"name":"Spell-force","description":" This thing is a 2 foot across crystalline cube with a blueish glow. If hit with a spell, it duplicates that spell in another randomly chosen location within the room. This crystal automatically maintains concentration if needed. Spellforce can be directly damaged by non-magical attacks."},{"name":"Crash","description":" This thing is a 2 foot across crystalline cube with a orange glow. If hit with a melee attack, it deals that damage to everyone in the room (including the attacker). Crash can only be damaged from attacks which originate further than 15 feet of it."},{"name":"Solr","description":" This thing is a 2 foot across crystalline cube with a yellow-green glow. Solr has a faintly green-colored spherical field generated approximately 5 feet from it. If a projectile from a ranged attack comes closer than 5 feet of Solr, it is caught in Solr\u0027s field. Any creature who crosses Solr\u0027s field must succeed a dexterity saving throw or be hit by (some?) projectiles in it\u0027s field. Solr can only be damaged by Blunt or Force damage."},{"name":"Niklas Edge (Ed)","description":" A cursed chef\u0027s knife that possesses it\u0027s owner. Ed just wants to live his life in peace, spending the rest of his time as a chef (or as the knife of a chef). His cursed status often brings paladins and clerics to his door as they attempt to destroy him. He\u0027s forced time and time again to \u0027eliminate\u0027 pesky investigators. He just wants to live in peace, dammit. Why can\u0027t you leave him alone?"},{"name":"Princes Alice/Thieves\u0027 Guildmaster Reev","description":" The kingdom controls the military power, the thieves guild controls the money - Princess Alice controls them both. Her exact motives are obscured, but her supreme control of both powers allows her to continuously support her invasion of nearby states, only growing her might (and wealth) more and more with each victory."},{"name":"The Devout","description":" (Good for a horror/Shadowfell campaign) The Devout are powerful clerics and paladins who strongly believe that all who exist in your town are corrupted and twisted by the evil that surrounds it. They will not succumb to your obvious lies and your failed tricks. The Devout stop at nothing to eliminate the evil you represent."},{"name":"Roregar","description":" The Roregar are a band of rangers cursed and tormented by their accidental trek into the outer planes. The Roregar have elongated features of their original race, and far, far paler skin. They now see every creature as a huntable beast, including innocent villagers and children. These monsters hate to be defeated by their \u0027prey\u0027 and will intentionally kill off severely wounded members of the party to preserve their hunter-prey dynamic."},{"name":"Primary Lead Industrial Golem (PLIG)","description":" PLIG was a golem designed and used for an industrial project in which a grand city were to be built. Several wars later, the project lay abandoned and everything shut down... until an accidental encounter reactivates PLIG. PLIG, attempting to resume his task, begins building an army of Golems sent out to gather resources needed from wherever possible, including nearby towns and villages."},{"name":"Sigmund","description":" Sigmund is a powerful vampire who has spent much of his time building an army of followers. At this point, he has an entire village of followers. He often sends his followers on \"trade\" expeditions to bring in more people to capture and convert."},{"name":"The Weaver","description":" The weaver is an immortal spell-caster with immense control over residual magic. Each spell cast near her increases her spell-casting prowess. She believes that most mortals abuse the flow of magic and should be cut off from using it."},{"name":"The Blademaster","description":" The blademaster is a fierce warrior. Having honed his skill over the ages, he rarely misses attacks, making him a formidable foe in combat. When he attacks, roll d30s for the attack roll instead of d20s."},{"name":"Jimmy Chickenshack","description":" This fat piece of shit runs 4 whores out of the Leg \u0026 Whistle, real pigs, and uses the Lunk Brothers to protect himself, and his interests, which are many. He knows just about everyone south of the Gate, and rumor has it that he has connections to interests in the narcotic substances being smuggled out of the Evil Capitol, real heavy shit and expensive as hell, so they say. Jimmy likes to diddle gnomes when he can afford it, which isn\u0027t often, and he generally stinks of sour cheese and his own particular musk, which is not unlike rotting shit."},{"name":"Bodiddle Blank","description":" This elven pimp runs a moderately-sized stable of whores from the top floor of the Come On Inn. His gaudy clothes and outlandish manner hide a crippling alcoholism, which makes him violent and unstable when any of his \"Inner Truths\" get violated. They include, \"Pay on time\", \"Don\u0027t disrespect me\", \"Don\u0027t beg\", and \"Elves are the superior species\". He walks with a sword-cane, with the pommel of a wolf\u0027s head, and can always be found down at the docks on 7th Day, gambling dice with whomever is stupid enough to play with him. He cheats, and well, and has a nose for knowing when to walk away. He hates and fears dogs."},{"name":"Kerblaine Kersk-Obermeyer","description":" Gnomes have the quickest tongues, and his daddy taught him every dodge that the old man knew, raised him in the life, and fleecing a pigeon came as natural to him as breathing. Con-men don\u0027t last long who can\u0027t read the mood of a man, or a room, in a single glance, and violence is always the very last resort of a man who has forgotten how to use his wits. Kerblaine knows a hundred street cons, always playing the short-game, never sticking around, never appearing in the same street twice, if he can help it. His favorite dodge is to pretend to have found a lottery ticket in the street, but says he\u0027s lost his identification papers, and if the mark can go cash it for him, he\u0027d split the winnings with him. Of course, the grifter can\u0027t let the pigeon just stroll away with a valuable ticket, so he asks for a portion of the future winnings, as a \"security bond\" (usually half, and Kerblaine generally forges tickets that pay off 50 gp, not too high to raise suspicion, and not too low as to not be worth the trouble). When the mark pays up and goes to cash in the ticket, Kerblaine disappears like smoke. Sometimes if the mark looks like he deserves it, Kerblaine will tip off the Watch about a potential con-man in the area, heading to the nearest Temple/Shrine of Luck with a phony ticket. He loves a drink and a dance with the ladies (or the men, he\u0027s not fussy), and never uses the same alias twice. He sleeps armed."},{"name":"Sunshine Perkins","description":" 7 feet of muscle and a mug slashed crossways with a blade, all turned to scar tissue. He moves fast when he needs to and is strong enough to lift a horse and carry it 30 feet. Human, late 20s, he rarely speaks, and does so with a deep, melofluous voice and a speech rough and uneducated. His favorite method of torture is carving off the victims eyelids and dislodging the eyes with a spoon, so they dangle, and can watch as the madman carves them up, into grotesqueries, starting with the feet and transforming their bodies into shreikingly horrific \"works of art\", as Sunshine thinks of them. That\u0027s just his hobby though. His job is mercenary, and works for a decent wage for most of the major gangs in the area, which one depends on his seasonal mood. His whims change with the sun, but he\u0027s generally loyal for the season if paid up and treated well, as his services are in high demand. His doesn\u0027t gamble or whore, but is known to drink heavily, preferring thick and bitter stout served in his triple-sized stein, whom he\u0027s named \"Daisy\"."},{"name":"Elliot Cooper","description":" Known to his crew as the \"Red Cube\", he is one of a hundred who have led the notorious street gang, \"Hermanos Perdidos\", aka The HP, and he\u0027s been one of the lucky ones, strong enough to have consolidated his hold on the nearly 200 members of his brutal community. He is smart and cunning, known to favor rolling blood-red bone dice to make decisions, all just a ruse to make his enemies (and his friends) think he is reckless and unpredictable. In reality, the choices are already made and the dice are just theatre, but effective, and he likes to foster the impression that he is a servant of Fate. He is anything but. A ruthless warlord, who has been expanding his territory, wealth and security for the past 11 years, the second-longest serving \"Los Primero\" in the gang\u0027s 80-year history. Elliot is a middle-aged human, with bright red hair and a thick beard. He is tall and stocky with muscle. His favored weapons are two long daggers, named \"Boo\" and \"Spooky\", and his biggest weakness is a fondness for strong narcotics. He fears rats and snakes."},{"name":"Devine Marco","description":" This old elven wizard controls an empire of assassins and thieves across half the continent. His spies are in every major city and his deep agents are close to a dozen high-ranking officials and people of influence. Completely bent on controlling the entire empire by the time he is 1000 is his life-long goal. A master of logistics, he has created a black-market trade economy that rivals the empire\u0027s legitimate one. A deeply intelligent man, his love of numbers and strategical, long-term ideals, have made him a force that the legitimate governments have begrudingly come to accept. His favored tactics against those who interfere with his business is to have one of his assassins administer a mild poison to the offender, who becomes sick with fever and excruciating cramps. After 3 days of this torturous illness the assassin terminates the victim and sends his head to Marco, to add to his collection (preserved in jars in a huge vault in his personal tower)."},{"name":"Penny Mission","description":" Burglars are not hard to find if you know who to ask. Penny is not an ordinary burglar. She works for the government exclusively, and carries out missions against those who come into the possession of items that are deemed dangerous for that same government. She is devoutly loyal to this Grand Cause and is a raging patriot who has been forced to keep it to herself, and live a double-life. That second life is a studious book-seller, who is rarely seen except on 2nd and 7th Days, and only then for a few hours, and who keeps to herself and does not live beyond her means. Her specialites are gnomish and dwarven traplocks. She can get a Thunder Cutter lock (used on most of the front doors of the private estates she \"visits\") open in under 20 seconds, under 10 on a good day. She favors disarming traps to springing them, and has made a life-long study of the engineering habits of gnomes and dwarves especially, but has a working knowledge of other racial defenses as well. She loves to cook, and indulges that passion when forced into her book-seller role (a grey-haired wallflower named Erma Densmarsh who lets her 2 employees run the business, a small store called \"The Fictional Fen\" - a play on her name, and typical of the \"cutesy\" naming convention of the area). Her culinary skills are reserved primarily for human men. She spent many years being brutalized by them in various jails and prisons around the Realms and was once forced, by hunger, to partially eat a dead cellmate, a man who deserved so much more punishment than being snacked on."},{"name":"Famous Hippopotamus","description":" A hippopotamus who waded into the wrong mud pool as a child and was endowed with phenomenal magic and superior intelligence. His family were also so affected, but were slain by hunters. He was saved only because he revealed his freakish intellect before he could be killed, and was instead sold to a travelling circus. Here he became world famous for his performing tricks, and it was at the circus he met the fortune teller Razoo who started him on his journey of magical discovery. Eventually his knowledge grew great enough that he could escape his cage and run away from the zoo. Walking upright like a man and concealing himself under a cloak, Famous Hippopotamus was able to pass himself off as a larger humanoid, like a goliath or half-ogre. He lives on the fringes of society and has become the leader of a dark guild. His minions steal for him whatever scraps of magical knowledge they can find, and he grows ever more powerful. One day, Famous Hippopotamus intends to reveal himself and enact a grand scheme to make humanity pay for the things their kind have made him suffer."},{"name":"Caldwell","description":" Caldwell is a master wizard who specializes in illusion-based magic and deception. He uses blackmail and other under-handed tricks to hold power over any of his allies and enemies, ensuring that he never has to fight anyone himself, while spreading his control as far a possible."},{"name":"Alder","description":" A revenant who has his time limit magically suspended indefinitely. An enforcer who fears nothing, least of all death. He has the unique ability to disjoint any two things (especially bones) easily with the slightest touch, allowing him to cripple enemies and even disassemble weapons with ease."},{"name":"Mother Magdela Rimedragon","description":" Formerly the mother superior of a convent dedicated to an excessively unfun sun god, she was turned to evil and madness by a dethroned divine tyrant. Her nunnery is still outwardly all stiff and good, but every sister has been converted and nothing stays dead for long in the catacombs. Anyone seeking to do her in will be met with nary a magic missile or crossbow bolt; she is polite, first and foremost, and will calmly question and chide any interlopers in her sanctum (while a scentless poison gas to which she is immune builds to a lethal level in the ventless chamber)."},{"name":"Lord Naples, Sr.","description":" Creaking in the termite-ridden rocking chair he insisted on being buried with, the late Lord Conrad Naples, Sr fumes over the incompetence of his only son, who is no doubt spuriously wasting the family wealth, not to mention definitely not watering the lilies twice a week, and would it hurt to wear that shirt his mother bought him? Kept in check by layers of holy circles, booby traps, and elemental guardians, Conrad nonetheless draws adventurers to his aid through his vast mental powers. Any that survive the hurdles of his prison will be offered the task of killing Naples, Jr, for which they will be repaid with a sack of copper pieces and a swift kick in the rear, because in my day you had to kill ten men if you wanted an egg for breakfast, and damn if you didn\u0027t earn it, not like kids these days."},{"name":"Chef Sargossa","description":" Sargossa makes her living touring the world, cooking extravagant dinners for the rich and dim-witted. Her reputation precedes her, and makes a potent weapon against her hated aristocrat patrons. Signature dishes include unicorn steak, gelatinous scoops, and soup like your mother would make. Few complain, when doing so reveals how unrefined one\u0027s palette is. She might be encountered as the chef at a privileged estate, serving drider eggs benedict, or collecting unwilling ingredients."},{"name":"Assistant Vice-Associate of Artifact Requisitions, Cuthbert St. Rufterfrangle","description":" Cuthbert needs things done by the book, and he IS the book. NOTHING must be out of place and EVERYTHING must be accounted for, on paper, signed and stamped by at least three witnesses. Adventurers? The bane of his existence. They never fill out their forms right, and for every two hours of paperwork they give him he\u0027s going to give them two days of waiting around for their next assignment or paycheck. Oh, you forgot your requisition papers? Maybe he\u0027ll \"forget\" about that dragon that is guarding the location of your next mcguffin..."},{"name":"Stitches","description":" Stitches was made by the Millers on a lazy summer evening about 15 years ago. Billy got the stuffing, Mary did the sewing, the Twins helped find the best sticks for his body, and when it was done Ma helped draw on the face and Pa set it up in the fields to help protect their autumn crops. Then a wandering hag found her way to the sleepy farmstead. Stitches awoke with a deep gnawing desire to be human and a hatred of all things living. Now he wanders the dark moors of the land looking for fresh body parts to stuff into his sewing and skin to tighten his rotting fabric. His face remains, bloodstained, with the happy upwards smile in blue and black poster paint."},{"name":"Big Boss Bo Bartrand","description":" The Big Boss is king of the undercity, the underground. He has his fingers in all the pies and he pulls all the strings. No matter what con you\u0027re running, the Big Boss gets his cut or you will GET cut. He has a wealth of information, available for the right price. He can get you into the right places, for the right price. Money gets you access to everything, but don\u0027t get the wrong idea, Big Boss Bartrand still owns everything. This is his city, and if you even think about crossing him you\u0027ll be sleepin\u0027 with the fishes by morning."},{"name":"The Remarkable Five, Adventurers for Hire!","description":" Consisting of a Dwarf Fighter, Elven Ranger, Half-Orc Barbarian, Halfling Rogue, and Human Wizard, these adventurers are the talk of the town! Their deeds are legendary, their prices reasonable, and their hearts are pure. Sure, they accidentally murdered that village instead of helping them. Sure, they attacked and killed that one paladin because the fighter wanted his +2 magic sword. Okay, sure instead of negotiating peace with the goblin tribe they slaughtered them all to the last man and looted their corpses- but they are DEFINITELY not the bad guys and there DEFINITELY won\u0027t be ANY collateral damage if you hire them. Promise."},{"name":"The Prowler","description":" The Prowler is a serial killer, either human or elf, who stalks the streets of \u003cinsert key campaign city here\u003e. His identity is unknown but he wears a black trenchcoat, a mask (similar to that of Darth Nihilus), and is extremely skilled with a short sword and magic. Every 1d10 days he kills 1d4 people, mainly city guards, and raises them as zombies."},{"name":"Ayllen of the House of Goldentree","description":" Ayllen Goldentree is an elven noble woman living in \u003cinsert main city here\u003e. While she is only a minor noble in theory, she exercises massive influence due to her network of spies and assassins. She knows the secrets of almost every noble in \u003cinsert country here\u003e. She tries to contract the PCs to work for her. Not one to take no for an answer, if they refuse, she finds some sort of secret of the players to strong arm them into helping her."},{"name":"The Blackarrow Clan","description":" More of a group of antagonists than a group of villains. The Blackarrow Clan is a clan famous for its bounty hunters. Lord Erroll Blackarrow is a human ranger, the current head of the clan, and the best bounty hunter in the land. The Blackarrow Clan’s signature weapon is the infamous black arrow, a secret family recipe for a black poison that is applied to the tip of an arrow (thus its name) which causes 2d6 poison damage along with unconsciousness in 1d10 turns. The idea is that if the PCs commit some sort of crime worthy of getting a bounty placed on their heads and the Blackarrow Clan comes after them. Starting with younger members, the PCs will have to deal with older and more experienced Blackarrow bounty hunters until they have to face Lord Blackarrow himself."},{"name":"Avard the Starved and the Starving Army","description":" Avard the Starved is a human who was once a wizard who experimented with ghouls and ghasts. He was ostracised after several “subjects” escaped from his lad and made a meal of a few townspeople. Furiously, he continued his experiments in the wilderness. After an experiment gone wrong, Avard was turned into a ghast/human hybrid but retained his spellcasting ability and the ability to command ghouls and other ghasts. Deciding to get revenge on the people who exiled him, he assembled an army of ghouls and ghasts that later became known as the Starving Army. Some of the ghasts he managed to teach magic and he taught them how to cast greater invisibility multiple times. Forming the ghouls into squads of five ghouls and one ghast, Avard then set them upon various cities and towns resulting in an increase in guards all over \u003cinsert main kingdom here\u003e to protect the people from roving bands of invisible ghouls. OPTIONAL: Many criminals saw this and witnessed the power of Avard and approached him asking to be turned into ghast/human hybrids themselves. Avard obliged and made them the officers in his army."},{"name":"The Severed (\u0026 The Skeleton Guild)","description":" No one has seen this mysterious figure, but everyone is aware of the Skeleton Guild that follows them. Some form of necromancy has taken foot of the surrounding area, meaning that any body rendered down to a skeleton through whatever means is immediately animated as a \"member\" of the Skeleton Guild; a crazed construct bent on \"liberating\" other skeletons from their fleshy prisons. All signs point to one of the twelve Merchant Council members being The Severed though it remains to be seen which one it may be."},{"name":"Grand Savage","description":" The leader of the largest orcish clan in the unclaimed wilds has always earned the moniker of Grand Savage as a term of respect from all subordinates and rivals. The current title holder is an eccentric yet towering old orc with a penchant for wide brimmed hats and leopard skins, his weary eyes hidden behind a pair of darkened spectacles. His aim is to unite the clans through whatever means necessary and slaughter the settlers that dare encroach on (what he considers) the orcs\u0027 rightful holdings, just as he butchered his way to the top of the food chain."},{"name":"Archivist T\u0027veleroth","description":" An ancient Mindflayer that had found itself sealed in an abandoned temple many centuries ago, T\u0027veleroth swiftly lost his mind. With no food to prey upon and no way to escape he slowly became more deranged and desperate, eventually making a deal with whatever god or demon could ensure he survived his imprisonment. The deal was a success, but the cost was his free will; now he stalks the temple, enslaving the minds of others who dare enter to serve his dark lord and studying ways to bring his master\u0027s avatar into this world."},{"name":"Lord Eldric var Malum","description":" A minor lord with a glittering military career, he was charged with leading the assault on a valley that laid within contested territory; a task that many thought would be simple as the neighboring kingdom had few defenses positioned there. What instead occurred was a decade long guerrilla campaign which led to heavy losses on both side. With mounting pressure from his superiors and news of enemy reinforcements approaching he set off a deadly arcane bomb that devastated the surrounding land, wiping out both sides, including his wife and child who were stationed at the army\u0027s base camp. As the only survivor he blames both his own empire and the enemy for what happened and now aims to ascend to the throne, bring retribution against all he considers guilty and find a way to bring his family back from the dead by any means necessary."},{"name":"Gorgash","description":" Taken in by a pack of wolves when he was young, he never quite fit in. Sperating from his adopted family to try and find his birth parents led him on a life changing journey. He only found that his mother was killed at child birth, and his father killed himself shortly after trying to kill his only son by feeding him to the wolves. Gorgash now travels the country-side murdering new families in fear that the same thing will happen to them."},{"name":"Fjord Horchok","description":" Grew up son of an innkeeper, didn\u0027t find his wizard potential until teenage years. Was shipped off to the college in the capital to become professional wizard. Was drafted to the military during the civil war, forced to kill hundreds of people. Now hunts after military officials to avenge the innocent people he killed."},{"name":"The Dealer","description":" Nobody knows his real name because he never reveals it. He hands cards of great power to people he feels have the capability to complete certain tasks (ie, rule over a group of people, kill your loved ones, make people think you\u0027re a god). He\u0027ll give many different people cards who will often \"intersec\" each other."},{"name":"Yelong The Risen","description":" The once-dead Warlock who served Orcus, the demon lord. Yelong lead an army of undead in his attempt to conquer the world and crush the living via his mystical tablet, which could raise any who died as his thralls. In death the tablet was cast into the caverns below the earth and Yelong himself burned, however his dark master was not content to let him lie, and Orcus raised him from his ashes, combined with the essence of a demon servant. Now he dwells in the depths, seeking his tablet while trying to remain hidden from the world that destroyed him."},{"name":"Julius Carellius","description":" Julius is a man of his time, highly intelligent and blessed with land and fortune from his noble family. With the conflicts of the past years abated somewhat he was free to pursue his desires: the study of magic, natural philosophy and archaeology along with unrestrained hedonism. This made him somewhat infamous, and as his senses dulled with each new pleasure he began to merge his studies with his pastimes and engage in depraved rituals of hideous nature. This all culminated in an incident in which his villa went silent, and from the doors emerged a wailing and screeching creature. The wight that was Julius is of unusually great power and terrorizes the local populace to this day."},{"name":"Valaran the Doomsayer","description":" Valaran was a wandering prophet and though he achieved fame as a soothsayer to many he was an omen of doom. As it turns out the latter may have been more accurate, for Valaran was blessed by the Goddess of Time and used his extended life to become the world\u0027s most powerful Time Magus. With the flow of the ages in his grasp he became a mercurial wanderer, going from place to place and weaving fate as he went. When he was offended, or simply on a whim, he chose a new future for a person or place where calamity befell them. To defeat Valaran will not only require skill but subterfuge of an incredible nature, for if he knows you are coming you have already failed, and the wits to outdo a man who has seen the end and beginning of time itself."},{"name":"Thrakk, the Chief of the Palefists, Lord of Eastern Horde, Slayer of Men, Eater of Elves","description":" Thrakk leads a horde of 10,000 orcs. He is big, mean, and pretty clever—for an orc. He\u0027s called the \"Eater of Elves,\" but really he\u0027ll eat anything that doesn\u0027t want to be eaten."},{"name":"Heigerwach, the Necromancer","description":" Heigerwach led a death cult that gained a considerable following a few decades ago. He led the cult and he was loathe to share power with his followers. When the king\u0027s knights and assassins closed the noose around his cult, Heigerwach vanished without a trace. There are some rumors that he\u0027s still alive, waiting for an opportunity to return and reestablish his power. There are other rumors that he is dead, and he will return to haunt those responsible for his fall from power. Some whisper that he has already returned and is indoctrinating more followers and training them all in the necromantic arts."},{"name":"Pholx\u0027zto, the Grinning Green Dragon","description":" The enormous green dragon breaks into a smile. \"Where are my manners? My name is Prasino Pholx\u0027zto Chamogelo, the Grinning Green, also known as Pholx\u0027zto the Poisonous Smile or the Toxic Tongue of the Warpwood. But you may call me Your Excellency, and I come from far to the east of the great mountains. I am impressed with your sense of devotion to each other, helping one another...\" the Pholx\u0027zto pauses, and furrows his brow, \"we are only as strong as we can trust our friends, right?\" The dragon smiles again. \"Perhaps, you can be of service to the mighty Pholx\u0027zto?\""},{"name":"The King of Flesh, Ghoulish Hierophant","description":" In a dense jungle filled with strange and ancient beasts, the mighty and ancient flesh-eating ghoul, known as the King of Flesh, leads a mad cult of death, demon-worship, and cannibalism from within the walls of an ancient ruin built by an older even further-from-memory civilization. He was a paladin, pure and devoted to the light who led a small part to reclaim the ancient temple in the jungle. He and his companions ended up trapped in the lower levels of the ruin: without food, without water, without light, and surrounded by an ancient demonic presence, they were driven to madness and cannibalism."},{"name":"The King of Souls, Wraith-Sorcerer","description":" On a frozen plane, the King of Wraiths the incorporeal spirits walk about ranging widely across worlds to feast on the souls of the living, leaving mindless, soulless, burnt out husks of creatures in their wake. He once was a mighty and noble barbarian chieftain who united the clans and led them against the forces of the dead, until he was bewitched by a beautiful elf who enticed him to abandon his people. She wasn\u0027t an elf, she was a succubus, and his people fell into chaos and war as the other chiefs jockeyed for power."},{"name":"The King of Decay, Wormy Mass of Zombified Flesh","description":" In a dark and shadowy swamp covered with black, twisted trees, where the sky vacillates between pitch black and sickly dark gray with the cycle of days, lairs a rotting heap of maggot-ridden flesh and malevolent thought, the King of Decay. He commands an army of the dead (zombies and larva undead) who spread a plague that could consume all the other worlds. He once was a wondrous sage and healer, who studied zombie plagues in hopes of eradicating them: you can see how well that turned out."},{"name":"Beardo the Black","description":" An outlaw and brigand of the worst stripe, Beardo the Black has been terrorizing the northern countryside for more than a decade. Periodically, the towns and clans band together and break apart his gang and drive him off to the mountains, but he always seems to elude capture. Eventually, he returns with a new band of thieves and thugs and begins raiding again, preying upon travelers and farms."},{"name":"Relsch and Vidd Ahock","description":" Vidd and Relsch are brothers who inherited a large fortune from their ruthless evil genius father who made it big in mining iron and coal. They quietly began buying up mining interests in gold, silver, copper, and gems. They also began buying exclusive distribution contracts with the guilds that process the raw materials. They have more recently been spending gold to influence curriculum at various academies and universities and among the councils of nobles in several nations across the continent. They even sponsor acting troupes that move about the countryside performing tales in which the wealthy and powerful are champions over the forces of evil. They have thousands dependent on them for work, and hundreds dependent on them to maintain their illusion of power. They\u0027re playing the long game, but they\u0027re getting close to having the entire world under their thumbs (if it isn\u0027t already...)."},{"name":"Malspora","description":" Malspora was once an elf-maid and druid of great beauty and power, though she has long-since forgotten her Elvish name. Long ago in her forest, she came upon a strange, tentacled fungus that called to her in sweet whispers. When she approached it, the fungus wrapped it\u0027s tentacles around her and held her captive for years. Slowly, the fungus changed her: it twisted her form, and poisoned her mind with ugly and terrifying thoughts. Then, after a time, the grasping tentacles released her. She now roams the world, spreading deadly spores. When a creature inhales the spore, its mind rots over the course of a few hours and then it dies, only to rise as a fungal zombie. These fungal zombies rove in bands, uprooting trees and plants and pummeling living creatures, leaving a trail of destruction and decay. When one of the fungal zombies is slain, spores erupt from its corpse, thus creating more fungal zombies. By some foul craft, Malapora\u0027s mind is preserved from the rot, and, though she can\u0027t command the fungal zombies, she\u0027s quite adept at avoiding them and leading them untouched territory. She has hopes of creating a world where the body of every plant, beast, and humanoid has been reduced to a decaying mass for the cultivation of tentacled, malevolent fungus."},{"name":"Gabo Dinsey","description":" Small-time mob boss in a medium-sized town. Not Thieves\u0027 Guild, though has connections and will sometimes carry out work for them. Owns a large manor on a hill outside of town, next to the river. His font business is trading in antique furniture."},{"name":"Evira Dath","description":" A powerful mage who, long ago, sacrificed herself for the good of her people: she voluntarily became a lich so that she had access to the power to save the kingdom from an invading goblin force. She was convinced that the purity of her mission could keep her from straying into evil -- and indeed she succeeded in turning back the goblins, through the use of necromancy and foul diseases. Her mission fulfilled, she fled, undying, into the remote mountains in an attempt to spare others from her evil deeds. However, over the intervening centuries, her transformation has corrupted and embittered her, and she seeks to take revenge upon those she blames for her transformation; the kingdom she once called home."},{"name":"Roderick of Spode","description":" Roderick seems to be an ordinary historian, interested in collecting and preserving relics of previous ages -- especially now, since the spate of thefts from crypts and ruins all over the kingdom. Indeed, he will hire groups of heroes to venture into such places to secure them before the thieves get to them! He has an affable and genial manner, with a distinctive speech impediment, but this is a facade: in actual fact, he is to blame for the thefts (his concern is an act), and is seeking a particular long-lost dark artefact, for the power it can give, and to complete a certain ritual..."},{"name":"Sam the Man","description":" Who is Sam? Does he really have no possessions? Then where did he get that iron golem that follows him around? How does he turn up in the most unreasonable places, and how does he survive so easily in the depths of the wilderness? Why does he never seem to change, even his clothes, and why do people always seem to forget things when they are around him? And how does he know the party\u0027s names?"},{"name":"Nadeera the Severer","description":" \"We are all puppets. Even you, though you are special. You think you have agency. You do not. You are merely avatars for a cabal of extraplanar beings to meddle in our affairs. Heh... Our affairs. As if we have control over those. The rest of us are even less; we are simply an illusion. A projection of a mad overlord, to whom even your controllers must pay deference. He created us, fabrications for his sick whimsy. Every moment of your adventure since you came together, every ally and foe, every challenge you have overcome, has been naught but a game of chance. Your entire lives were dreamt up by him and his underlings. We have no will. No agency. No lives. Even the gods are but players in his minstrelsy. There is but one solution. We must sever the strings.\""}]