[{"name":"We currently have 65,019 people on this subreddit!","description":" Hi guys! For this event, let\u0027s build some plot hooks! Intrigue is something that\u0027s really fun and cool but for some of us it can be a bit hard to generate plot hooks that work well for something like this. And, let\u0027s face it, politics is a major part of life. We want our players to have to experience some of it at least. This allows us as DMs to give more realism to our players and to allow them to struggle with other aspects of PC life, other than just combat. It\u0027ll also allow for your campaigns to cater to players who want to deal with more of the role-play interaction and diplomacy side of things. As with the other 10k Things posts, PLEASE ADHERE TO THE FORMAT (to make the script for assembling the compiled lists run smoothly)..."},{"name":"Pantheon Problems","description":" I\u0027ll start with an example! So, the two major religious factions have decided that they\u0027re sick of the other. While both worship gods of law and goodness, they have decided that the other group is misguided. They are currently placing pressure on the town\u0027s leadership to create a law declaring theirs as the absolute power and outlaw the other. This intense dislike of one and another threatens a major civil war as most of the citizens of the town are members of one of the two religions."},{"name":"Dinner Party","description":" The party, having some recent success, are invited to a dinner party at the mayor\u0027s hall. The Mayor\u0027s wife pulls one member of the party aside and says, \"Someone here is plotting to kill my husband.\" At the same time, the Mayor pulls a different member aside: \"I think my wife is trying to kill me.\" Who is telling the truth? Who else at the party has motive? Let the party begin!"},{"name":"Boar Hunt","description":" The party is invited to hunt boar with the local nobles. This could be a skill challenge for awhile. During the skill challenge, other members of the hunt spread gossip about the others. It is all fun, until one of the nobles is found dead."},{"name":"Imposter to the crown","description":" The king sends aid to the on going war, an army led by his his daughter. Five years go by and the king dies. Word reaches his daughter and she returns home. The burial and the crowning of the new heir are set for a weeks time in accordance with the law. The following day another women arrives at the city claiming to be the kings daughter. She is also battle scared and also carries the kings seal. Two claimants and a law that decrees someone must be crowned in a week."},{"name":"Spring Fever","description":" Residents of a normally quiet guild-town have been acting strange in the past few weeks. Men are openly weeping over seemingly nothing. People are dancing in the streets without cause for celebration. Violence has been on a steep rise as well as the townsfolk are accusing one another of heresy, theft, spying, or being an impostor. What could the cause of this strange behavior be?"},{"name":"The River is Shrinking!","description":" Local farmers and fishermen are in a panic as the river they rely on is steadily shrinking with each passing day. Word of new infrastructure projects upstream may be the culprit. The simple folk of the river valley are powerless to stop the projects. Won\u0027t someone intervene on their behalf?"},{"name":"Secret Sanctuary","description":" The players discover a piece of loot on a previous adventure - a pair of blue lensed goggles. When they wear them outdoors, they see a massive stone skull floating over the nearest city. It is completely invisible without the glasses. If the players observe very closely, there are winged creatures flitting about the private floating sanctuary."},{"name":"Long live the King","description":" A beggar who sits at the kings gate overheard two of the kings servants plotting to poison the king. As he is just a lowly peasant he cannot warn the King, he beseeches the party to do so, but he is unable to identify the servants he overheard."},{"name":"Hippogriffs are devouring all the cattle","description":" Multiple villages suffer from devastating cattle losses due to reoccurring Hippogriff attacks. The hippogriffs attack because a red dragon is occupying their layer in a mountain near by and they had to flee."},{"name":"Mistaken Identity","description":" The party arrives at a new town and finds wanted posters plastered around the town with a very close likeness to one of the members drawn on each. The local constabulary quickly descends on the party."},{"name":"A Bone to Pick","description":" The party is given a quest by highest royal wizard to go into the dark swamp and retrieve an artifact that would greatly aid the wizard in official research. Upon reaching the location, the party finds an old hermit guarding it. The hermit seems slightly unstable, but warns that the artifact is extremely powerful and unlocks the secrets to necromancy (a practice long since forbidden in the land)."},{"name":"Brotherly Love","description":" The party is given a quest sent down by the king to go to the coast and take out a criminal accused of treason. The criminal stole important documents and plans to sell them to a neighboring kingdom. The party must make haste to catch him before he sells the information. The \"criminal\" is the king\u0027s brother, on vacation, trying to stay incognito and get away."},{"name":"Fading Magic","description":" The adventurers arrive at a quiet village, hoping to seek guidance and wisdom from the legendary Sorcerer who has retired there to teach his/her craft. However, when they meet this Sorcerer, he/she is only capable of completing the smallest spells, and the students have lost their gift entirely. The Sorcerer explains that magic is fading from the region without explanation, and if something is not done soon, he/she fears it will only worsen and spread. The Sorcerer pleads with the adventurers to find the cause of this phenomenon and reverse it. They must be quick about it, for soon they find their own magical abilities weakening..."},{"name":"Playing Dead","description":" The local theater troupe has been having a serious problem: every actor who plays a particular character in a classic play ends up going mad and committing suicide. The only way to find the cause of this strange curse is for someone from the party to play the role at the upcoming performance."},{"name":"Lost and Found","description":" The hedge maze in front of the manor has been maintained for decades by a strange elf who speaks in cryptic riddles. Recently, a visiting noble from a nearby kingdom went into the maze and never came out. Everyone who has gone in looking for him has met the same fate. The party must navigate the maze, which leads into the Feywild, where the missing persons can be found having a neverending party with a group of Satyrs."},{"name":"The Painter\u0027s Pigments","description":" A talented painter recently painted a mural of the king. The mural came to life, and now there are two identical kings. The only way for the party to determine which king is real is to splash them both with turpentine."},{"name":"Birth of the Nothic","description":" A weak young wizard starts to perform small illusions and magical feats for a price: knowledge. First small white lies and inconsequential secrets, but as the Wizard becomes more powerful and can offer more her appetite grows for more of the magical mysteries of the multiverse. Eventually the curse of the Nothic overwhelms her. And it was your tales and secrets from years of adventuring that tipped her over the scale."},{"name":"God of Goblins","description":" A small community of primeval goblins have selected a member of the party to be their holy deity and savior! This is all good and well, as the party gets to enjoy the many benefits of the unconditional worship, but over time more and more followers are being mysteriously murdered."},{"name":"The Grand Tournament (General Admissions)","description":" The Grand Tournament is coming up, and the local ruler has invited the party not as competitors, but as arena security detail. They soon take notice that a mysterious noble sponsor sneaking around the competitor\u0027s quarters. They may also discover the popular use of performance-enhancing magic, which has been long outlawed by the kingdom and church."},{"name":"Bardic Inspiration","description":" Patron/guild calls upon adventurers to investigate mysterious events. Several instances of fire falling from the sky (meteors) have been observed, the last occasion left [number] craters in the mountains nearby. Discover who/what is causing these events and what their intentions are. At the annual bard festival, possibly depending on how your bard performs, an elderly bard approaches the party and tells of a instrument that stolen from his master many years ago. He recently discovered its whereabouts. This instrument holds much nostalgia and he will reward you greatly upon its recovery."},{"name":"Magical Linked Genetic Mutation","description":" Magic has a corrupting or polluting effect similar to modern chemicals. Farmers using magic to remove blight or cure disease in their crops had resulted in unusual flora and fauna. Areas near magical centers (academy, tower, reliquary, library, battles) are hot spots of mutations."},{"name":"The Pyrrhic Prescience","description":" A traveling loremaster, selling his insights, was recently imprisoned for \"falsely\" claiming the duke was utilizing a cursed artifact. This orb allows the user insight into the near future, but only after the user offers a name of someone they know to a disembodied, whispering voice. The duchy is prospering wildly thanks to the duke\u0027s newfound wisdom, but there are rumors of long-established locals beginning to act like completely different people, as well as rumors of travelers who enter the town at night, without lanterns to light their way. A young upstart shire reeve sees the party as safe allies to request help with the mysterious circumstances."},{"name":"The Rightful Line","description":" A long ago explored and looted dungeon in the hills north of town is now home to a troupe of outcasts and ne\u0027er-do-wells who rarely bother anyone. When a revenant child awakens in the dungeon to again attempt to reclaim the lands taken from her noble family by treachery, the dungeon reactivates to keep her there. One rogue escapes the violent traps, seeking aid in the town, and is vanished in the night. The dungeon leaves a moon-like glow on the horizon of the town at night, but the jarl threatens any exploration of it punishable by death. The rogue\u0027s rumor of the revenant spreads, and the townspeople need outside help to discover if the jarl\u0027s reign was won through treachery."},{"name":"The Pine Shrine","description":" Priestess Gwyneth has a problem: As the only cleric in the village the villagers looked to her for leadership but now a new person has been called by a different god. Unfortunately they don\u0027t agree on much. If he is genuine that would be one thing but a charlatan would be an entirely different problem. The players must determine (with subtlety if possible, so that Gwynith gets first mover advantage) what he is. Bonus points if they manage to solve the problem ethically."},{"name":"The Cradle Rocks","description":" The party witnesses a caravan attacked by a high-magic military power (invisible drake-riders, griffon cavalry, or the like) at the edge of their vision. Investigating the aftermath reveals thoroughly dead caravanserai and a cracked crystalline sarcophagus leaking fluid. Whose clone is inside and who would want to get rid of it?"},{"name":"Regular Joes","description":" The authorities attempt to regulate (and tax and license) adventuring."},{"name":"The Contractor","description":" A bland-faced, middle-aged man contracts the players to retrieve a priceless artifact from a museum. The artifact is several eras old, dug up from the remains of a civilization long dead. Close inspection of the art and history of this civilization reveals worship of a deity bearing a striking resemblance to the man who hired them to retrieve the artifact. When asked about the coincidence, the man denies any connection to the deity and is only interested in the retrieval of the artifact."},{"name":"Battle of Wills","description":" When an elderly lord dies, he intends to leave his fortune to his heirs, who are 5 in total. He gifts his will to each of them, to his widowed wife and to his closest business partner. The 7 documents however, are contradictory, making a mess of who gets what and why. Hidden in every will are instructions to find the true testament."},{"name":"Stone for the mason...","description":" A wealthy merchant has commisioned an artpiece of himself from a mysterious and unknown artist known only through their pseudonym. When the merchant dissapears,, it comes to light he had many enemies and doubt starts to arise to where the men has gone and why his lifelike statue seems to be weeping...."},{"name":"...A blade for the thief","description":" The party is caught up in a large web of assassins, all set out to kill a wealthy merchant for one of several people. When the merchant eventually finds his demise, their employers start to wonder who carried out the hit, and threats are exchanged."},{"name":"Letter for the King","description":" On a border region, far away from the capital, the party encounters a dying, hooded man. He claims to be the King’s brother, and has a letter for him. If the seal is broken, the King won’t accept it. Then, the man dies. Consipiring local nobles will try to retrieve the letter (a warning of the conspiration against the King)"},{"name":"The reversed fable","description":" The adventurers arrive at a beautiful town. The princess greets them, and shows them around. Everything is blooming and gleaming, and the town seems to be prospering. The harsh, horrible truth: the princess and several townspeople have imprisoned a dragon, and are making a fortune selling of his scales."},{"name":"Rebels, run!","description":" A band of rebels are wreaking havok on the countryside. The King asks the party to stop them. Upon arriving at their camp, the party finds them brutally murdered, body parts strewn around."},{"name":"The Crystal Gems","description":" ?A mysterious and terrible condition is causing quartz-like growths to grow on the victims until it eventually kills them. The condition has since turned into an uncontrollable epidemic, and corpse robbers have been working a bit too efficiently since the start..."},{"name":"Crooked King","description":" A young and newly named king became obsessed with the idea of eternal life, he brought together the four greatest warlocks in the nation to attempt and grant him this power. As the warlocks begin casting their spell on the king, images of the true god fill his mind, Death. Death tells the king that he will come to his kingdom and his people if he doesn\u0027t give him bodies demanded. The king is forced to become corrupt and hire out monstrosities in secret to get Death the souls he demands. The warlocks were corrupted in the process of connecting their king to the God, following him only to be used as tools in the king\u0027s quest. A rebellion against the king\u0027s murderous ways begins to rise up, they believe him to be insane. The king knows that if they succeed Death with finally bring down his wrath on his people if he is allowed to continue the king will destroy thousands of lives."},{"name":"An Ancient Perspective","description":" The party has been sent to recover an artifact from an ancient tomb buried in a swamp. What at first appears to be a tall vertical structure reveals itself to be a long horizontal one that has sunken into the marsh, turning 90 degrees on its side and causing every hallway to become a pitfall. The party might be able to get some useful information from the tomb\u0027s senile caretaker, although she only can speak and understand a language that died out a few thousand years ago!"},{"name":"Bugged Out","description":" Stampedes of Thri-Kreen have been running from the desert and trampling crops, causing widespread famine. Who could possibly gain from filling in their sand-pit hives?"},{"name":"A Brew of Secrets","description":" It seems like the very same barkeep happens to work at an inn in every city the party passes, and he never denies having met them before. How can one dwarf have the time to run inns in three kingdoms at the same time? And why does he only ever accept stories and rumors as payment instead of coin?"},{"name":"\u0027Freedom\u0027 fighters\u0027","description":" You and your party are drunk, after partying hard in this inn. You go to lie down, when you hear a knock on the door. Outside is twenty or so dwarven guards shouting \u0027come, join us in our escapades in the name of freedom\u0027 saying no, they will gag and tie you. No matter what, they guide you to a colesium, where they force you to fight fiendish monsters and brutes. Let the party begin!"},{"name":"The King’s Aide","description":" The party is asked to investigate when a Lords standing order of gems from a Dwarven mine is not delivered on time. On reaching the stronghold, the party is refused an audience with the king, and is disturbed by rumours of changes in the mine’s operation coinciding with the surprise appointment of the King’s new aide (a sorcerer)."},{"name":"Village Thief","description":" During their journey, the party stops in a large village looking for a meal. At the tavern they hear a number of the residents discussing the ongoing nightly thefts plaguing the village, vegetable gardens have been raided, livestock - including chickens, several sheep, and a dairy cow have gone missing. Patrols, and some crude traps, have failed to catch the thief, can the party find the culprit?"},{"name":"Heir to the King","description":" The King died without any immediate heirs. An interregnum is declared and the Council of Nobles is formed to decide on the next king. The party is invited to the council on behalf of the common folk. All of the nobles want someone from their house to the throne and the negotiations seem to be breaking down."},{"name":"Leaking planes","description":" While the party are going about their adventures, random elements of another plane show up, like an ever burning fire from the elemental plane of fire. If they go to that plane tell them that there is a patch of normal material plane."},{"name":"Oh sweet Justice","description":" A beloved NPC is to stand trial in this less than reputable piece of mud that calls itself a town, furthermore you have seen the results of their rudimentary form of justice dangling int he town square. He is accused of stealing the scepter of the high priest and this one seems determined to burn and flail everything to get it back. To bad the real thief is still at large, with this scepter, and your beloved NPC is about to be reduced a size category."},{"name":"Against the Moon and Sea","description":" You ventured deep into the cliff-side dungeon. The former fortress and now resting place of a group of pirates seem totally at ease when you first stepped in. You knew you had 6 hours before high tide would once again flush this place, however after what must have been about 4 hours everything starts to turn against you, can you make it out in time or will your bones be added to piles?"},{"name":"Cold Hard Ground Below","description":" The feeling and sound of the airship giving away beneath your feet, slowly sinking to the cold hard shores below, it one of the most frightening things you experienced. In the moment you knew what it meant, one of your assailants must have taken out the captain and their combined weight added to your cargo is to much for the ship to bear. The enormous flying reptiles he called Wyvern keep on thrashing the ship, you and your men have to make a choice, save some crew or fight your way to the back to take control over the now rapidly increasing descent of the ship."},{"name":"Put This On","description":" The city\u0027s best chef is making the only meal that brings the city\u0027s biggest crime boss from hiding. Your players have gathered all the evidence necessary to finally take him down. As the party gets ready to enter the restaurant, they see the entire wait and kitchen staff exit, grumbling about their former employer. The party\u0027s half-elf used to have a lemonade stand. How hard could working one night in a restaurant be, really?"},{"name":"Greetings... FROM THE FUTURE!","description":" The party receives a warm letter from a wizard they\u0027ve never met thanking them for narrowly averting a disaster, and for being such good longtime friends. Almost immediately they receive a second letter, this one written in a much shakier and blunter hand imploring the PCs to help fixing the paradox the wizard has accidentally set in motion by sending his first letter too soon and changing history. Twist: The party must at one point fight their past selves Twerst: The wizard is one of the PCs from the future"},{"name":"The Doctor is in(capable of saving you)","description":" That last bout of adventuring has left one of you close to death, and the only thing that can save you is a potion made from strange and ethereal ingredients (blood from an enemy-turned friend? a rare and mystical herb that only grows near lies?) that you must gather before time runs out! Twist: The illness is caused by an affliction of evil spirits that you have to fight/persuade/threaten out of your friend Twerst: They\u0027re making it up to get you out of the city"},{"name":"Eternal Sunshine of the Draughtless Mind","description":" A very rich widower can\u0027t stand being tortured by memories of their dead spouse, and a disreputable alchemist has developed a potion capable of transporting you into their memories. The PCs must wander through from cherished memory to cherished memory and destroy any traces of their spouse they find (kill them at their birthday, replace the spouse with a PC at their wedding) before the potion runs out! Twist: They find memories and information that could allow them to blackmail the widower Twerst: They find out the widower killed their spouse and are under investigation"},{"name":"Archaeological Opportunities","description":" A group of mages from the local divination school have discovered, through vigorous study of historical tomes, and/or some chance scrying spell, the location of a long-lost ruin. The ruin is very remote and difficult to reach, explaining why it was never found. Because of this though, the mages need you to lead an expedition to the location, not only to confirm its location, but also to make sure it is safe, and to clear any possible threats you come across, in order to secure the way for a proper archaeological team. Possible ruin ideas: \u003cli\u003eAncient library containing unique information believed to be lost to time\u003c/li\u003e\n \u003cli\u003eA brilliant historical mage/alchemist/inventor\u0027s laboratory, possibly containing incredibly rare/valuable artifacts\u003c/li\u003e\n \u003cli\u003eRuined city of a dead civilization, possibly holding clues related to their downfall\u003c/li\u003e\n \u003cli\u003eA huge device (weapon?) built ages ago by an order of skilled craftsmen\u003c/li\u003e\n \u003cli\u003eThe hidden lair of a legendary ancient dragon, long-since-dead, likely to still contain its undiscovered hoard\u003c/li\u003e\n  "},{"name":"Pirates!!","description":" Over the past several weeks, several trade ships due into [city]\u0027s port have failed to arrive. We fear the worst at this point, and something must be done to make sure it doesn\u0027t continue. Obviously pirates are almost certainly the cause, so we\u0027ve prepared an armed exploratory vessel to sail to the last place these ships were spotted. We need you to find the pirates, locate their base of operations, and wipe them all out; no punishment is too severe for those murderous dogs! Potential twist: The cause of the disappearances may or may not actually be pirates.  "},{"name":"Fractured god","description":" A god has been shattered into elements of its personality, some of them manifesting as items and others as creatures or even humans."},{"name":"Between a Rock and a Hard Place","description":" After a rough fight, the Party has come across a small group of angry Orcs all too eager to start a fight. As the situation becomes dire, a horn is heard in the distance and a new group of Orcs arrive. Caught in a fight between two rival tribes the Party is left to figure out a way to safely flee without being hit by the Orcs surrounding them."},{"name":"The Royal Babysitter","description":" The Party is invited to a Royal Banquet held by the town\u0027s Mayor/King/Noble as a celebration for their heroic deeds. During the Banquet a fight erupts in the Great Hall. The King/Mayor/Noble orders the party to watch after his spoiled teenage daughter, ordering you to apprehend and hold anyone who dares touch her in any way so that they may answer for their insolence with their death. Turns out the daughter orchestrated the fight and is preparing to sneak out of the Keep/Manor/Hall. How will they choose to protect her now?"},{"name":"You gotta go all the way to the top","description":" After taking down the local crime syndicate, your party figures the job is done, but a note from a higher up lying on the bandit\u0027s desk and an assassin sent after the party shows there\u0027s always a bigger man"},{"name":"A Wizard Is Never Late","description":" Things look bad, and POOF! there\u0027s that powerful ally who never seems to be around when things get thick. He\u0027s slinging fireballs and lightning bolts and mowing down enemies with his shining staff. Once the dust has settled, the wizard tells you that he made a terrible mistake, instead of going north, it is urgent that you go around to the south. The enemy has sealed off the northerly route..."},{"name":"Stake Out","description":" You\u0027ve waited all evening until he emerged from his chambers. You\u0027ve chased him down into the depths of the castle. The vampire has downed your companions. You\u0027re all that\u0027s left to stop the cursed one before he marries the princess on the morrow and cements his place as tyrant of the kingdom. The foul thing throws you across the stone chamber, crashing into a wooden chair. You find yourself on the ground with a splintered chair leg inches from your fingertips..."},{"name":"The Good Guys","description":" The caravan is two days from reaching the city at the other side of the wasteland. It\u0027s been a harrowing journey—sandstorms, desert wolves, and mounted bandits. You\u0027ve repelled wave upon wave have hit the caravan, but you must see the ancient book safely to the scholars in the Golden Temple of the Sun. You will not be able to hold off against the bandits another time. You see a score of riders approaching across the dunes. Preparing for one desperate, last stand, you find a bit of high ground and hunker down behind a row of wagons and tightly tied pack animals. That\u0027s when the banners become clear. It\u0027s a retinue of Soldiers of Light who have come searching for you. The commander tells you that he will be taking the book the rest of the way..."},{"name":"Here Come the Heroes","description":" A young lad who\u0027s always hanging around your favorite watering hole runs up to you, breathless. Panting, he tells you that your favorite tavern has been taken over by a notorious gang of street toughs. They\u0027re guzzling ale and wine and making the proprietor\u0027s daughter dance lewdly atop the bar. It\u0027s only a matter of time before they ransack the rooms and the cellar and find the valuables you\u0027re keeping there—if the proprietor hasn\u0027t sold you out already. Rolling up your sleeves, you hoof it across town..."},{"name":"How big can it possibly get?","description":" A town and nearby forest has been almost completely drained of magic, fey seem especially weak and the more magically aligned seem to even be suffering from a sickness due to the unnatural lack of magical energy. In the forest lies a crazed wizard, driven into isolation years ago after he forgot to feed his pet ooze and it went on a feeding rampage. In the center of the forest lies that same wizard, channeling all the magic energy he can into his ooze causing it to grow to gigantic proportions with an equally gigantic appetite."},{"name":"Lights, Camera, Action!","description":" Once every five years, the ruler of a city will grant someone a special audience and even grant them anything under his power to bestow. The catch? The person who gets the audience has to win a talent show judged by the ruler himself, full of singing, dancing, acting and anything entertaining. Bards from all over the kingdom gather for this opportunity and the competition is fierce. Twist: The king has a very unique taste in entertainment."},{"name":"Media Rez Goblin Attack","description":" Instead of hook for everyone, give each player a quick sentence or two about their current situation, a goblin ambush on their village. \"Fighter, you keep pushing against the door as the goblins\u0027s makeshift batter ram batters against the aging doors planks. The villagers behind you huddle in terror at the back of the church, trapped. Please make a Strength check to keep the doors closed\" \"Thief, under you 4 well armed goblins prowl around your house, poking long spears into your belongings. Your muscles begin to quiver under the strain of holding yourself in place, outstreched between the rafters. You wide eyed younger sister clings to your back, watching the goblins with you. Make an Stealth check followed by Strength check\" \"Bard, 15 children huddle with you in the shed as a large goblin patrol moves by. Terrified, one of them begins to cry. What do you want to do?\" Etc..."},{"name":"Who Says You Can’t Trust a Pirate?","description":" You and your friends are strangers in a strange land, having worked your passage across the wide sea on a pirate ship. After bunking down for a few nights on these unfamiliar shores, the night watchman hears something. One voice. Then two. Then a hundred. You bolt, making for the shore, where you must create a signal fire, then protect it from the waves upon waves of enemies."},{"name":"Dragged Back from Death","description":" This is it. You’re on the slab, the cackling lich who captured you raising a sacrificial knife above your throat. Time dilates, and events play out at a crawl. You take one last look down at yourself... and spy a necklace that wasn’t there before. A holy symbol hangs around your neck. Well… it couldn’t hurt, right?"},{"name":"The Hungry","description":" The Necromancer\u0027s first-risen despairs at the endless pain of his existence. His master gave him life - or something close to it - but all he feels is an absence that cries out to be filled. The length of his new \u0027life\u0027 has given him strength and cunning, as well as a place beside the Necromancer\u0027s throne of skulls, but he hungers for something more. Perhaps with his master\u0027s death he may find an end - one way or another."},{"name":"The Turncloak","description":" The youngest son of a noble house at whose castle the party is currently laying siege, slips out of the castle and into besiegers\u0027 encampment. He offers to open the postern gate to allow the party\u0027s forces inside to slaughter his father, his brothers, and their loyal men to end the siege quickly. He asks only that at the end the siege they turn the castle over to him."},{"name":"The Turnsail","description":" On a moonless night, after \"acquiring\" an ancient elvish artifact from the manse of one of the city\u0027s most powerful merchants, the party races to the harbor to make their escape. While rowing out into the bay to meet the ship on which they had planned to sail, they see the ship raise sail and head out to the open sea, leaving them behind."},{"name":"The Turnsword","description":" Over breakfast, the party receives a note from the captain of a mercenary company whom they have employed: \"They are willing to pay me more. The price is double, or I walk. This is business, not personal.\""},{"name":"The Prickly Princess","description":" One morning after a night of carousing in the city, the party is met by the Watch in the street, clasped in irons, and marched off to a jail cell. The following day, the princess who had formerly been very friendly visits them. She heard about some forays into a certain brothel whose madame has been most slanderous about the royal family."},{"name":"The Turnkey","description":" A notorious outlaw Beardo the Black has been captured and is now rotting in a cell in the city\u0027s prison thanks to the heroic efforts of the party. Early the following morning after a night of celebrating, the party is summoned to the prison at the behest of the captain of the City Watch. When they get there, the captain and the chief gaoler tell them that the outlaw has escaped and the turnkey on-duty has been killed, his head smashed repeatedly against the stone floor. The guards on-duty say that no one has entered or left the prison save the warden, the captain, a few guards changing shifts, and the afternoon turnkey leaving after the now-dead turnkey arrived."},{"name":"The Turncloth","description":" A priest approaches the party in a tavern one evening. He says he has had it with the hypocrisy of the temple brass, and he\u0027s looking for some help to loot the temple treasury. He can get you in, but he\u0027ll need help getting back out."},{"name":"The Dive","description":" After recovering a hard-fought haul in a tomb or ancient ruin, the party arrives back in town to tuck into some ales at their favorite dive bar. Tedd the barkeep greets them warmly. Nilla the barmaid smiles knowingly as she sways around the bar to bring her favorite heroes their usual libations. Halfway through the first round of drinks, the party members start to feel a bit dizzy. Tedd trudges across the barroom and says, \"I had no choice. They arrive right before you did. I\u0027m sorry.\" The bar is now crowded with crossbowmen in mail, wearing purple and black cloaks."},{"name":"The Mole","description":" Gethers the one-eyed, grotesquely fat boss of the Dead Mouse Gang with whom you\u0027ve worked before dismisses the pair of lackeys that accompanied him to meet you here at this pub. \"Someone is informing on me. Someone on the inside. Lord Commander Hodge has been waiting for us at the site of three of the last four drops from some of our smuggling contractors. We\u0027ve stayed out of it, but I\u0027m running out of smugglers. I need you to find the mole.\""},{"name":"Turnabout is Foul Play","description":" After enrolling in a tournament of skill, agility, and strength at the behest of their mysterious sponsor, the party discovers that nearly every challenge has been rigged against them. At first, it\u0027s simple, petty things; an arrow without fletching, a set of weighted die. But when a steeplechase across town ends in the tragic deaths of a beloved noblewoman and her lover, all signs point to something more sinister."},{"name":"The Turn of the Shrew","description":" Old Heddy has for years been the go-to gossip for up to date news on the goings on of all aspects of life in the city. For the price of a drink and a little ribald conversation, she could be relied on to dispense a juicy tidbit or two on who may have been seen stepping out with whom, and what dock may have received a secret shipment of godshit. But when the party attempts to pay her a visit in her customary corner of the Heron\u0027s Bill, she hisses, spits, and gives them the evil eye; the bartender - a wise man - advises they run."},{"name":"Turn After Reading","description":" A struggling restaurateur has hired the party to do the unthinkable - sabotage his competitors. A renowned critic of all things gastronomic is in town, and the poor chef\u0027s only chance of receiving a favorable review is to shine in comparison to his peers. The adventurers are provided a simple map, a vial of something noisome, and a hefty sum of unmarked coins, and are sent out into the streets to wreak some culinary espionage. When they arrive at their first destination however, they find that the poison isn\u0027t just putrid - it\u0027s deadly."},{"name":"You Live, You Turn","description":" When a notorious Viscount betrays the party, it comes as no surprise - already wary of traps and duplicitousness, they make their escape from his mountain manor with ease. But many months later, while traveling through a port city, they\u0027re alarmed to find a wanted poster hanging from the door of the inn, the windows of the shops, and in the hands of the sheriff\u0027s deputies. To add insult to injury, the list of supposed crimes verges on the ridiculous, including things like \u0027Theft of the Crown Prince\u0027s Dreams\u0027 and \u0027High Treason Against the Unified Tonalities of A Flat Minor\u0027. Nevertheless, the local law seems intent on prosecution, and the only alibi they have rests on the word of a man who has already betrayed them once, and seems likely to do so again."},{"name":"The Poacher","description":" A small group have been hunting a certain animal/magical beast to extinction, and willing to threaten or kill the druids trying to protect their land. One of the poachers is willing to help kill his fellow poachers for the right price/favor."},{"name":"Under New Management","description":" You return to your favorite inn and/or brothel to find that the original owner of the establishment has met an unfortunate and bloody end. Luckily, their second-in-command and/or assistant has been only too happy to pick up the slack, and they assure you that it will not affect your relationship. Everything seems just a little too neat and tidy..."},{"name":"No Loose Ends","description":" The party has just killed the Big Bad, and they\u0027re returning to Castle Goodguy for their just reward. They\u0027re battered, they\u0027re bloody, but they\u0027re victorious. When they reach the palace, however, someone starts sniping at them from a guard tower. Then two someones. Then the entire city guard. The party has been ordered executed, and the order comes straight from the Crown."},{"name":"A Change of Heart","description":" A fearsome knight in black armor approaches the camp at night, unarmed and asking for parley. Upon interrogation, he reveals that his master, the cruel king of the neighboring realm, is planning on slaughtering the firstborn of every household. While he would much prefer to kill the adventurers and be rid of their meddling, his honor demands that he seek the help of the most able to avert this atrocity."},{"name":"Make Her Pay","description":" The youngest son of a noble family hires the party to find and kill a witch who has been warping the minds of the populace. Upon further investigation, the girl is not a witch, but in fact an ex-fiancee who spurned his advances when she learned of his own delvings into the black arts."},{"name":"Shanghaied","description":" The Horses Replacement is one of the rowdiest dockside inns in Brightbluff, so it\u0027s par for the course when a group of rough looking half-orcs invite the party to a drinking contest. The drinks go down easy but win or lose, they\u0027ll be drunk and tired by the end of it. Unfortunately for them, the bitter old ex-cavalier who runs this establishment has a deal worked out with the half-orcs and their accomplices, and a discreet set of tunnels under each room wind their way right to the water and their boats. Passing out at the inn, they\u0027ll find themselves miles out to sea and suddenly the newest unwilling crewmembers (or slaves) aboard ship."},{"name":"The Ranger Who Couldn\u0027t Catch a Break","description":" While traveling in the forest, the floor suddenly collapses beneath a member of the party, and they narrowly avoid being speared by the ranger hiding within the pit trap. As the ranger stares at them, his eyes widen in fear and he murmurs, \"Oh gods, not again...\""},{"name":"A Slightly Unhelpful Wizard","description":" As payment for their most recent job, the party is given a bag containing a set of incredibly light plate armor, an ornate stopwatch, and a dagger emanating with a seemingly heatless flame. At the bottom of the bag is a small piece of parchment with an address written on it."},{"name":"Onwards, noble steed!","description":" One of the party\u0027s horses - the Paladin\u0027s War Steed, maybe? Suddenly turns wild and bucks off its rider, just as they are about to charge into combat. It will not allow its former rider to approach, let alone ride, although other people may be able to lead it."},{"name":"My Castle Now","description":" The PCs, having acquired wealth and noble standing after many adventures, come home from a hard month\u0027s dungeoning to discover that their loyal castellan is no longer so loyal, and has barred the gates against them, claiming the castle as their own. Can they besiege their own fortress?"},{"name":"Rumors of Betrayal","description":" The party arrives in a city where the King is away on a crusade, but the Queen is still around. They party goes about their business, until after a day or so, they realize that people are starting to stare at them and speaking in hushed tones behind their backs. Sooner or later the party will discover that there is a rumor floating around that the King has taken a lover while off on crusade, and has now sent that lover back to the kingdom for his/her safety. Of course, one of the party members is that rumored lover. Who\u0027s behind these rumors? Is there a secret lover trying to shift blame to someone else? Is a lord or lady trying to make some sort of power play? Is the thieves guild trying to stir up troubles to distract from their actions? Can the party stop the rumors? And what will happen when the Queen hears of these rumors?"},{"name":"Death rides a Pony!","description":" The avatar of Death appears to the party, and tells them he will be taking them all during their next dungeon. Buuuutttt, he will give them a pass if they help him recover his steed, which has been stolen by one of the other Horsemen. The problem is that he doesn\u0027t know which of the other Horsemen has his stallion, and so Death expects them to approach each of the other Horsemen about it. Of course the other Horsemen won\u0027t just give up info about the theft, the party will have to figure out ways to make the Horsemen cooperate."},{"name":"Constructing Trouble","description":" A wealthy town has a detachment of Golems that are used in the town defense. A squad of mages builds and maintains these automaton guards. What these mages don\u0027t know is that one of their apprentices is in actuality a powerful mage for the opposing side who has managed to make sure during the creation of each Golem that there is a command word embedded inside them to allow him/her to take control of said Golems when the time is right. Such as when the opposing side has an army outside to take the city mayhaps?"},{"name":"Mutiny!","description":" The party are resigned to a week or so aboard The Dowager Bride, working their passage across the Mirror Sea to the Outer Isles. The Captain, Morrun Jake, was loath to take them but has agreed eventually on account of the Bard\u0027s sea shanties or the Cleric\u0027s blessing or the Wizard\u0027s knowledge of Arabay legend, or somesuch. The deal is struck in a dockside bar, after a long spell drinking with the Captain, his first mate, the Bosun, and the Purser. Every day the sun shines, the sea is calm, and the wind is good. Every evening includes a spell at the Captain\u0027s table for at least some of the party, eating, drinking, telling stories, gambling a little. The rest get to break bread with the ordinary seamen. In between some work swabbing decks, stitching sails and repairing the rigging, the party has ample time to heal up, learn spells, swap stories, and practice weapons skills on the deck with various interesting sea-dog types. Friendships are made, and maybe some friction too in places. But a quiet interval between adventures is just what the doctor ordered. Until last bell on the third Friday at sea when Black Pete the Purser and Carter the Bosun slit Jake\u0027s throat as he sleeps and claim the captaincy. The crew are split and it looks like it\u0027s going to get ugly. With the party having good relations with some on both sides, how will the they play it?"},{"name":"The haven","description":" The party is currently fleeing danger, they conveniently come across a friendly person who offers them refuge to avoid their pursuers. Little does the party know that this person is a sadist/torturer/killer and once they get into the person\u0027s house they\u0027ll be featured in the new SAW movie."},{"name":"The healer","description":" Someone in the party has been afflicted by a curse, the local healer says that that person can be cured but it will cost greatly, demanding huge amounts of coin for \"reagents\" and other precious materials the party conveniently has. Once they have given enough the healer will ask for sacrifices, such as pints of blood and pounds of flesh."},{"name":"The highwayman","description":" As the party walks down a road they\u0027re approached by a single -apparently unarmed- shady looking fellow, he asks the group if they\u0027re in for a quick buck. Once they agree, the highwayman will tell them that a caravan of merchants is due to pass by that same road in a matter of minutes/hours, but he can\u0027t take them on alone. Once the PCs assault the caravan, the \"merchants\" reveal themselves to be bandits, partners to the shady fellow."},{"name":"The Judas","description":" Have a minor henchman idolize someone in the party, he will mess up once in a while but that\u0027s because he\u0027s clumsy. The first moment the party starts causing mischief he will sneak out one night and offer guards info on the party in exchange for money."},{"name":"The Medic","description":" A young person claims to be a medic and it\u0027s searching for some herbs to make a cure. He does \"warn\" the group about the dangers they\u0027re about to face. Each time they come back the medic needs yet another (more dangerous) reagent for his cure. The \"warning\" could be something like: \"Be wary, the leaves of X plant might be poisonous in a large enough dose\". But he conveniently omitted the massive cloud of noxious spores the plant segregates when threatened."},{"name":"The protege","description":" A very liked NPC (usually young) who follows the party has his/her own goals, after following them for a while that person realizes that reaching that goal won\u0027t come soon. Have a different band of \"adventurers\" appear as a rival match for the party, eventually making the protege"},{"name":"Lovers","description":" The party encounter a lone young dandy, Joraldo Callico, on the losing side of a drunken fist-fight with a hulking stevedore, Henk. Joraldo, love-lorn and in his cups, had made the mistake of lustily insulting the Scheffer family scion, Konrat Schefferson, within earshot of Henk. He works for the Scheffers. Most of the stevedores do around this part of the docks. Turns out the Callicos (southern hosiery and silk scarves) and the Scheffers (furs and leather from the north) have a long-standing and bitter mercantile feud. But Joraldo, a relatively unimportant young nephew of his family\u0027s current head, cares about the feud only in-so-far as it prevents him from marrying the love of his life, Kirstel Scheffersdotor, youngest daughter of Konrat himself. He shows the party the letters she has sent him, and describes how she is practically kept prisoner since broaching the subject of marriage with her father. Her last letter implores him to free her so that they can elope together. If the party can unite the lovers at the Crocus Inn by midnight tonight, they can have a barrel of Callico gold and as many silk scarves as they can carry, plus Joraldo\u0027s undying thanks. Springing Kirstel is a big job, and fraught with danger, but, assuming that they successfully deliver the beautiful, doe-eyed, love-struck girl to Joraldo and his surprisingly large retinue in an upstairs bedroom at the designated rendezvous, he will be overjoyed, handing over the reward and thanking them profusely as he suddenly drives a serrated dagger up under Kirtsel\u0027s ribs whispering, \"Callico honour! Death to Scheffer dogs!\" into her shocked and pain-twisted face. Whatever way the subsequent events immediately unfold ... How long will it take before the Scheffers get their revenge? Where, when, and how will it manifest?"},{"name":"Retirement Home For Former Heroes","description":" At a ribbon cutting ceremony for a newly funded home for aged out adventurers, the keynote speaker Mack the Medicocre, has been turned to stone. One of his former enemies finally got the last laugh and used a scroll to turn the semi-famous adventuer into a pigeon rest. The party has to find some of Mack\u0027s old enemies and recover the scroll so he can be turned back to normal."},{"name":"Will He or Won\u0027t He","description":" The party receives a contract from the Thieves\u0027 Guild to recover a particularly rare jewel, on behalf of an unnamed noble who is sponsoring the contract. The next day, the party\u0027s rogue (or the least trustworthy member) is contacted privately by the guildmaster\u0027s lieutenant. If the rogue will secretly return the jewel directly to the guildmaster, with the other party members none the wiser, he can collect the entire payment for himself. Will he take the chance? What if the lieutenant offers a path to promotion within the guild? How will he pull it off?"},{"name":"The Racist","description":" In light of a recent catastrophe, a well-known public figure declares extermination of a minority (tieflings work best here). PCs need not be the minority, but works best if they have emotional connections to the marginalized"},{"name":"Fried Piper of Hamlin","description":" A bard shows up in a town pushing an Organ (or whatever large musical instrument suits your fancy). He attempts to solve the issue of hunger in the town by playing an extremely fire beat, which somehow magically produces food within the instrument itself that can be retrieved and consumed. However, this act of generosity raises the ire of F\u0026B business owners, especially when paying customers start flocking to said bard for free, better-tasting food."},{"name":"The Monster\u0027s Monster","description":" Just after hearing rumors about the gruesome and unholy rituals conducted by the head of the local Merchant\u0027s Guild, none other than Higarth Braedown - the aforementioned head - barges into the tavern and hurries to your table. His paunchy frame and pallid skin clue you in that something has him deeply worried. \"I know you\u0027ve heard the rumors,\" he begins, \"and I\u0027m afraid they\u0027re all true. But worse yet, things have gotten sorely out of hand with one of my underlings. Someone needs to take care of him... Gah, I\u0027ve created a monster!\""},{"name":"Applying Leverage","description":" One cool, breezy night, an arrow finds it\u0027s way through an open window and into your bedpost. Closer inspection reveals a scroll tied around the shaft, with instructions for kidnapping the family of the magistrate and promise of a hefty sum to be payed upon completion. Suddenly your earlier conversation with the Prince about his holdings being under investigation for harboring contraband doesn\u0027t seem so innocent."},{"name":"Winter Storm Warning","description":" In the market square, a beautiful priestess asks help kidnapping the king\u0027s son. She says if they do not burn him alive in a sacrificial ritual, a terrible early winter storm will ruin the harvest creating starvation conditions come winter. Don\u0027t worry, she can bring the lad back once the sacrifice is complete."},{"name":"The Renaissance Man","description":" In a lively tavern, a celebrated bard claims to have been slain seven times and seven times resurrected. The last time he was dead, he saw the location of the lost tomb of an emperor. Fearful of dying an eighth time, he doesn\u0027t want to make the journey alone."},{"name":"The Desperate Father","description":" Along the road, a farmer begs the fighter/paladin/ranger (or anyone) of the party to take his son on as a squire/valet. He\u0027s a good boy, but he\u0027s gotten into some trouble. The lad has become a bit violent and quick-tempered (almost killed a man with a scythe) since the local priest resurrected him after he had died of a mysterious fever."},{"name":"The Soul I\u0027ve Been Waiting For","description":" A handsome witch greets the party on the road. She says she\u0027s had a vision of the rogue/sorcerer/warlock (or anyone) rising to become a great prince of the Hells and she is pledging her help in making the ascent. She suggests the chosen one take her as a concubine, claiming she knows secrets for maximize the returns on collected souls."},{"name":"You Dragonslayer!","description":" The party arrives at a primitive village where the inhabitants speak a peculiar dialect. A local shaman greets them enthusiastically and invites them to meet the chief. A great feast is thrown in the party\u0027s honor, during which a trusted warrior who speaks a bit of broken Common relays that there is no doubt that you are the heroes of prophecy who will slay the black wyrm that has plagued the village for generations."},{"name":"I Dragonslayer!","description":" A wobbly old knight greets you on a forest road. He tells you that you must turn back and go the other way. When pressed, he reveals that he had intended to the slay the dracolich that resides under a hill, deep in the woods, but things got out of hand. He\u0027ll gladly share some of the hoard if you\u0027ll help him finish the task. His lady wife (a seeress who hates seeing her prophecies fail) will be most disappointed if he returns home empty-handed."},{"name":"I Am Your Father","description":" The party\u0027s cleric/fighter/rogue/wizard is called to a table in a dark corner of the pub. The hooded man sitting at the table says he has need of assistance on an errand of vengeance, some unfinished business. He lowers his hood to reveal that he is the party member\u0027s long-dead father."},{"name":"I Am Your King","description":" A band of outlaws accost the party on a well-traveled forest road. The outlaws defer to a small child among their number who claims to be the allegedly-murdered son of the deposed and definitely-murdered king. He\u0027s looking for allies in re-claiming the throne."},{"name":"A Wizard Is Never Late","description":" That wizard whom the party left for dead in the ancient, creepy tomb just walked into the barroom of the seaside inn. He heads straight for the party\u0027s table and says, \"Ah, you\u0027re just in time. I have need of you again.\" He looks around the room and lowers his voice, \"I may have been followed...\""},{"name":"Death Is Only the Beginning","description":" After a night at a roadside inn, one of the party members arises having had a terrible nightmare. He dreamed of awakening in the night with a knife with gilded serpents buried in his chest. An ugly woman was leaning over him, twisting the blade. She whispered that he\u0027ll die every night until he frees the being that sleeps beneath the waves in a sea half-the-world away. There is an unaccounted-for-scar on the left side of his chest..."},{"name":"Abraham and Isaac","description":" The warlock of your party is asked by their patron to sacrifice a child, or risk losing their powers forever. Depending on the patron, this could have several win conditions: an Archfey could expect total obedience, but step in to stop the sacrifice before it\u0027s completed; a Fiend could watch and laugh as the sacrifice is carried out; the Great Old One might revel in their mental distress, or even expect them to flat-out deny the demand. In any case, they are rewarded for \"passing the test.\""},{"name":"Law and Order: Celestial Victims Unit","description":" A suitably powerful angel delivers a summons to the Chosen One: due to their unwavering commitment to justice, they have been called upon for jury duty. They and the party must pack up and leave for the high heavens to sit in on the trial of an angel who may fall from grace."},{"name":"Keeping It in the Family","description":" Suddenly, a dragon! The dragonborn (or Draconic Bloodline sorcerer) of the party is singled out, as the dragon in question is their great-great-great-grandsire, who has grown too large to fit in his childhood lair and needs someone who shares his blood to help clear out a band of looters and cart out the treasure to be relocated. As the quest progresses, it\u0027s clear that this is not, and really never was his lair."},{"name":"The Fire Princess","description":" A small humanoid fire elemental asks to be freed from a containing vessel. Once free she may give the party a reward (e.g. a fire ruby witch can be consumed to throw a Fireball or sold as jewelery). She them appears in random fires, such as torches in a dungeon, to talk to the party or give them a small, strange task. Once the players prove their value and her trust she asks them to help the fire kingdom in the elemental plane. The elemental convergence, an event that decides which element will prevail over the others in the material plane for the next 10 thousand years, is near and war is imminent. Plot twist: even though she keeps saying that an era of fire would bring life, light and warmth to the material plane the truth is that no element ever wins the convergence and this is what keeps the material plane balanced. If an element gets an edge over the others terrible things happens on the material plane (a fire era would more likely bring firestorms, heat the planet and start a vulcanic apocalypse)."},{"name":"Drow Underground Railroad","description":" The party encounters refugees that were helped out of the Underdark by a Drow. They want to save others that were left behind."},{"name":"The 3 Demons","description":" One of the party members is spoken to by a God while they were sleeping. They foretold that 3 great demons, Behemoth, Ziz, and Leviathan would soon awaken and ravage the lands if the party doesn\u0027t stop them."},{"name":"Hats (and Heads) Off","description":" The players arrive at a town where everyone is on edge following the discovery of headless townsfolk outside town. No one knows what\u0027s causing the rash of headlessness, and the town guard would really appreciate it if the adventurers were to figure out why it keeps happening. While investigating, the party finds a fancy hat that looks like the hat a lord or lady might wear. How it got outside of this poor farming town is a mystery. There are no signs of magic on it, and it looks and feels just like an ordinary hat. Unbeknownst to the party though, a clutch of young mimics live in the area, and have learned the neat trick of looking like a hat causes people to pick you up and put you on their heads so you can then proceed to bite their heads off. Is one of the party members HEADed for disaster and decides to put the hat on? Will they discard it and then wonder why townfolk\u0027s heads keep disappearing? What will they do when the clutch becomes brazen enough that a half dozen or so \"hats\" line the road?"},{"name":"Lords and Ladles","description":" A celebrated Dragonborn cook has gone missing on the eve of the spring festival, and the local baroness is at wits end to either find the poor sot, or provide a suitable replacement. To complicate matters further, a series of portents (the appearance of a blood-red star, the blossoming of a long-dead tree in the castle courtyard, the water in the ancient fountain in town square belching forth what appears to be blood, etc.) matching an ancient prophecy foretelling the return of a threatening (but vaguely defined) foe has the local churches and peacekeepers on edge, and some of the more influential townspeople are calling for the cancellation of the festival altogether. Others are hesitant - apparently this is far from the first time the spring festival hasn\u0027t gone to plan."},{"name":"The Voyage of the Mimmi","description":" A village has a stone tower that serves little apparent purpose, and mostly serves as a place for teenagers make out away from the prying eyes of parents and village elders. Recently, however, a large vessel of foreign design has appeared daily, descending from above the clouds to dock with the top of the tower for an hour or two before ascending back into the heavens. The blacksmith\u0027s daughter - a wilful creature - left on the ship two days ago, and hasn\u0027t returned."},{"name":"The Thirteenth Warforged","description":" The Thrice-Crowned Emperor has grown old, and his advisors are beginning to worry that the long-delayed discussion of who (or what) should succeed his centuries-long rule will come too late. Noticeably mum on the subject is Thirteen, the last(?) of a series of mechanical servants created for the Emperor in his youth, and closest advisor to His Eminence. Long-silenced rumors have resurfaced that the Emperor\u0027s livelihood is directly tied to the wellbeing of the automatons, and the reactivation of long-defunct factories beneath the palace have spurred speculation that not all is as it seems."},{"name":"The Necromancer","description":" A Mysterious Necromancer comes to your party asking for aid in exhuming dead bodies from the local cemetary. It is unclear what he needs the bodies for but he is offering to pay you with what your heart most desires."},{"name":"Undead Pest Removal","description":" While imbibing at a pub in town, your group finds a note on the wall from a local farmer asking for help with undead roaming his fields in the night and destroying his crops. Upon talking with the man, he believes something in the crypt on his property is stirring the dead. He is offering your group a hearty meal and drinks, and whatever you find in the crypt is yours to keep."},{"name":"The Empty Town","description":" Upon entering the town that was supposed to be camp for the night, your party discovers that the town is completely empty. Seeing a light in a church nearby, your party investigates. They find the entire town residing in the catacombs under the church. The party learns that the town has been terrorized nightly by a mysterious beast that eats children, soon the towns population of children will reach zero and the town will wither away unless your party can slay this mysterious beast, whatever it may be."},{"name":"The Dragon King Awakens","description":" Long ago, before Human Civilization emerged, the dragons ruled the lands. The evil king of the dragons ruled with no care for any of the other races. His ultimate goal was to exterminate anything not a dragon, anything impure. The Dragon was killed by a lone adventurer, inspired by the death of his love. Thousands of years later, a cult has emerged, seeking to resurrect their king, and they are on the verge of success. Will they be stopped, or will the Dragon King rise again?"},{"name":"Ways and Memes","description":" Someone is drawing the local citizens in unflattering ways, such as the local butcher chopping up local children with the caption \"You dannae expect me to pay for real meat, do ya?\" and posting the pictures in various places around the city. The city guard can\u0027t seem to catch the rapscallion, and now the city is offering a nice sized reward to whoever can catch the culprit. Can the party determine who the jolly joker is, or will they instead find themselves the caricaturist\u0027s next subject?"},{"name":"Silence of the Shams","description":" A known grifter and confidence man has been arrested after breaking into the magistrate\u0027s private club and declaring his guilt to all assembled, describing at length everyone he\u0027s ever swindled, cheated, and/or hustled. He also implicates your party\u0027s (rogue/fighter/warlock), claiming that they were partners in all of it."},{"name":"Three Men and a Baba","description":" A hag has terrorized the fens North of Glynnflldych for as long as anyone can remember, stealing lambs from the farmers and making strange demands from travelers passing along the fen road. The village tolerates her, mostly because the hag keeps the local bullywugs at bay, but a trio of brothers demanding her eviction have rallied a growing number of locals to their side, and they\u0027re looking for some muscle."},{"name":"The chosen... two?","description":" There are rumours of \"The chosen one\" or \"The returned one\" or whatever it is that the party\u0027s \"Special Butterfly\" is. Only it\u0027s someone else. Some other person is running about gaining fame on the PC\u0027s gimmick. The PC may get flak for something they\u0027ve not done, or suffer scrutiny they don\u0027t want if they\u0027re mean to be a hidden heir to the kingdom. Is this \"other chosen\" a fake? The true heir/chosen one? A doppelgänger? Is the PC the doppelgänger?"},{"name":"The Ancient Heir","description":" The party find a Lich at the bottom of a dungeon, and defeat and contain it, although they are unable to permanently destroy it. Amongst the Lich\u0027s treasure are things marked with a specific coat of arms. If they investigate, they will discover that the lich was actually the heir to the kingdom, thought lost and dead some centuries ago - and technically Lichdom doesn\u0027t count as \"death\" as far as the laws of succession are concerned..."},{"name":"What Is Dead May Never Die","description":" There is a massive shift in the spiritual world. Clerics of a specific god - including one of the PCs - find their spells have changed overnight - almost as if their god\u0027s domain had suddenly shifted. There are other strange signs. Statues or images of their god start to corrode, rot or crumble away. The signs and portents of their spells change. Instead of ravens as messenger spirits, bats. Instead of green flames, blue. Eventually, the PCs learn that somehow this god has been killed and replaced. An epic-level adventurer climbed the difficult path to the heavens and usurped this deity. Can the PCs journey to the Underworld and retrieve the slain god? Or will they throw their lot in with the newcomer? Even if they do manage to resurrect their god, will they be changed by their time with Death?"},{"name":"The Rat Pack","description":" The party is wandering the roads, when they encounter a minstrel troupe, who ask where the party is headed. No matter which way they say they\u0027re going, the troupe says they\u0027re headed in that direction as well, and could they travel with the party as they\u0027re feeling a little nervous since the mercs they were paying to guard them, betrayed them instead and ran off with the troupe\u0027s money. Even if the party refuses them, the troupe will follow them closely, when confronted, they will admit that they\u0027re scared the mercs might come back and finish them off, or some other menace might get them. So, by staying close to the party, they hope things will be scared off. That night, while the party sleeps, the party member(s) on guard will find themselves suddenly attacked with a concerted barrage of mesmerize, charm, sleep, or other mind affecting spells. It turns out that the wandering troupe is actually a traveling group of Were-rats, who do this regularly to adventuring parties, caravans, merc companies, etc. Can the party survive the were-rats treachery? Alternatively, if your players are too suspicious of the troupe, you could change it so they really are a minstrel troupe that has been treated badly by a merc company, and that merc company is coming back that night while the groups are camped to finish the job. Let them get all fearful of the troupe, and then surprise them with the mercs instead."},{"name":"The not-doing-so-well Well","description":" Water coming from the well has become increasingly red, and has picked up a distinctly metallic taste. This, combined with the increasing rates of disappearing villagers has the locals worried"},{"name":"The Holy Grail","description":" Rumors of eternal life have bounced around for as long as anyone can remember. But only recently has a once-great and now exiled theologian posted a reward for it. He even claims to know of its general whereabouts."},{"name":"The boiling sickness","description":" The local miners think they\u0027ve found something dangerous. The further deep they go, the worse the symptoms get. It starts with a rash, and general aches and pains, and moves to internal bleeding of the lungs. Recently, a cave - in was reported, and when the bodies were finally recovered, they were covered in red, swollen boils. Everyone is afraid to return, and some think the source is magical. A local wizard is interested in the truth."},{"name":"The bishop\u0027s ring","description":" A bishop from a long forgotten city has appeared in the history records at a bards college. Legend tells of it\u0027d magnificent beauty, and hints at its magical prowess. It seems that after the bishop received the ring from the \"One True God\", he was able to communicate directly with the diety. An order of paladins wishes to recover the artifact, and will pay a handsome sum to anyone willing to explore the ancient ruins."},{"name":"EDIT:","description":" It seems that on a large, remote, and tropical island, one Lizard folk is in the mood to unite the tribes. He has taken to slave labor, and is currently constructing a pyramid for him to reside inside. The main - landers fear the uniting of the tribe, and want him buried in his tomb as soon as possible."},{"name":"The Mating Somethings","description":" Haphazardly pinned to the inside of the tavern door and seen on their way out is a torn piece of paper asking for help with vermin harassing a local farmstead. \"Could be .. (the pages is smudged heavily here). Paying well for help! They are ruining my fields!\""},{"name":"Godly Gaffe","description":" A priest or priestess had been tasked with guarding a special item until their deity\u0027s chosen one arrived to claim it. Well, the chosen one has finally arrived but the holy guardian has already given the item away, very recently! What could have caused the mix-up? Maybe the false prophet used trickery to gain the guardian\u0027s trust, maybe the guardian was confused/biased, or maybe there are multiple \"chosen ones\". This adventure could end with the party reclaiming the holy item or meeting and recruiting the additional chosen one."},{"name":"Unfortunate hookup","description":" While slightly drunk, one of PC hooks up with some beautiful woman. Next day, he gets an invitation to duel at 7 am in front of the town."},{"name":"Dancing troll","description":" Out of nowhere a wild and dangerous troll appears. But he is only dancing because magic shoes force him to do so."},{"name":"Giant flood","description":" Out of nowhere, giant river springs in the middle of the city, destroying all of it. Local wise man claims only great magic or portal could create such river."},{"name":"Ogre danger","description":" An extraordinary huge ogre destroyed a small village and some nearby farms. But he only wanted to play..."},{"name":"Feed the Beets","description":" While travelling, they hear a call for help from a nearby field of crops. There, a young farmer is being attacked by a Blight. After saving the farmer, she offers the party a visit to a local fairy spring in exchange for helping to find why her crops have gone mad and started biting. This sets up to a fight against a large Blight or evil Treant."},{"name":"Long Live the King","description":" The party encounters a revenant whom they recognize as the recently deceased king, who supposedly died of natural causes. The king\u0027s successor is only a few days away from his coronation ceremony. Something seems to prevent the revenant from revealing the real circumstances of his death."},{"name":"Arcane Wreckage","description":" News of a shipwreck reaches the ears of the party. This ship however was built to house a huge magical weapon and is now available to whoever gets there first."},{"name":"Ribbit Season","description":" A local rare frog breeder has been deliberately poaching wild frogs so that he has a monopoly on the lucrative hallucinogen the frogs sacreet."},{"name":"Snake on a Plain","description":" On a barren plain, a deadly Bone Naga has been terrorizing travelling caravans. They are sick of this snake and so they resort to contracting the party to hunt it down."},{"name":"The Nightman Cometh","description":" Rumours of The Nightman circle the town, saying he is starting a cult on the outskirts of town. The Nightman is a nocturnal monk that said to be a master of martial arts. He has cat like eyes that he uses to peer into people\u0027s dreams, corrupting them, causing a wave of nightmares through the populous. Whether these rumours are factual or not, a cowardly noble has put out a bounty on The Nightman."},{"name":"Forest Grump","description":" In a small forest town, a general store has been burgled by bandits. The vindictive owner now feels powerless, so he decided to train until he is ready to take the down the bandit camp himself. All day he runs through the town, silently, leaving his store closed. The town needs his store to open, but the owner just keeps running."},{"name":"Club for Fighting","description":" In a largish city, the party is invited to a secret, underground Fight Club \"Club for Fighting\" that has recently started up. The only problem is that one member won\u0027t stop bragging to his friends, which is explicitly against the rules. The party is asked to resolve this."},{"name":"Taxing Winds","description":" In a small farming town, the nights have become unseasonably cold and stormy, affecting the crops. The townsfolk point to three white dragonborn sorcerers, who have all only been seen while in the presence of the area\u0027s vicious tax collector."},{"name":"A Demonish Dillema","description":" The soldier in a small castle has been possessed by a demon, and he is told to overtake the castle in the name of said demon. He poisons the ruler and the ruler falls into a coma. The soldier starts recruiting any and all bandits/trouble makers that find their way near the castle, and begins his attack on the castle."},{"name":"An Eye For Trouble","description":" While entering town, the group is accosted by a one-eyed man who asks the adventurers to get his eye back from a wizard who stole it as a spell component for some new spell she was researching. The only problem is that she\u0027s traveling with a company of Mercs, who don\u0027t take kindly to someone troubling their company mage."},{"name":"The Night Unremembered","description":" Awaking sore and disgruntled, the party finds themselves locked away in prison on charges of murder and a number of petty misdemeanors. The penalty for murder is the noose. The party must convince the grizzled old magistrate of their innocence and follow their midnight murderous meanderings to uncover the truth."},{"name":"The Road Less Traveled By","description":" On their adventures, the party stumbles upon a fork in the road. Splitting to the left is a road worn with years of travel to a well known port city. The other path appears brand new and untouched. Mysterious lights flicker in the distance."},{"name":"Murder Most Fowl","description":" A string of killings occurs in the local village. Every morning a body appears in the square horribly mutilated by numerous small blunt objects. Despite attempts to catch the culprit, the town watch reports never seeing the crime happen or having fallen asleep at their post. At the scene of the crime is always a duck with a blood crusted bill."},{"name":"The Roadside Wager","description":" A pair of wealthy looking gentlemen can be seen having a good-natured argument as they travel down the road. Recognizing the party as adventurers, they bid the heroes settle a matter from their own \"wilder youth\". One believes the treasure they sought in a nearby ruin was never there to begin with; the other is sure had they been more skilled in those days they would have prevailed. They are no longer interested in the treasure, but who is right."},{"name":"Chained Green","description":" Near a farm at the outskirts of town, the heroes encounter a single emaciated goblin. The pitiful creature is clad in a single rag, and the lash marks it bears tell of its time as a slave. The goblin and its tribe have been conquered and enslaved by the local village. The newfound peace and extra workforce is allowing the settlement to boom."},{"name":"Strange Customs","description":" After a very merry night with some traveling gypsies, the party awakens to find that according to some vague tradition, they have adopted one of the gypsies. It is now their responsibility to take them into the wastes as part of their coming of age ceremony."},{"name":"At A Loss For Legacy","description":" The only local ruling families to ever keep their hold on the throne had heroic bloodlines. The baron and his wife have the wealth, political skill, and connections, but not a drop of heroic blood. It is a well known rumor that any adventurer who can gather some fame with their exploits will spend time in the lap of luxury as a court concubine. Then again, I did only say the baron\u0027s family seeks to add heroic blood, didn\u0027t I..."},{"name":"Golden Years, Golden Child","description":" A man near crippled by old age begs for your help. He tells a story of how he was a chosen sacrifice and his youth was stolen. If the ones who did this were dealt with, he would become a child again. At least he thinks so. See, the problem is even magically aged old men have trouble remembering things, and now this chosen one isn\u0027t that sure on the details..."},{"name":"Not Quite Special Someone","description":" You\u0027ve just finished looting adventuring in that old crypt when you are approached with a reward you were most definitely not expecting; an arranged marriage. Turns out that old king had a habit of speaking in metaphor and a court wizard who took things literally. \"A commoner will marry into this family when he pries the rings from my cold dead hands!\""},{"name":"Balance","description":" Rumors abound, whispering of one rising in infamy just as quickly as your own glory grows. They appear to be your opposite in nearly every way; tactically, morally, physically, only the same in power. Is it coincidence, or prophecy? Whatever it is, this antithesis of yours seems to be drawing closer."},{"name":"Resurrection gone bad","description":" First post wasn\u0027t on topic, so I\u0027m back for more: Of course, not all resurrections are made equal. Sometimes the plant reagents have gone bad, or the wrong ones were picked. Sometimes the person had been dead for too long. And sometimes, like this time for instance, part of the characters soul was invaded by a parasite upon reentry into the physical world. Slowly, she loses the spark of life. She can still move, still talk, and is as strong as ever, but her voice has gone flat and her appetite has disappeared. At first you thought it was some sort of depression, but then last night happened. Out of the blue, her magic stopped working. The high counsel of wizards suggest you kill her again, and capture the soul as it leaves her body. This way, you can separate host from parasite, but of course, this is a dangerous, and risky process. And hasn\u0027t been tried for many centuries. Books will need to be dug up from ancient tombs, and long lost reagents found. This\u0027ll be a long one, but your characters very soul is at stake. Better act fast before there\u0027s nothing left!"},{"name":"What happens when you revive a human sacrifice?","description":" Well, it turns out it depends on the diety. Some are more than happy to oblige, but others, the darker gods, want to keep what\u0027s theirs. And they punish those who would try to steal from them. And this one happens to do so by raising the dead. If you can take what\u0027s his, he can take what\u0027s yours."},{"name":"The Chosen One?","description":" Since birth, you were told you were the chosen one. The ultimate mover and shaker of the centuries. Only - now you\u0027ve lost your one-ness. It seems that you\u0027ve been possessed, and this creature, this seed, this thing inside of your mind, digging and burying itself further inside of your consciousness, thinks that you\u0027re not the chosen one. It is. You find yourself acting in your sleep, unable to remember what you\u0027ve done. Sometimes it takes over during the day, and you can\u0027t come close to fighting its power. It acts in ways you would never imagine, and seems to be planning something against your will. It pushes you to accept quests, and reject others. All with one thing in common: blood magic."},{"name":"To bring him back? Or just make another?","description":" Resurrections aren\u0027t easy you know. They\u0027re expensive, and a time consuming process. And it doesn\u0027t always work. But you\u0027ve heard tell of a cheaper way, Cloning. A wild outcast of a tinkering gnome thinks he\u0027s found a way to clone living tissue. All he needs is a spell which will extract the memories from a living being. Such a shame that the only wizard who knows of such things is evil, and living at the top of a tower a long, long way south."},{"name":"But really, what\u0027s the difference between necromancy and resurrection?","description":" That\u0027s what Elbert asked himself while studying his ancient tombs over 40 years ago. \"Isn\u0027t necromancy giving life to what is already dead? And shouldn\u0027t they do what I bid? I was the one giving them life. I was the one who put purpose back into their cold and rotting corpses. It\u0027s a small cost to pay, and I\u0027ll free them eventually! All I have to do is find a way...\" Or so he told himself. 40 years later, and he\u0027s hidden himself away in the catacombs, surrounded by the dead, and all alone. He believes that he can fracture the soul of a living person, and give it to the undead. Little does he know, he\u0027s making a lich that MUST be stopped."},{"name":"Robbed, then Framed","description":" Inside a busy town, the party is robbed by a passing vandal. Following a small chase scene, detailed with the typical cart dodging and stall vaulting, the party will catch the thief in some dead end alleyway. Palms up, swearing no trickery, the thief will return the party\u0027s stolen belongings. The thief will also helpfully forfeit some of his other stolen wares as well. Returning to the market place, a well armed group of guards will stop our merry band of adventurers. \"In the King\u0027s name, your are charged with breaking into the high vault of the Royal Treasury. Stand down, criminal scum, and accept your punishment - death!\""},{"name":"Royal Getaway","description":" The Prince/Princess has never left the extent of his/her kingdom, and is interested in learning about the faraway lands detailed in his/her history books. Of course, the King and Queen hardly want to see their precious child runaway into certain danger. The Royal Child is offering an ample sum for the party to take the prince/princess as an additional member of the party. Be warned, however, should the Child encounter any danger and not return unharmed, the wrath of the Kingdom will fall against our fair adventurers."},{"name":"Pirate Band","description":" Sailing throughout the Seven Seas, there lies pirate band, pillaging all that they please. The watch has been called, a bounty is set, the whole kingdom moves to oppose threat. Yet, fair adventures, know this to be true! Beware of their captain, else he\u0027ll run you through! A bard of wicked rhythm, a rapscallion musician; He\u0027ll crush any pirate hunter\u0027s foolish ambition!"},{"name":"A Funny Thing Happened on the Quay by the Forum","description":" A merchant from a distant city has arrived, swathed in acres of silk, and has managed to simultaneously undercut and outprofit nearly every fishmonger on the quay, seemingly overnight. No self-respecting angler will admit to selling fish to the foreigner, and the local guild is considering artificially inflating the price of seafood so that other merchants can compete. More troubling, several of the waterfront\u0027s resident urchins/couriers/pickpockets have gone missing, and reports of dark shapes in the water have caused the watch to establish ban on swimming."},{"name":"All\u0027s Quiet on the Warlock Front","description":" The sudden reappearance of the Warlock Prince after almost twenty years abroad has the arcane networks abuzz, and hedge wizards, hermit sorcerers and socialite bards alike have been invited to attend the ceremonial recrowning. Conspicuously left out? Your (wizard/warlock/sorcerer/bard/cleric)."},{"name":"Ravenloft and Greyhawk are Dead","description":" Simultaneously, every creature in every facet of existence hears the same plea - \"The Planes are Dying! Woe! The Planes are Dying!\" - followed by an empathetic barrage of every emotion conceivable. It\u0027s over almost before it started, and only a select few are able to stop gibbering for long enough to parse the meaning of the message."},{"name":"A song to follow","description":" After a long day on the road, the party settles in a small, lively inn. As soon as the party\u0027s bard starts playing (or, if the party lacks one, the local fiddler), a beautiful, yet eerie woman starts singing strange lyrics to the melody that describe a way through the local country side to an abandoned house and end with the words: \"Party Face\u0027s Name found the lone hound\u0027s hall / and recognized it well / and by the very last breath\u0027s call / they ended the demon\u0027s spell\". The mysterious singer cannot remember anything, but will repeat the words when the tune is played again."},{"name":"The Cursed Coin","description":" In the middle of the path ahead of the party lays the body of an old man, with a large gold coin clutched in his cold hand. At first glance he seems dead, but once any one of the adventurer\u0027s touches the gold coin, he rises into the air with glowing green eyes, as the coin fuses with the palm of their hand. A booming voice emanates from the old man and informs them that they are now cursed to carry the Coin of Mammon (Demon of Greed) until they too die. With this the old man crumples to the ground in a heap. On further inspection of the old man, a map is found, the destination of which merely says \"Mammon\"...."},{"name":"The Thirsty River","description":" A mother and child rest at the side of the road suckling on sweat soaked bandanas. When they see the adventurer\u0027s they ask for water and tell them about a curse that\u0027s been laid on the town just up the road. The river flows with fresh water but when the water enters a person\u0027s mouth it turns to sand. A local coven has cursed the town for breaking a deal with them."},{"name":"Mirror Image","description":" A covered mirror, found the by the party, turns out to be magic. It shows a glimpse of the future (based on the character\u0027s background) by altering the appearance of whatever is reflected in the mirror (this can be the appearance of the character including physical features or clothing/equipment, or the surrounding location). Characters roll a d20 to determine how good or bad what they see is (the lower the roll, the worse, and the higher, the better). At the end of their vision, a second d20 is rolled to determine if something they saw (such as a scar, wound, armor, or location effect like a building behind them being on fire) is permanent in the real world (10 or lower, something is permanent, 5 or lower ensures it is something bad, a critical 1 requires it to be a serious injury, and a critical 20 provides a powerful boon). One character sees a vision of himself shattering the mirror. Any attempt to shatter the mirror fails - it cannot be broken by any standard means."},{"name":"A Kitchen Nightmare","description":" The city is abuzz, as word has spread that a great and world famous chef, Riordan Gamsy, has come to the city and will be cooking a meal for the king. But, in order to cook this exquisite meal, he will need exclusive and rare ingredients procured for him, and sure enough the kingdom hires the PCs to acquire said ingredients. The list is full of hard to obtain ingredients, such as a moss that only grows on the bodies of zombies, and the meat of a Bullette, etc., you get the point. But, after gathering all these ingredients, and bring them to Chef Gamsy, he has to admit to the PCs that he doesn\u0027t actually know how to cook very well. He\u0027s a con man who just kind of stumbled into this gig of being a world famous chef. He makes lists of ingredients that he knows no one in their right mind would ever gather, and lives off the generosity of the king/queen/etc. while waiting for the ingredients to be procured, and then when they fail to procure the ingredients, he gets huffy, says he will not compromise his art, and then moves off to the next kingdom. No one has ever been able to get all the ingredients before, and he doesn\u0027t know what to do now, as this lord will actually be expecting him to create a mind-blowing meal with the ingredients the party has gotten. First he\u0027ll beg the party for help, but if they refuse he\u0027ll threaten the party, saying that if they don\u0027t help them with his situation he\u0027ll tell the lord that they were in on the scam as well, and they\u0027ll all go to the chopping block together. What does the party do?"},{"name":"Friend of the Family","description":" A stranger comes-a-calling, and requests to speak with the PC\u0027s late great relative of some kind. PC explains that relative has been dead but you recall hearing stories of Aunt/Uncle stranger name, yet they look as though they haven\u0027t aged a day. The stranger is struck with WoE for with as many years they\u0027ve spent on this plane, they often forget the passing of time. (Family Friend is either Revenant/Vampire/Lich...etc.) They came to call upon your deceased relative because they require aid. Perhaps the PC will be willing to answer the call?"},{"name":"Lost Heir(s) to the Throne","description":" Old King Zac has no trueborn children. So when he dies, agents of the kind arrive in your far-flung village, and reveals that you are in fact the long-lost bastard son of the king! However, the old king got around. There are dozens of other bastards, of all ages and races, half-orc, half-elf, tiefling, aasimar, oread, undine, plain old human, dhampir, on and on. The king\u0027s ministers declare that all of his heirs shall vote to choose the heir to the kingdom from amongst themselves. A vote shall be held at the end of each day, until one heir holds a plurality of votes. Murder of your half-children disqualifies you on the spot. Go! Compete with your half-siblings for the ultimate power in the kingdom! The king\u0027s will demands it!"},{"name":"The Roadmage","description":" A mage covered deep in cloaks and his two guards ride up to the party while they travel and ask if they can join until [name city]. He does not want to pay or anything and will ride in silence behind the party, even his guards seem very silent."},{"name":"The Noble Bullies","description":" Every peasant parts way as this group of three nobleman\u0027s sons walk through with their personal guards. A young street kid does not see them in time and falls to the ground when he runs into the middle one. This nobleman\u0027s son immediately challenges him to a duel and one of the others throws him a rapier, when he picks it up it is clear that he never used one. The guards turn away and form a haphazard circle."},{"name":"Mushroom harvesters","description":" Early in the morning in this small hamlet the party wakes up from hush voices and the sound of rolling barrels. When looking out from the barn where they stay they see a small squad of goblins rolling in barrels into the towns center. When given time people from the houses come outside and walk up to them like it is no big deal and trade freshly found forest mushrooms for jugs of milk and pieces of woven cloth."},{"name":"The drunken troll","description":" When walking upon an off-road stone bridge between villages sits and old troll, he is singing and is drinking from a barrel. When the party comes close he demands wine and ale for the crossing. He seems very sensitive about the state of his bridge, he thinks it is beautiful."},{"name":"The best salesman","description":" A street merchant stumbles up to strangers and asks if they want to buy special medicines, potions and charms. When you even listen for a moment he will lock onto you and start to sell you random stuff, he is very charming but a bit to up-close for comfort. It is like he is using magic to compel you to buy buy buy...."},{"name":"A small mistake","description":" When walking through a crowded city street two large men left up the smallest party member under the armpits a few inches of the ground and without hesitation move through the crowd towards an alley. A shady figure is waiting there, is there some kind of mistake or is this a blast from the past?"},{"name":"Lives at Stake","description":" In a small hamlet they players encounter a very helpful man, they are allowed to sleep in his barn for the night. But have to promise that whatever they do they do not come in his house. When (yes, I said when and not if) they do they notice a woman, clearly his wife. Thing is, she has a wooden stake through the lower part of her neck, it looks painful and she can not fully turn her neck. Anyone ever heard of a Pointanak?"},{"name":"A Sword\u0027s Mind","description":" It is your normal Ogre hunt job, you get told where and when it will be anywhere and your job is to poke enough holes in it to make it stop moving. You never expected these enormous pit traps and the ambush when he jumps forward with to much grace, swimming with a large part of a tree trunk. But what is that, glistening inside this enormous wooden beam, a sword deeply embedded shining like the day it was made."},{"name":"Beauty hides Betrayal","description":" Travelling through a thick forest, it starts to get dark but open spaces are rare. But the party stumbles upon one, a large rotten tree flattened against the forest floor, overgrown with purple flowers and surrounded by a few meters of open space. The smell of the flowers is insane, insanely hallucinative. When paying attention old remains of animals litter the underground, turned to fertilizer...."},{"name":"The Beggar","description":" An old homeless man approaches the party looking for some spare food/change. If the party takes pity on him, he reveals himself to be a wizard that has fallen on hard times and grants them some kind of magical benefit for a short period. If they dismiss him, or act harshly toward them, he curses them, turning their (entire party or just particularly cruel characters) tongues to stone before vanishing, making it so those players can no longer communicate with words. The party must then find him to remove the curse."},{"name":"The Macabre Potter","description":" Travelers, indigents, and thugs have been disappearing from the village recently. At the same time, a local potter is gaining fame for the unearthly red glaze he manages to get on his pots..."},{"name":"Gambit Pileup","description":" The PCs are hired to infiltrate a nobleman\u0027s party. Unbeknownst to them, at least four other groups of adventurers are hired to crash the same party, each after a different goal."},{"name":"Really Low Level","description":" The PCs are hired to clean a local magical fixture. Normally this job would be beneath an adventurer\u0027s guild, but there are just so many adventurers these days."},{"name":"Evil Has A Place","description":" Representatives of several evil cults, religions, and social groups are protesting and campaigning for the king to grant them equal status to all the good and neutral gods, religions, and social groups, claiming that Alignment is Not A Choice and since their gods are just as real as Good Gods, they deserve equal representation. The PCs are hired to guard one of their rallies."},{"name":"Almost Magical Goods","description":" A local merchant approaches the PCs to help him out. He swears that someone has replaced his magical goods with \"almost equivalent\" versions - a bag of \"sort-of\" holding, a belt of somewhat useful items, potions of temporary healing, etc. The city merchant\u0027s guild is threatening to put him out of business for swindling customers, but he swears he\u0027s being set up."},{"name":"Death and Hexes","description":" An eccentric wizard dies and leaves behind his tower. He has no heirs and no will, and the city wants to claim the property and auction the contents of his tower. However, the wizard was a bit of a hoarder, and the contents of the tower are starting to interact with each other. The city guards refused to go near the place after the front garden sprouted tentacles and started attacking."},{"name":"Don\u0027t Drug the Sorcerer","description":" After drinking a spiked beverage, a powerful wild mage has unwittingly trapped a small village in a nightmarish dreamscape of hallucinations and figments of his drugged imagination."},{"name":"One Man\u0027s Curse","description":" The PCs help remove a simple curse from a tormented young man. A lecherous (and powerful) Countess disapproves of their actions - the young man was cursed to be the World\u0027s Greatest Lover and the Countess had just found out about that..."},{"name":"Old Traditions","description":" A small town has a tradition of cutting a young maiden open, staking her intestine to a tree, and having her walk all the way around it. Supposedly this tradition placates some ancient beast who used to terrorize the town centuries ago. This year, it\u0027s the bar maid at a tavern the PCs frequent."},{"name":"One for One","description":" People are dying under mysterious circumstances in the capital city, and the healers \u0026 clerics can seem to find no cause for their deaths, as the victims just drop over dead for no apparent reason. Of course, what the town doesn\u0027t know, and the PCs are going to have to find out, is that an evil Lord has found a way using dark magic to resurrect the dead, but the cost is the life of another in the area. This Lord is currently busy in the catacombs underneath the city, using the dark magics to raise an army of the evilest, vilest, most loathsome individuals interred there, to help him take the capital, and the kingdom, and in the process he\u0027s killing the victims in the city above as collateral damage."},{"name":"The Dead Spider","description":" A famous retired spy-master has been murdered by a gang of apparently random bandits, and his famous amulet of scrying is gone. Track them down to their camp, fight them down and take the amulet back to its rightful owners! Or just hold on to it."},{"name":"The Celebration","description":" The party has been invited to a local celebration! Dress to impress, and be prepared for drinking, horseback riding, archery, and combat competitions"},{"name":"The Abduction","description":" A local\u0027s daughter has been kidnapped by the denizens of a nearby area. Recover her before hope is lost"},{"name":"The Ritual","description":" Cultists have been gathering materials and setting up a sacrificial altar. Apprehend them before their evil plot unfolds"},{"name":"Stolen Valor","description":" A beggar comes up to you on the street. He claims that he is actually a well-known local hero, and he has been replaced by a witch who cast a terrible curse upon him"},{"name":"The Treasure Hoard","description":" Word has spread that the guardian of a vast treasure hoard has been slain. Do you have what it takes to claim it for yourself?"},{"name":"The Mummy","description":" As you crest the sand dune, you see a small pyramid below. The doors are completely sealed by some magic, but the symbols on either side of the door are vaguely familiar. You remember seeing them on the tomb of a mummy on display at your local museum, perhaps that old pile of rags and bones knows how to get in?"},{"name":"The life tree","description":" An elf with tousled hair and leaves hanging from his strange armor jumps at you from out of nowhere. He thrusts a small, frail looking, potted plant into your hands and says \"You must be the one I was supposed to meet, here take it! Remember to only plant it at the right place under the right conditions, and hurry or the world won\u0027t live to see another summer!\" He then turns into an eagle and soars away, leaving you with the little potted tree."},{"name":"The Werewolf","description":" You come upon a town that looks like it has been attacked by savage beasts. The townsfolk tell you of a Werewolf that has managed to kill all the Alpha wolves in the forest and now has all the wolves following him. With 20-40 wolves under his command this Werewolf commands them like an army."},{"name":"An attempt on the King","description":" The king was attacked from afar with an arrow. Thankfully one of his men jumped in front of the arrow and saved the king. Upon inspecting the arrow the kings men tell you that the arrow is dwarf made, but the feathers come from a rooster. You heard earlier that a shipment of arrow shafts and heads got stolen from the Dwarfs and there is a town nearby called Roost where everyone is a chicken farmer. There they can find a man called the cockslayer who slaughters old roosters. He must have supplied the attacker or attackers with the feathers for their arrows."},{"name":"The Vampire","description":" He does tell you that all the victims have been seen attending the noble parties of the Blackbriar history society."},{"name":"The drug crazed dragon","description":" Two dragons have been known to slumber in the ruins of an ancient city for a long time. Aztorkin or Venom, the Green Dragon has been breathing his toxic fumes into the old sewers of the city for many years, to make sure no one can attack him from below. Kartharnix or Acid, the Black Dragon has slumbered for long on the other side of the ruined city. He has many slaves under his command which he sends into the sewers to mine the green hardened resin of Venoms toxic breath. Acid has figured out that when he slowly melts the resin with his acid it creates a vapor that fills him with ecstasy. However recently Acid learned that his neighbour Venom had been slain some years ago, and when his slaves informed him there was no more resin to mine, the dragon went insane. Supposedly he now tears the city apart frothing at the mouth, melting stone and steel in search of his fix. Soon he will direct his anger elsewhere, if he is not stopped."},{"name":"The Swamp Thing","description":" A recent flood seems to have had an effect on the swamp surrounding the local lighthouse. The lighthouse keeper has filed complaints that the Bullywugs living in the swamp have gone from their usual bumbling selves to an organized terrorist group! Something must have washed up in the swamp during the flood that has the bullywugs organized. The lighthouse keeper warns that if they are not stopped they might become a serious threat."},{"name":"Dr. Fenkerstin\u0027s Monster","description":" You find an ancient coin that looks nothing like you have seen before. It\u0027s dated more than 600 years ago, and instead of bearing only the crest of the royal family on the back, it has an emblem with the royal families crest and 3 other crests from families you do not know. A lot of things have gone missing near the old Gnome wizards house. Not a lot of people go near it since the old gnome was found mauled to death in his laboratory. Not that people went near it when he was alive either. However a woman nearby has had all her threads and needles stolen repeatedly. Another woman reported her wedding dress missing. A few people have gone missing too and there have been reports of weird noises around the old house."},{"name":"The Spectral Inn","description":" You are starving and parched from long travel without nourishment. Walking into the first tavern building you see, you notice immediately how empty it is, and the innkeeper greets you enthusiastically, talking your ear off about a story you never asked for. As he gives you food and some time passes, you notice the wood slowly warps, cobwebs appear in the corners, and light dust has made its way onto the surfaces. As you finish your meal and make your way out, you find that the innkeeper is nowhere to be found, the doorway is boarded up, and the inn appears older than your grandfather\u0027s grandfather."},{"name":"Something in the Woods","description":" A logging camp has been abandoned by its work crew, who refuse to go back to collect their equipment, or even personal belongings left behind. None of the loggers can tell you why, beyond an overwhelming feeling of terror."},{"name":"Strange Beggars","description":" An entire tribe of goblins has set up camp immediately outside town. They\u0027re not attacking, they need your help."},{"name":"Lost Dog","description":" A small child asks your assistance in locating her missing pet. His name is Spot. His description sounds suspiciously like a gnoll."},{"name":"Missing Persons","description":" Twice in as many weeks, shepherds tending the flocks have gone missing in the night. None of the sheep are gone, and there are no signs of violence. The only footprints, those of the missing herders and the sheep themselves."},{"name":"Firestarter","description":" Someone in town has taken up arson as a hobby. So far, it\u0027s only been empty buildings, and nobody\u0027s been hurt. The mayor feels it\u0027s only a matter of time before that changes, and his guards are making no headway in their investigation."},{"name":"The 11th Plague: Wyrmlings","description":" A pair of amorous chromatic dragons have moved into the area, and they\u0027ve been breeding absolutely everywhere. The PC\u0027s castle/town/blueberry farm is being overrun with a swarm of dragon wyrmlings, which must be stamped out quickly lest anyone grow up. A local Cleric of Bahamut proclaims the end of days if the infestation is not stopped, and approaches the party and tasks them with ending the plague. \"Thou hath been chosen by Bahamut to commit wyrmling genocide\"."},{"name":"\"I AM ANNOYED WITH YOU! TAKE SPEAR AND PROVE LOYALTY TO ME! I WILL NOT MISS AGAIN!\"","description":" One day, a masterwork spear made entirely of iron is seemingly thrown from the sky, causing a small earthquake as it strikes the ground at the feet of the party half-orc."},{"name":"The Pretender Ressurected","description":" The Queen is a tyrannical douche, having assassinated her way to the throne and murdered the rightful heir to the throne, her much more benevolent brother. A good-hearted necromancer has ressurected her brother, turning him into an intelligent undead creature not unlike a death knight, who desires to retake his rightful kingdom and end the rule of the tyrant Queen. Despite his zombie-like appearance, his benevolent attitude has earned him the favor of the (less conservative) peasantry."},{"name":"Leaving Shore","description":" One of the merchant ships in the dock is long overdue on it\u0027s berth fees. Nobody has seen the skipper in weeks but he declared a lot of valuables when he arrived at the city. Now that you mention it, nobody has gone onto his ship to see if he\u0027s there..."},{"name":"Lake Placid-iosaurus","description":" In the town besides the lake, local cattle have been mysteriously disappearing. The stories of a monster in the deeps were only campfire tales to frighten children... or were they?"},{"name":"Do not return to warehouse once lit","description":" Last week a successful business shut it\u0027s doors, leaving hundreds of locals out of work. The owner hasn\u0027t been seen since, but those who live nearby have reported a higher than usual number of explosions coming from the \"abandoned\" warehouse."},{"name":"Missing Ships","description":" The party is hired to figure out why ships are going missing at sea. Little do they know, the pirates have a deal with the keeper of the tavern they just entered; the innkeeper drugs strangers\u0027 drinks and the pirates collect them at night. The party wakes up shanghaied on the very ship responsible for the disappearances."},{"name":"It Belongs in a Museum","description":" The party is tracked by an archaeologist, who claims one of the PC\u0027s family heirloom is actually a priceless artifact from a long lost culture, and that the PC\u0027s parent/grandparent/etc must\u0027ve been one of the thieves who robbed a famous excavation site decades ago."},{"name":"Mama\u0027s Baby, Papa\u0027s Maybe","description":" For generations, a dragon has been harassing a province. Twenty years ago, oracles prophesied a child would be born from the convergence of two noble houses who would then grow up to vanquish the evil. The party encounters the child of prophecy, now an adult warrior, in a tavern, drunk and despairing. He only now discovered his mother was having an affair when he was conceived. If his father isn\u0027t the one from the chosen bloodline, he\u0027s sure he will die trying to fulfill the prophecy, yet everyone is counting on him."},{"name":"Quest of Self-Discovery, My Ass","description":" A hero has vanquished a great demon that plagued a kingdom. When no reward was offered, the hero began plotting the demon\u0027s resurrection out of spite."},{"name":"Dragon Blood","description":" One of your companions has been slain by a boar. You know of a druid powerful druid who might know how to reincarnate the unlucky bard. However, this comes at a price. Sacrificing the dragon wyrmling you just befriended."},{"name":"Giant\u0027s Lottery","description":" Each year, the village of Bleakhill holds a lottery to select a volunteer. This year, you\u0027re the lucky one! With a select few of your choosing, you must go up the hill and try to defeat the Hill Giant that has been living there for over a century."},{"name":"Drowned God","description":" In a freak boating accident, you drowned. The local sea god, Uarus, offers to undo the drowning. Of course, there is a catch. You must bring his love letter to Kiaris, the goddess of a nearby river."},{"name":"The Savior","description":" After defeating the gelatinous cube, you pry open the heavy doors to the temple. In the dim light of your torch, you see the hallway is lined with statues. They seem strangely familiar, and upon closer inspection you see the statues resemble you in an uncanny way. Slowly, coffins open and zombies with a pale blue skin come forth, bowing down and calling you savior. You notice your skin begins to turn blue as well."},{"name":"Adventurers Wanted","description":" The party arrives at a distant temple converted to a new adventurers guild, but upon touching the door a powerful spell knocks them all unconscious. The party wakes up in dungeon cells, now realising that the advertised guild was really a trap."},{"name":"Three Powers","description":" A kingdom is in an unending war with the powerful neighbouring hobgoblins. A necromancer and his cult has been murdering and reanimating hundreds of human villages and towns, making an army of undead. His reason? To bring the fight to the hobgoblins."},{"name":"Safe Harbor","description":" Local waters have become too polluted with runoff and sewage for fishing. The local fishing crews have attempted moving their operation, but something lurks in the waters beyond the bay. Any that survive return with tall tales of tentacled horrors of the deep."},{"name":"The Tricky Trade","description":" The trade winds near a port city have become especially fickle as of late, and the local fishermen and navy have lost a good deal of ships. What few survivors there are return with news of a great whistling noise and a mirage-like island appearing just before the winds swept their boat to crash upon a reef or rocky shoal."},{"name":"The Lone Courier","description":" Your players while out on the road find an overturned a cart. The horse in the field nearby and the dead body on the ground imply that he was attacked by bandits who pillaged the aforementioned cart. Upon checking the cart they discover an important letter in need of delivery to a towns nearby mayor."},{"name":"The Champion\u0027s Call","description":" The heroes are drinking in the tavern when a servant slips them a letter requesting their presence at \u003ctown official\u0027s place of business\u003e. When they arrive he believes that someone is planning a devious plot at the upcoming banquet he\u0027s going to be throwing, and he wants the party there to disrupt whatever plot his rival factions may be planning"},{"name":"Falling Stars","description":" A vast swathe of stars has disappeared from the sky. Soon after, monsters begin terrorizing the kingdom. Monsters that correspond to the constellations that disappeared. What caused them to fall? How can they be returned?"},{"name":"Planebreaker","description":" Over the past several months, many planar disturbances have been logged. Analysis suggests planar shockwaves emanating from the Elemental Plane of Water. One night, a Sahuagin army attacks the site of a large magical focusing crystal. The leader raises his trident towards the crystal, and a beam of light shoots into the sky. The sky seems to begin filling with water..."},{"name":"Thief","description":" A haunted house has appeared near a small village. The ghost inside is wailing about a thief who stole a powerful magical staff from her basement tomb."},{"name":"Invasion of Spiders","description":" The party meets a settlement of Dwarves, but strangely, they are living on the surface rather than underground. An army of Drow drove them from their home."},{"name":"The Lost Tomb","description":" While traversing a desert, the sand underneath the party begins to swirl. They get sucked into an underground tomb carved from sandstone."},{"name":"The Contract","description":" The party has been contracted by a local lord to take care of a rogue warrior who has been raiding his army encampments. The twist: When the party tracks him down, they discover their foe is, in fact, a Paladin of Freedom."},{"name":"Frozen Wastelands","description":" A snowstorm has been raging for months, seemingly centered on a certain mountain."},{"name":"Shades of the Past","description":" A misfired planar experiment sends the PCs through the Elemental Plane of Time, where they visit significant moments from their own backstories. Alternately: A powerful wizard uses divination and illusion magic to recreate key moments of the PC\u0027s backstories and attempts to use them to break them mentally."},{"name":"Can\u0027t Stop the Roc","description":" A Roc steals the caravan you are travelling with."},{"name":"Summons (1d10)","description":" \u003col\u003e\n \u003cli\u003eSummons by a King\u003c/li\u003e\n \u003cli\u003eSummons by a Queen\u003c/li\u003e\n \u003cli\u003eSummons by a Jester?\u003c/li\u003e\n \u003cli\u003eSummons from a prominent adventurers guild.\u003c/li\u003e\n \u003cli\u003eSummons from a rich corporation asking for mercenary support\u003c/li\u003e\n \u003cli\u003eSummons from an old man.\u003c/li\u003e\n \u003cli\u003eSummons from a high priest\u003c/li\u003e\n \u003cli\u003eSummons from a legitimate heir to a throne\u003c/li\u003e\n \u003cli\u003eSummons from an old and experienced adventurer\u003c/li\u003e\n \u003cli\u003eSummons from a suspicious hag or witch.\u003c/li\u003e\n"},{"name":"God-King","description":" An aspect of a god takes the throne of a small kingdom near the one you are currently in."},{"name":"Sweet Thief!","description":" A thief is stealing all sweet pastries from bakeries around the city."},{"name":"How did you know they were knights? Because they wore armor.","description":" Two knights quarrel in the street over a mundane matter, Looks like it could get ugly."},{"name":"Sickness in the court","description":" A king or other ruling figure grows mortally ill."},{"name":"Werewolf Chronicles (1d12)","description":" \u003col\u003e\n \u003cli\u003eThe circus is coming to town!\u003c/li\u003e\n \u003cli\u003eThe circus performers are all werewolves.\u003c/li\u003e\n \u003cli\u003eThe town guard is sent to investigate odd reports at the circus\u003c/li\u003e\n \u003cli\u003eThe town guard are werewolves.\u003c/li\u003e\n \u003cli\u003eAn adventuring party investigates the town guard\u003c/li\u003e\n \u003cli\u003eAn adventuring party becomes werewolves\u003c/li\u003e\n \u003cli\u003eTalk of Several individual werewolf groups have formed a cult.\u003c/li\u003e\n \u003cli\u003eA cult of werewolves gain power over a local government system\u003c/li\u003e\n \u003cli\u003eAn influential cult of werewolves start turning citizens at random, to incite panic.\u003c/li\u003e\n \u003cli\u003eOn a full moon a disproportionate amount of people become werewolves.\u003c/li\u003e\n \u003cli\u003eThe King offers rewards for a cure to the werewolf curse.\u003c/li\u003e\n \u003cli\u003eAll hits of the werewolf curse are despised, people are being hung in the streets.\u003c/li\u003e\n"},{"name":"Hunters Request (1d10)","description":" \u003col\u003e\n \u003cli\u003eA hunter is looking for assistance hunt many small prey\u003c/li\u003e\n \u003cli\u003eA hunter is looking for assistance with a rare creature\u003c/li\u003e\n \u003cli\u003eA hunter is looking for assistance with a dangerous creature\u003c/li\u003e\n \u003cli\u003eA hunter is looking for assistance hunting a unique creature\u003c/li\u003e\n \u003cli\u003eA hunter is looking for assistance obtaining a rare creatures egg/offspring.\u003c/li\u003e\n \u003cli\u003eA dragon-slayer would like information on local dragons.\u003c/li\u003e\n \u003cli\u003eA jolly man invites you fishing.\u003c/li\u003e\n \u003cli\u003eA talking snake wishes for you to bring him several moon rats to eat.\u003c/li\u003e\n \u003cli\u003eA creature that is undocumented has been spotted to the west.\u003c/li\u003e\n \u003cli\u003eAn extremely rare creature was spotted just outside town.\u003c/li\u003e\n"},{"name":"Shifts in Power (1d8)","description":" \u003col\u003e\n \u003cli\u003eA child is born to a powerful family.\u003c/li\u003e\n \u003cli\u003eA child is born to a powerful family with a notable irregularity.\u003c/li\u003e\n \u003cli\u003eA new god is born.\u003c/li\u003e\n \u003cli\u003eAn old god dies.\u003c/li\u003e\n \u003cli\u003eA gods power hierarchy shifts.\u003c/li\u003e\n \u003cli\u003eA known NPC is assassinated, the party receives word of this.\u003c/li\u003e\n \u003cli\u003eAn impoverished NPC has been appointed as a baron, and wishes to throw a party for the party.\u003c/li\u003e\n \u003cli\u003eQuestionable individuals of the town guard are unhappy with its management and want a reform.\u003c/li\u003e\n"},{"name":"Magical Mischief (1d8)","description":" \u003col\u003e\n \u003cli\u003eA wizard has been casting powerful magic as training. Causing havoc on local wildlife.\u003c/li\u003e\n \u003cli\u003eDruids have been growing trees near a large city, damaging its walls.\u003c/li\u003e\n \u003cli\u003eA prince is attempting to learn magic. Is incredibly inept.\u003c/li\u003e\n \u003cli\u003eThe King has been decreeing odd orders after a voodoo obsessed adviser is appointed.\u003c/li\u003e\n \u003cli\u003eA lich has been raising zombies to do menial labor, locals are uneasy.\u003c/li\u003e\n \u003cli\u003eLocal acolytes want to perform rituals on the locals, the process is very painful.\u003c/li\u003e\n \u003cli\u003eA wizard wants help convincing the townsfolk that his spell is actually a natural phenomena.\u003c/li\u003e\n \u003cli\u003eThe party is called to investigate a mystery.\u003c/li\u003e\n"},{"name":"Authoritarian Revolution (1d6)","description":" \u003col\u003e\n \u003cli\u003eA brothel is hosting a competition for the best lover.\u003c/li\u003e\n \u003cli\u003eSexual relations are outlawed in the city, the people are upset.\u003c/li\u003e\n \u003cli\u003eAlcohol is prohibited in the city. The people are upset.\u003c/li\u003e\n \u003cli\u003eSwearing in public is illegal. The people are upset.\u003c/li\u003e\n \u003cli\u003eMany are murmuring of revolution, any talking about it are quickly quelled.\u003c/li\u003e\n \u003cli\u003eA revolutionary group is meeting in secret, the party is invited.\u003c/li\u003e\n"},{"name":"Magnum Opus","description":" An artist would like help creating their masterpiece, requiring a party of adventures to pose with a killed monster."},{"name":"A killing Joke","description":" An assassin masquerading as a jester has been killing a nobles every 5 days."},{"name":"Plaguestoppers","description":" A disease spreads across the land, the cure is known but difficult to obtain."},{"name":"A Blue moon opening","description":" A difficult to join guild is offering an opening."},{"name":"42","description":" A creature from another plane appears, insults the party, then leaves."},{"name":"Honor in blood","description":" A dying warrior desires death by combat."},{"name":"Gallery of Rouges","description":" Many of the towns undesirables have been banding together, the local authorities want this stopped."},{"name":"Rubber Economy","description":" Demand for rubber has gone through the roof, due to a fashion trend."},{"name":"Free for all","description":" A gem mine collapses suspiciously, and its contents have been declared free for all."},{"name":"Gorgonzola Cheese","description":" A new type of cheese has been developed, Gourmets would like to know if it is poisonous."},{"name":"...And the worlds finest wine","description":" Rich Nobles want rare liquor from around the kingdom for an upcoming party."},{"name":"Gon\u0027 Fishin\u0027","description":" The price of fish is up, now is the time to buy a rod."},{"name":"Don\u0027t tell anyone (1d4)","description":" \u003col\u003e\n \u003cli\u003eA rich man is offering a reward on a “personal” item\u003c/li\u003e\n \u003cli\u003eA rich woman is offering a reward on a “personal” letter.\u003c/li\u003e\n \u003cli\u003eA brothel is offering anyone that can “surprise” on of their workers a reward.\u003c/li\u003e\n \u003cli\u003eA competition for \"best Lover\" is being held.\u003c/li\u003e\n"},{"name":"Itemfinder","description":" A specific treasure is desired, a local wizard is willing to help discern its location."},{"name":"Not the Bees!","description":" A bee keeper is looking for a few new queens."},{"name":"God of colors","description":" Dyes are in demand, due to a new religious craze."},{"name":"A sharp order","description":" A dragon needs somebody to file down its claws."},{"name":"Gift of the gab","description":" Crafting guilds are not cooperating and intermediates can make a lot of money."},{"name":"A hole is a hole","description":" You fall into a pitfall trap, something interesting is at the bottom of it."},{"name":"To train them is my cause","description":" The barracks need strong fighters to help train troops."},{"name":"I don\u0027t remember them","description":" You receive a letter claiming a member of the party is owed inheritance."},{"name":"The Ogre and the Goblins","description":" Recently a nearby town has lost all contact with the outside world. When the PCs go to investigate they discover that an ogre is holding the town hostage and letting no one leave under any circumstance unless unreasonable demand is met. If the PCs set out into the surrounding woods they can find the ogre\u0027s cave. Twist: the ogre doesn\u0027t want to do this and has been tricked into terrorizing the town by some goblins who want the town for nefarious purpose. The ogre will help fight the goblins if the PCs try to win it\u0027s freedom. 2nd Twist: the ogre is actually highly intelligent and is controlling the goblins. He betrays the PCs at a critical moment during the fight."},{"name":"The RC Knight","description":" Upon crossing a bridge, the party encounters a knight dressed in black, challenging them to battle, saying \"None shall pass.\" After the battle begins, every round the party has a chance to notice that the knight is in fact an automaton being controlled by some children hiding in the bushes nearby. Upon being noticed the children have the knight pull the old \"Pay no attention to the man behind the curtain\" bit. \"Your opponent is over here!\", etc."},{"name":"The missing spy","description":" A party member is bumped into on the street by someone unremarkable who simply excuses themselves and keeps walking. They later discover a small letter in one of their pockets. The letter details how a spy that was supposed to be reporting every so often has gone silent, and that they will be rewarded handsomely for their swift and discreet investigation."},{"name":"The Stubbed Toe","description":" One of the members of the party stubs his/her toe. When he or she looks down, they see that they stubbed their toe on another toe! Protruding from the ground is the hard gray foot of a corpse, buried just below the surface."},{"name":"Ghost Busters","description":" There\u0027s something weird in the neighborhood, and it don\u0027t look good. Ghosts have recently been frightening the residents of the neighborhood where the party has been recuperating after their last grand adventure."},{"name":"My Name Is Jonas","description":" While at sea, the PCs ship is attacked by a leviathan. The great beast swallows them whole. There is a large bubble of air in the beast\u0027s belly, but it smells foul, and it won\u0027t last long."},{"name":"Dude, where\u0027s my wagon?","description":" While partying with the PCs at a festival, a wizard and traveling salesman (of potions, wands, scrolls, and more!) can\u0027t figure out what happened to his wagonload of goodies. Will the party help him find it?"},{"name":"The Old King is Dead","description":" The king has died without an heir. Several distant relatives are claiming the crown. The party is cornered by supporters of one of the claimants, will they support their claim? Immediately following this encounter, the party is cornered by supporters of a rival claimant, what did they promise the first one? Blood, intrigue, and/or chaos ensue."},{"name":"The Tempest","description":" The party is shipwrecked on a strange island during a storm. Little do they know that on the island is living one of their former enemies, a sorcerer of terrible power, hell-bent on vengeance."},{"name":"To Know a Bit More","description":" A sister of the Storm King\u0027s temple meets the party in the village. She asks the party to follow a lead on the present whereabouts of her estranged mother in a town far to the South. If they return with news, she is offering to slip the party into the temple complex\u0027s second, secret library to browse the forbidden lore that is held in the texts kept there."},{"name":"The Man in The Hair Piece","description":" It turns out it was actually Bruce Willis the whole time."},{"name":"the smiling figure","description":" In the midst of night the party is arrested and placed in one of 4 cages, each containing 16 people. the cages are surrounding a small clay figure like this one (http://i.imgur.com/3TB3SqI.jpg) they manage to escape yet they are stalked by a shadow. twist time: shadow is the spirit of one of the pc\u0027s that is trying to warn the party that whatever came out of the clay figure is controlling his body"},{"name":"The Cottage","description":" While traveling along the road, the party is caught in a sudden rainstorm. They take shelter in a small abandoned cottage nearby. While they wait out the storm, they discover the cottage is not as abandoned as they thought..."},{"name":"Shaggy Dog","description":" A wizard with a feud with the party turns the party into dogs. They need to find a way to change back"},{"name":"March of the Giants","description":" A host of giants marches towards the city."},{"name":"Royal Matchmaker","description":" The King enlists adventurer\u0027s aid on finding a princess for the prince, who is having trouble approaching the ladies of the court. The King is an old romantic who believes in true love and will not settle for a loveless arranged marriage."},{"name":"Freestyle","description":" More and more youth in the city are being drawn to the bard profession. It has become a popular to engage in duels where the only allowed action is viscious mockery until one side collapses."},{"name":"Monsters Wanted","description":" A local dungeon has become so nice that the monsters are not leaving it to terrorize the villagers, upsetting the local adventurer\u0027s guild who is now out of work."},{"name":"Kittens!","description":" A wizard-in-training\u0027s psudeodragon familiar has recently given birth to a new litter. He can\u0027t keep the baby psuedodragons and hires the party to find a good home for them. He hasn\u0027t quite figured out what the father was, but the baby psuedodragons are exhibiting some strange characteristics"},{"name":"Spitting Fire","description":" Everything in 6ft radius around a Bard catches fire whenever he starts singing."},{"name":"Honor Among Thieves","description":" The party encounters a gang of Djinn trying to rob a master thief of his recent score."},{"name":"The Devil\u0027s Advocate","description":" A Warlock wants to take his patron to court for not fulfilling the terms of their contract. He hires the party as lawyers to defend his case."},{"name":"Evil has a new name","description":" A local necromancer wants the party to help change his image."},{"name":"Waterdeep Nine Nine","description":" The captain of the guard is low on manpower and hires the PCs as temps. They end up working traffic and making routine house calls."},{"name":"Lost!","description":" The party finds a lost dog flyer in the middle of the wilderness. A ranger has lost his wolf companion and is neglecting his watch looking for him. He offers a hefty reward on the poster."},{"name":"When Harry met Saddle","description":" A gypsy has put a curse on the party and they keep falling in love with inanimate objects."},{"name":"Big Green Thumbs","description":" The Dwarf King wants the party (surface dwellers) to build him a garden for his palace"},{"name":"Father and Son","description":" A simulacrum hires the party to help him win his creator\u0027s love."},{"name":"Blood on Their Hands","description":" There is a new fad among the nobility to keep Lycanthropes as pets and slaves. The Emperor wants the party to put a stop to it."},{"name":"Queen\u0027s Gambit","description":" A prince recruits the party to win back his birthright when the widowed queen marries a knight in her service"},{"name":"No Country for Old Elves","description":" An ancient elf recruits the party to help him reconnect with all his old human friends. Turns out they have all been dead for centuries and many are the subjects of the epics sung by bards."},{"name":"The Connection","description":" A master thief has quit the thieves guild. The city guard wants him to give away the guilds secrets, and are willing to offer amnesty in exchange. Meanwhile, competing thieves guilds see him as a valuable asset and are also trying to recruit him and get an edge on the other thieves guilds."},{"name":"The Sealed Sword","description":" Bandits have taken over a local temple and are holding the priests hostage! The leader is trying to attune the sacred weapon kept there to himself."},{"name":"Shadow on the High Seas","description":" The party is hired to guard a merchant ship. A mysterious girl is found stowed away. Cultist Pirates attack soon after attempting to capture the girl. She was a former prisoner and they are trying to get her back."},{"name":"The Devil is a good for nothing bum","description":" It has been a thousand years and according to a prophecy a demon king is supposed to return to the world. But he has grown tired and lazy and hires the party to terrorize the populace in his stead, but requires all the pomp and circumstance expected of the prophecy."},{"name":"Window of Opportunity","description":" The human kingdoms and the orc clans in a joint archaelogical dig have discovered a stone portal to other worlds. The party is hired to explore the worlds through the portal while the orcs and humans play politics in order to control the portal, which they both consider an important military asset."},{"name":"Uncultured","description":" The guard arrest a wealthy half-orc for a gory display of butchered animal and human parts on his front lawn. He argues he was just expressing his cultural heritage but no one knows where the human parts came from."},{"name":"Road to Platinum Plateau","description":" Several dragons got together and decided to award badges to any party of adventurers who can beat them in combat. Having all 8 badges gives the party a chance to meet Bahamut in battle."},{"name":"Metallic Monster Mischief","description":" A band of pixies taking turns casting domination magic have taken control of a copper dragon. No one knows what they\u0027re going to use it for, but it must be big."},{"name":"Line in the Sand","description":" Two Mummy Lords have awoken at the same time and both are laying claim to the kingdom."},{"name":"Mirror, Mirror","description":" One day the party wakes up and finds they have no reflections."},{"name":"Shadow Dancer","description":" A fey thief has stolen the PC\u0027s shadows and is running away with them. The shadows are only too happy to be free and aid the fey in their escape."},{"name":"Hired Muscle","description":" The party is made aware of a Kolyarut is hunting them, although they have no idea what contract they broke"},{"name":"What\u0027s in a name?","description":" Mid level PC\u0027s arrive in a village/city that\u0027s part of a kingdom they\u0027ve spent significant time in only to find that instead of a warm welcome they\u0027re wanted for a crime they didn\u0027t commit. Imposters? Simulacra?!"},{"name":"I stepped on what?!","description":" While travelling through a forest the players are accosted by druids (or elves?) who accuse them of trampling through a sacred grove and destroying it. As restitution they must plant the seed for a new holy tree in a difficult to reach location."},{"name":"Aren\u0027t we supposed to be heroes?","description":" After defeating a group of \u003cinsert marauding villainous types\u003e have a very angry dragon (too powerful for the PC\u0027s to defeat) swoop in on the PC\u0027s and demand that they replace the \u003cmarauding villainous types\u003e and send them on missions to raid caravans/villages/ships etc. Have a riot forcing them into uncomfortable moral, political, and legal situations in service of their dragon overlord."},{"name":"Have at thee!","description":" During a social encounter (ball/banquet/etc) a minor noble approaches one of the PC\u0027s and begins loudly demanding recompense for some perceived slight. He challenges the player to a competition (combat/poetry/song/dance)."},{"name":"Stalker","description":" The PCs get in a fight with a group of bandits who prove to be a little more than the PCs can handle. During the encounter a PC of the DM’s choice is about to be hit by a bandits attack when out of nowhere a masked figure comes out of nowhere to protect him/her. This figure helps the PCs defeat the bandits and then disappears as suddenly as she/he appears. Over the next few weeks the party must occasionally make a DC 15 perception check to notice the figure watching the PC in question from bushes, through tavern windows, etc. This player then starts receiving love letters signed by “Your Secret Admirer.”"},{"name":"”Your Lost Pet”","description":" The PCs wake up in the tavern they were sleeping in to find a very disgruntled displacer beast in their room with a note around its neck that reads “I found your lost pet on my doorstep. It’s been awhile since I’ve studied undercommon but I think he belongs to you. - Grimley the Hill Wizard.” On the displacer beast’s collar is written in undercommon: “This displacer beast is the pet of the drow priestess Melina. His name is fluffy and his favorite food is disobedient dwarven slaves. If found please return to the temple at 132, Arachnid Street in the drow metropolis of Rock Gloom.”"},{"name":"The Prowler","description":" While in a city the PCs notice a number of wanted posters saying “Warning: Masked prowler slaying loyal citizens and raising them as undead.” The posters also have a sketch depicting a figure in a hood and a mask. Various town criers throughout the city can be seen shouting news about him while waving one of these posters. Every 1d10 days the criers will report 1d4 more victims of the the Prowler"},{"name":"Family Reunion","description":" The party runs into a family member of one of the PCs who tells them that a family reunion is being planned."},{"name":"Slash a Mole","description":" The PCs come across a farmer who asks them to get rid of a rabbit infestation that’s running the lettuce crop in exchange for some gold and free lodging. He notes that he has had other adventurers do the same thing but the rabbits keep coming back. If the players help the farmer they eventually find out that the rabbits are undead because the farmer’s daughter is learning necromancy."},{"name":"Stampede","description":" A stampede of carnivorous dinosaurs literally appears out of thin air in a rural area that the PCs are going through and starts devouring wild animals, livestock, and their farmers."},{"name":"Witch Trial","description":" The players come to a small town on a lake. When they enter a local tavern they find a group of townspeople discussing the recent spike in illness, the recent poisoning of a well, along with strange lights on the lake, and other occurrences that make them think there\u0027s a witch in the town. The general topic of conversation is whether or not to try the reclusive herbalist who lives on the other side of the lake as a witch because of it."},{"name":"Cormo’s Elixir","description":" While in a town or city the PCs come pass by a halfling named Cormo selling a miracle elixir that he claims can cure any illness. Turns out that the elixir is simply a weak healing potion cut with brandy. But Cormo claims that he isn’t the one to blame."},{"name":"Larcenous Lycanthrope Lunacy","description":" The city the PCs are currently in has been dealing with a gang of lycanthropes who have been pulling off surprisingly complex heists including bank robbery, stealing exotic spices off of ships, and even stealing the jewelry out of a noblewoman’s bedroom while she was sleeping."},{"name":"Who wants to be a Lycanthrope?","description":" One morning in a town or village a poster is nailed to the door of the town hall that reads “ever want to be a lycanthrope? Ever want to release the beast inside? Well now you can! Simply leave your bedroom window open and leave 150 gold on your nightstand tonight.”"},{"name":"Hey Barkeep!","description":" The barkeep at a local tavern has simply stopped in his tracks behind the bar and is staring off into the distance muttering something about a slaad in the basement."},{"name":"Wraith Hunters","description":" The party gets approached by a group of wraith hunters to destroy a wraith and his specter servants."},{"name":"Grave Robbers","description":" The graveyards are being continually raided by a group of grave robbers. In addition, some of the stolen bodies have been seen wandering the countryside as zombies. The players, upon investigating, find that there are actually two groups of grave robbers: One group of necromancers and a group of paladins, clerics, and other undead hunters trying to keep the bodies out of the hands of the first group."},{"name":"Wyvern Riders","description":" A reclusive tribe of wyvern riding warriors that live in the mountains has been raiding surrounding villages for food."},{"name":"Slayfest","description":" The elves have been having some orc problems as this month is the bi-annual orcish festival of Slayfest. Slayfest is where all the young orcish warriors who have proved themselves over the last two years go out into the elven lands and brazenly challenge elven warriors to one on one combat with the hope of becoming eyes of Gruumsh. In addition, it is traditional to pillage and murder elven villages in order to draw the warriors out. The elven king, not wanting to give the orcs the satisfaction of fighting his elven warriors, has decided to hire out some adventurers both elven and non elven to deal with the orcs."},{"name":"Crash Landing","description":" A burning airship is seen wobbling unsteadily through the air on a collision course with the ground. Shortly after it disappears over a nearby hill, a crashing noise is heard and a cloud of smoke can be seen off in the distance."},{"name":"The Sudden Spring","description":" A small village in a desert celebrates as a spring has miraculously welled up in the middle of the town square, however now local barons and raiders have begun to take a much bigger interest in this suddenly incredibly valuable town. THE OPTIONAL TWIST: The spring is a portal to the Elemental Plane of Water not far underground, and wild water elementals and sea creatures will begin to cause problems."},{"name":"Mysterious Egg","description":" The party has just stumbled on a group of bandits. After beating them, they realize they are poachers, and have an a mysterious egg in their posession. If the party takes the egg, they soon find themselves followed by monsters and poachers alike. What is this thing?"},{"name":"The Fiendish Well","description":" An well was just dug in the middle of a small town after the old one collapsed. The water smells of brimstone, so the people have refused to drink it... this has not stopped farm animals from drinking it, and transforming into demonic beasts. To save the town, the well has to be purified and the demonic creatures defeated."},{"name":"Cultist Kidnappers","description":" A local jeweler and a local blacksmith have been kidnapped (From their homes, whilst on the road to a trade center etc.) and someone wants the PCs to find them. The sinister story behind it all is that a cult of some form needs their expertise to create some form of magic item/summoning circle/planar gate/mystical_evil_object of some description. The PCs should stop them. This would make a great introduction to a large story arc for low level PCs."},{"name":"The Uninvited Guests","description":" While in a city, the party is confronted by an old nobleman, whose research indicates that fey conciousnesses are about to invade an upcoming party for nobles. The man himself is not invited due to being a little... eccentric, but he can get the party invited, armed with a magical amulet to prevent the wearers conciousness from being invaded. But there\u0027s only one amulet to go around."},{"name":"Missing Mistress","description":" Jaelom Harns, promiscuous daughter of a local wealthy merchant, is missing. All twelve of her public suitors have fled town at the same time."},{"name":"Dead Carnies","description":" A travelling circus recently left town yesterday after spending two weeks entertaining the townsfolk. This morning, it was discovered in a smoldering ruin barely ten miles outside of town, all the entertainers dead and seemingly burned alive."},{"name":"By Gragnar\u0027s Hammer","description":" Famous Dwarven smith, Gragnar Battlestein, recently did a show-and-tell at his smithy of some of techniques. Mysteriously, only two days later, his hammer went missing. It was probably one of the two hundred attendees, so at least there\u0027s a starting point for the investigation!"},{"name":"Green Dragon Request","description":" A green dragon slowly rising to power hopes to recruit its own adventuring party. The dragon offers a sizable amount of treasure for an oh so small favor. The dragon always has more things that need doing and the rewards begin piling up, but some of the requests start putting the party into moral quandaries. (Note: this would probably work best for trying to mess with a \"good\" party)"},{"name":"The Hand of [Enter PC Name Here]","description":" The players learn that undead have been terrorizing a nearby town lately and the culprit is likely residing in the abandoned tomb close by. The players encounter some undead (zombie dogs, mummies, etc.) while traversing the tomb but all they find out is that a lich likely resided there long ago. During the trek, however, one of the players gets bit by a wight and becomes plagued with an affliction. Have a local cleric stop the affliction from spreading, but now the PC\u0027s hand is changed forever. Give it some utility features (a minor and major advantage/disadvantage), and continue the story. Unbeknownst to the PCs, the cleric is the culprit and has been secretly researching and practicing necromancy in the tomb. At some point later in the story, have the cleric be revealed as a minor/major BBEG who became obsessed with his research and is after the PCs hand. If you want to increase the stakes, have the removal of the hand cause instant death/drop to zero HP and roll death save, and/or have the cleric confront the PCs because he can take control of the PC."},{"name":"Happy Death-day","description":" The party falls through a sinkhole into an underground cavern. There they find a gnome golem crafter and his golem have been declared as high priest and god, respectively, by a small tribe of Kuo-toa. The golem crafter has been trying to keep up the illusion while looking for a way out of the cavern system, but he needs help... A retired vampire-slayer and nobleman is holding a birthday party for his 10 year old son. Along with the bevy of guests, a small contingent of vampires have slipped into the party get revenge on the elderly paladin. Optional Twist: The paladin is able to lock himself inside a safe room with a couple of guests, but is separated from his son in the commotion. One of the vampires uses Magic Jar to inhabit the body of the son and tags along with the party until they can open the safe room."},{"name":"The Stolen Statue","description":" In the street of a crossroads trading post, a wealthy merchant is heatedly accusing the blacksmith of stealing his silver dragon statue, a priceless family heirloom. The blacksmith protests his innocence, but the statue is definitely gone."},{"name":"A Coup or Two","description":" A warlord has been succeeded, not by his son, but by the captain of his guard -- a foreigner who rose to fame as a brilliant tactician and commander, the warlord\u0027s right-hand-man and the source of much of his success. Now the warlord\u0027s son is fleeing into the hills, and beseeches mercenaries for aid in reclaiming his rightful place. But not all people think the new lord is so bad, and not all people see the prince as favourably as he would like to think..."},{"name":"Ward","description":" The fortress town of Ward sits on a rocky hill on a wet, windswept coast. There is not much to do in Ward, and most of the populace is in fact in the military, dedicated to protecting the city from the frequent orc raids that come down from the mountains. Recently, contact has been lost with one of the watch posts in the hills meant to warn the city of impending attacks."},{"name":"The Wedding of Starky McFrey","description":" The NPC\u0027s are invited to the wedding of Starky McFrey. Out of nowhere the wedding guests are attacked and Starky and his wive are the first of the casualty\u0027s"},{"name":"The wedding of Theon Bara","description":" The NPC\u0027s are invited to the wedding of Theon Bara. Out of nowhere Theon Bara drops dead from poisoning."},{"name":"You Don\u0027t Have to Go Home, But You Can\u0027t Stay Here","description":" There has been a mass exodus from the city, but it\u0027s unclear why. Everyone leaving seems to have perfectly legitimate and unrelated reasons, but everyone is going at once."},{"name":"The Harbinger Trump","description":" Word has gotten around that the Harbinger Trump has sounded and forces are gathering in the east to fight for glory!"},{"name":"The New Library","description":" Crowds are gathered around the gleaming new library. But there\u0027s something odd and animated about the new books and it\u0027d better be under control before the ribbon cutting ceremony."}]