[{"name":"Blights and the Gulthias Tree","description":" The world\u0027s coming to an end! Or came to an end! Or will come to an end. Or maybe it only nearly brought the end in the past. Point is, something big and nasty happened or is going to happen or is happening. What\u0027s your apocalypse?"},{"name":"Stages of the Blight","description":" The Blight expands to cover the entirety of the Great Forest, which is now an extremely dangerous place to enter, with blights everywhere hiding between the twisted trees and rotting undergrowth. Cities near the forest see a long term danger to their wellbeing, and start rationing food and nobles start taking all but what is needed to survive from the poor (yes I know this is the default state of things but just imagine if it was worse). Refugees from the forest spread out and seek new homes. Illness starts spreading in the villages and cities of people, lethargy and aching muscles. Villages either get defended or destroyed, and the cities start losing food. Long travelling blights take root in other forests, starting the eventual corruption of the entire countryside. Blights siege the towns not already destroyed, clamoring at the walls and invading the unwalled towns. Illness turns into plague, as evil vines push through the walls and pavement of cities and towns. People ignore the emerging chaos as they try to secure survival for themselves. People with the plague sprout thorny vines along their skin, with not a drop of blood spilt from the scratches. When they eventually die they resurrect as Blood Blights, draining the blood from corpses into the sacs on their skin and returning to the centre of the Blight to feed the Gulthias Tree. Civilisation is overrun, as the chaos within the walls and the hordes outside of them destroy all remains of order. Cities further from the destruction hear news of the coming storm and become concerned over the blights sighted in their own forests and the strange illness starting in surrounding villages. Strict regulations are enforced, people start burning anything that might spread disease or spawn a blight. The Master Gulthias is risen again through the blood of countless. The world will kneel at his command. Smoke columns constantly fill the sky, from cities and the nearby forests and crops, as paranoia and fires spread. Mad priests scream of doom and salvation, mages spew inferno throughout the day, and law is barely maintained. Blights act smarter, and act more like armies than hordes. They spread out from the Cursed Forest to join their foreign brethren in taking the blood of the living. Cities starve and Master Gulthias watches the world crumble at his will."},{"name":"The Cogs","description":" Recycling from the 10k Villains: Monstrosities thread Long ago, a Dwarven king called for the creation of a Wonder, a mighty walking fortress that could bring war to the most distant enemy. The mightiest and most skilled artisans worked for ten generations, until the castle was complete. Taking the form of an enormous Dwarf, it could stride across rivers and smash through castle walls with ease. However, they made it too well. The complex mechanisms inside it, designed to allow it to repair itself, began to leech minerals from the rocks themselves, and eventually subsumed the Dwarves who dwelt inside it to become part of its mechanism. It is named after the tiny automata it creates, that form the first sign of its coming. Tiny things made of cogs swarm ahead of it, scouring the land of everything - animal, vegetable, or mineral. Everything is ripped apart into its component parts and conveyed back to the main fortress, now a bloated monstrosity of metal and stone. Inside, organic matter entwines around cog and wheel, forming a hideous fusion of meat and metal. Left to itself, it will scour the world clean of everything until it sits alone on the earth."},{"name":"ice age.","description":" Now the life of an adventurer is especially difficult; travel between settlements is dangerous not because of goblins, but because of the threat of freezing to death. Any given commoner may know of nothing beyond their own small village, as communication between towns has become virtually nonexistent. The big city is under a lockdown, with resources strictly rationed as the local noble frets over the swiftly depleting grain stores. Tribes of orcs, frost giants, and winter wolves roam supreme, lording over the wilderness and those settlements that fail to survive the endless winter. Even the onc-rare remorhaz is seen with increasing frequency, and some villages live in constant fear of being utterly decimated by one. In a setting like this, resources are scarce - good armor isn\u0027t easy to come by, and your wizards had better keep track of their components or focus, because buying new ones may be nearly impossible in the countryside. But if your players can stay fed, keep warm, and fend off the monstrous hordes that call this frozen world their home... then perhaps they can still become heroes, even in an ice age such as this."},{"name":"The Creatures Between the Planes","description":" Thousands of years ago, humanity ruled a powerful empire, wise in magic and lore. Their greatest wizards were said to know all there is to know of the Material Plane, and much of the other planes besides. But, in their quest for ever more knowledge, they delved into the secrets of the Far Realm. To their horror, they were met with monstrous creatures---countless legions of abominations famished from long aeons trapped in the void, incomprehensible and unrelenting. Many of those scholars went mad from the revelation; some turned to worshiping these Outer Gods; others studied them to learn dark, forbidden secrets. Panic ensued. The ruling governments made research into the outer worlds illegal, but the damage was already done: magic is powered by will and by belief. Worship and fear of the Outer Gods began to corrode the divide between the Material Plane and the Far Realm, which led to small incursions of creatures from the other side, among them aboleths and the Illithid. In a desperate attempt to prevent the end of the world, the gods chose to cleanse the Material Plane in divine fire, sending their greatest arch-angels to purge the world. Their gambit paid off, for a price. The Material Plane was sealed off from the Far Realms, but the once proud human civilization lied in ruins, with the survivors clinging to life in a shattered world. Still, it is said that time heals all wounds. The Material Plane slowly healed; the survivors formed new civilizations and new peoples. The events prior to the apocalypse were forgotten, as was the gods\u0027 intention. But will it always be? Curiosity is the mark of mortals, and there are still places, deep within the earth, where the divine purge did not reach---sealed pockets where things wait for the right time to be released. Soon, the stars shall align. The time of reckoning approaches."},{"name":"Werepocalypse","description":" The PCs, while exploring underground, find a civilization of men. You can custom design these people as you wish, except as noted. Centuries ago, before their recorded history starts, a group of afflicted lycanthropes were chased from civilization. To hide themselves from the curse, they fled underground out of reach of the moon. Through their perseverance, they\u0027ve built up their own society, but in the progress forgot why they were chased underground (and maybe forgetting there was even an aboveground to begin with!) The PCs, of course, adventure and interact with these individuals in their underground adventures since they are a bastion of order and civilization. Have fun letting the players grow attached, give them some villains and heroes and a lovely old cat woman on the edge of town that makes vague Nostradamus style prophecies with 50/50 accuracy (she\u0027s only half insane) Despite how it acts, lycanthropy is technically a curse, not a disease. This is important because anyone casting everyone in this civilization appears to be cursed and those that are immune to disease are not immune to lycanthropy. However, this particular blend has been starved for generations, and those without expertise or experience with curses won\u0027t be able to identify the curse, just that it\u0027s weak. The PCs will need an expert, and since the new kingdom would like to open trade with the aboveground world they\u0027ll gladly send an diplomatic envoy of their people to help the PCs! (who have never suffered negative penalties to this weak curse, but are worried about it nonetheless) So the PCs and their trusted allies all head above ground. Give\u0027m an encounter or two, fight off some bandits, make\u0027m feel good about their honor guard. When they get to the city, the envoy is welcomed, and diplomatic meetings proceed. Good job, guys :D The PCs get the chance to look into the curse at the same time. They might have a wizard friend from the city who\u0027s out checking out some ruins for a few days (they can wait or go meet him), or perhaps they\u0027ll have the High Priest of the Holy Church do a Ritual of Declaration after the paperwork is filled out, or maybe their Alchemist friend is going to do some experiments on one of the civilians, or perhaps the Wizard will take it into his own hands and head to Ye Olde Archives. Regardless, there is some down time. And a full moon. With several dozen afflicted lycanthropes in the governmental center and generations of interbreeding, the lycanthropes transform into horrific blends of bear, wolf, bat, boar, cat, etc. Normal resistance to silver applies in their altered state, and should make guards close to useless as the beasts hunt down and either kill or infect the majority of the nobles who had gathered for this monumental gathering. The flood of people fleeing the beasts allow them to burst into the city, attacking and spreading the curse throughout the population. Keep in mind that some have wings and will certainly escape the city. Depending on things that happened while underground, the PCs may also be afflicted. Buildings aren\u0027t enough to protect them from the moon\u0027s influence (unlike miles of rock). They may be in town when the commotion breaks out,and might not realize at first that the beasts they\u0027re fighting are the men and women they brought with them. They probably will notice (if any has a silver weapon) that the silver penetrates their hides with ease. If they\u0027re out looking for their contact with 1-2 personal friends, then...well, at least the transformation takes place before first watch, so at least they have that, right? That, and the dawning horror they get at realizing what must be happening in the city itself... The lycanthropy spreads quickly, with people hiding it no matter what the PCs plead. The government\u0027s been crippled, their rulers likely infected or dead, and the paranoia spreads over who is and is not infected. This makes it hard to get people to coordinate and get actual precautions going, especially given power grabs going on and that the underground kingdom will likely mobilize for war at the lynching of their diplomats, especially given this preposterous excuse."},{"name":"The Moon Explodes","description":" Oh, here\u0027s my favourite idea. Might not be applicable to every setting, though. Giant pieces of rock come hurtling towards the planet. The changing tides swallow up islands, continents are sunk or obliterated from the impact. Travel by sea becomes completely unfeasible without the use of magic, and dangerous even then. Trade between nations suffers as a result. Religious organizations, especially those who consider the moon to be divine, either try to appease their deities or prepare for the end times. The gods are silent. An epidemic of suicides sweeps the world. Then strange creatures begin to rise out of the fallen moonshards, seemingly hostile to all forms of life and exceedingly difficult to kill. They defy classification, and neither the mind flayers nor the aboleths know anything about them. Only one creature proves capable of destroying these extraterrestrial monsters for good: the Tarrasque."},{"name":"Stack Overflow","description":" The universe was a simulation all along. People occasionally spotted it, by seeing glitches in it, borders of their world, and other signs. However, as soon as they realized, they figured that the apocalypse is coming. The moment, when one variable reaches its maximum value. Maybe it\u0027s going to be a certain year, or a number of living beings, or the age of the oldest being. Maybe something else. A small cult of Simbelievers believes they\u0027re trying to save the world, and they do that by finding the greatest values in anything and everything, and trying to reduce it, if not remove it completely. Their current goals include working on a calendar where year wouldn\u0027t be the longest unit of time so that we don\u0027t reach maximum number of years, killing or making the oldest being in the multiverse younger, cutting the properties of richest people so that they don\u0027t reach the highest possible value, and more. Who knows what will happen once the Stack Overflow is reached. Maybe the whole world will just st- ..."},{"name":"The Second Thursday","description":" Believe it or not, there is a small group of people (who refuse to call themselves a cult), who believe that the whole world was created last Thursday, including any of our experiences and events that happened prior to the last Thursday. Some people are intrigued, others consider them fools, but they don\u0027t care for what the rest believes. Every Thursday means for them a new start, when they behave like the world has ended and started again. They\u0027re one of the few cults groups, who can say that the Apocalypse has already arrived many times."},{"name":"Solarism","description":" (for the purposes of this paragraph, I\u0027ll refer to the deity of Sun as Ra, but it could be any Sun deity at all) This religion is devoted absolutely to the faith into Ra, and no other deity, worshipping Sun for keeping everyone and everything alive. However, the highest priest of them all once received a warning from Ra himself. One day, the Sun will grow, and it will swallow everything. Ra did not tell them when this is going to happen, but he told them that he will spare anyone who will believe in him. Needless to say, this religion is trying to aggressively convert others into their belief, but with the best intentions."},{"name":"Wake up Call","description":" Oneironism is another major religion, one that believes the existence itself is a dream of one single being. Only clue they have is that it may be one of the deities, or otherworldly powers, since the world seems to have existed for a long time. But, as long as the deity doesn\u0027t realize this is a dream, or wake up from their dream, the world keeps existing. Oneironism splits into two major branches here - the Callers, and the Keepers. Callers are those who believe that the deity needs to be awakened, because it surely has much more important business to do than just sleeping around. And if its dreams create whole realities, the deity is surely able to make a reality, that doesn\u0027t rely just on the weary mind of theirs. The Keepers are ones who try to prevent Callers from waking deity up, and do their best to keep it asleep. Luckily for both mortals and immortals, the deity has not been yet found, so the existence itself is not threatened. However, it\u0027s questionable how long will this state last... Maybe, the deity will wake up by itself."},{"name":"Tides of Darkness","description":" An ancient entity deep within the ocean has awakened after thousands of years of slumber. A massive Kraken, the size of a continent, rouses and sets into motion the events that lead to the era of the sea. It calls out to it\u0027s descendants and begins to amass it\u0027s army; it tears holes into the elemental plane of water, causing the sea level to rise drastically and flooding much of the land; it bends the weather of the world to it\u0027s will, causing global torrential rains and violent storms. It can see, hear, and even speak through any body of water, from lakes and puddles to wells and cups of water; however, when it does so anyone nearby can see it watching. The primordial is more cunning than most men, and bent on plunging their kingdoms into it\u0027s watery abyss."},{"name":"Coterminous Plane","description":" Some lich (or other necromancy related big bad here) makes a portion of the prime material plane coterminous with another plane. Think how the shadowfell and Feywild are strongly connected to the material plane? Well, this is similar, but imagine the effect being much stronger. Specifically, the lich makes the negative energy plane coterminous with the material plane. This only needs to last for a few moments to cause massive loss of life. If it lasts for 30 seconds, that\u0027ll be a mass extinction event. After that... what happens then? What do the PC\u0027s do in a dying world, filled with countless hordes of the undead who seek to cower all life from the land. It would seem as if evil has triumphed here, what hope can remain for the forces of light in such darkness? In a campign like this, the focus probably shouldn\u0027t be \"undo the damage\", and turn everything back to the way it was. That shouldn\u0027t be on the table. The players will basically have to find a way to deal with the world they live in now, and try to save what little remains. After that, maybe they can get the world to a state where it rebuilds. Perhaps they would be the ones their ancestors will claim saved the world."},{"name":"The Withering","description":" This requires a bit of a set-up, but long story short part of the world was sealed off from the rest in a giant bubble and given its own climate because Wizards/Aliens/Demons. What happens when the barrier falls, and a micro-climate spanning 25% of the world suddenly gets added to the remaining macro-climate? Many hurricanes, massive rains and floods, icecaps melt, super fast global warming, etc. Everything gets destroyed. In my game, I had the Mana Weave get destroyed as well around the area of the bubble (Plot specific reasons, but it can happen for any reason you want), so spellcasting in that area is impossible. Really makes trade dynamics and survival in that area difficult if people were so used to magic. This leads to a very specific apocalypse described below:   Kind of borrowed from Warcraft. It relies on a different interpretation of Innate Spellcasting (Sorcerers and Favored Souls). Innate Spellcasters are constantly in-tune with the Mana Weave. Mana flows through them, it is a part of them. It powers them. When they are suddenly subjected to a lack of Mana for a long period of time, they start to wither and go through Mana withdrawal. This can take many forms and have many symptoms (Be creative!), but typically results in the death of all Innate Spellcasters in the region if not treated quickly enough."},{"name":"The Device is Activated","description":" My current world-frame takes place in what is functionally a distant, post-apocalyptic world. Civilization has managed to rebuild itself from the ashes of the Old World, but not even remotely close to the scale and the splendour that came before. The might of the Aurelian Empire is known across the world as THE economic and political powerhouse of Llwethlyn, managing to conquer and unite almost the entirety of the aforementioned supercontinent beneath its banner. For thousands of years it has maintained a firm grip on the sapient denizens of the mortal plane, and bar the occasional uprising or natural disaster seldom needs to mobilize great resources to deal with threats. With such a stable (and perhaps even stagnant) state of affairs, the question that begs to be asked is: Where do we go from here? Enter the Ascension Device. Through hundreds of years of diligent research, the top minds within the Aurelian scientific and alchemical communities have finally discovered the secret to elevating the mortal consciousness to a higher plane of existence; a device to make Gods of Men, en masse. The architects of the Ascension Device claim that when activated, it will put an end to the suffering of the Mortal Condition and thrust the Empire into a new age where they too will live as Gods, immortal and able to shape reality to their whims. Unfortunately, the Gods themselves have been watching the Aurelians warily, and they are very, very displeased with their hubris. Ascension Day in the Aurelian capital of Romata. The boulevards of the grand city are lined with hundreds of thousands of onlookers as the procession of scientists, arcanists, engineers, and Senate officials parade towards the specially-built building which houses the twisted expanse of metal and stone that forms the Ascension Device. - Going to do a bit more writing on this tomorrow, but this basically forms the core of the \u0027Scourge of Aurelia\u0027"}]