[{"name":"The Common Inn","type":"Tavern","description":" Welcome to the Common Inn. Everything is quite ordinary, you see, there\u0027s nothing special about us. In fact, we make a point of it. If you speak anything but Common, we\u0027ll kick you out. But don\u0027t worry - that rarely happens. Come on in!"},{"name":"Aunty Agatha\u0027s Apothecary","type":"Creepy building in the woods","description":" There\u0027s no one here. So how did we know it was Aunty Agatha\u0027s? And what\u0027s that\u0027s scratching noise - there, hear it? No? It\u0027s like it\u0027s in my head - very strange. Oh well - I\u0027m sure it\u0027s nothing."},{"name":"Austr\u0027alia","type":"Land of death and Roos","description":" Some sort of time vortex where everyone sleeps when they should be awake, and vice-versa. Full of things that want to kill. Just... kill in general."},{"name":"Shimmerpeak Castle","type":"Castle on a mountain peak","description":" Shimmerpeak stands proud at the tallest peak of a mountain range. It is always summer when you\u0027re near the castle. Years after it has been used, it remains pristine and almost glowing. They say that the last king who ruled over it still walks its halls with his wife and kids. They say it because its true. He\u0027s very nice, you can go talk to him. Just don\u0027t mention orcs."},{"name":"The Feytouched Vale","type":"Large enchanted forest","description":" They say that the barrier between the Feywild and the mortal plane is thin in the forest, and has given the Vale a mind of its own. The Vale is not cruel, any who wish to live and hunt within its borders is welcome to, as long as they are not greedy. You may build lone homes, but attempts to settle towns or build infrastructure are met with mysterious disappearances. The Vale protects itself, mind yourself while you\u0027re there."},{"name":"Zanlamin","type":"Dwarven stronghold","description":" Zanlamin is a dwarven city deep within the mountain that bears the same name. Its namesake was a Goliath hero that saved the city from destruction from an army of orcs alone by defending a passageway into the city for hours, before finally collapsing the pass when he tired, killing himself and all the orcs. His axe, Earthsplitter, was recovered and now rests over the throne of the dwarven king."},{"name":"Mysteries and More","type":"Arcaneum and Trinket shop","description":" Mysteries and More is a store run by a mysterious figure, that few have ever seen. The wonders you can find inside are unlike any others in the world. That\u0027s what the company line is. In reality, it is a store with a darkness spell cast on it, where the owner, a shrimpy elf named Taranius used magic to make his voice seem mysterious as he reveals simple items one at a time. He wears a sign on his neck that says \"If you can see me, please don\u0027t spoil the mystery\""},{"name":"Kadosi Falls","type":"Waterfall vacation destination","description":" Kadosi Falls is a beautiful and idyllic beach and waterfall tucked away in a secluded grove. Beyond its legendary scenery, the falls are a popular vacation point because time seems to go slower while you are there. A simple vacation of a day can seem like weeks to those near it. There are whispered rumors that on rare occasions, the magic doesn\u0027t seem to work right and those who enter the grove disappear for months or years, only to suddenly reappear as if they had never left."},{"name":"Sapphire Caves","type":"Wilderness cave system","description":" A small system of caves on the edge of some ocean cliffs. Springs well up from within, and warm, crystal clear water trickles into streams, which empty into the sea. The majority of the caves have been unexplored, though there are constant expeditions within."},{"name":"House of Marble","type":"Abandoned home in town","description":" When Mizer Lone, the wealtheist merchant for hundreds of miles, died, his sons sealed his marble home, and hired dozens of guards to patrol the location at all hours of the day."},{"name":"The Luninaria","type":"Lighthouse","description":" A mile off the shore of Port City (insert name here), there is a small rocky island. A dozen years ago, a few druids got together and built a weather station there to monitor sea storms, and a few years later, a lighthouse was built as well. The druids are very picky about who they allow on the the island."},{"name":"Karten\u0027s Bowl","type":"Weird wilderness location","description":" About a mile into a large, mostly unexplored forest, there is a clearing where no vegation grows. In the center of the clearing is a smooth crater, almost a hundred feet across, and perfectly circular. All around the crater are the stone ruins of some ancient, small homes. No one lives here, and the homes don\u0027t appear to have been abandoned for any particular reason. Some rangers, led by Fraen Karten, have recently set up camp in the area, and use it as a staging ground to further explore the forest."},{"name":"Sally\u0027s Spider Shop","type":"Town shop","description":" Sally sells spiders. Kept in glass cases and jars, Sally has almost all known spider species available. She never harms them, and she always makes sure the buyer is going to take very good care of them, and not use them for any nefarious ends."},{"name":"The Honey Mill","type":"Brewery, bar, taproom","description":" Brothers Jonas and Elias Vaden founded a brewery a dozen years ago. They are known regionally for their famous Vaden Honey Ale. They have recently expanded to include a large taproom and stage, where famous entertainers visit to perform."},{"name":"Garnack\u0027s Greenhouse","type":"Orcish Herbalist","description":" Dis my green house. Not all things green here. Not make much sense. It all pretty. And useful. Can\u0027t remember how. I try one. I get sick? I try new one. My little flowers."},{"name":"Nimbuss","type":"Monestary","description":" If you travel high enough up the mountains, there is a place were the clouds are so dense that you can walk on them as if they were solid ground. It is here that the monks have built their home, meditating with the wind and conversing with the breeze. News travels most quickly through the wind and the monks have heard it all."},{"name":"Spook Hill","type":"Haunted Hill in a Swamp","description":" Many years ago a gnome village was plagued by raids of a huge alligator. The Chief, a great warrior, killed the gator in a battle that created a small lake. The chief was buried on the north side in a large mound. Travelers to the area report a great sound of thrashing and yells in the middle of the night. Is this the gator seeking revenge, or the chief still trying to protect his land?"},{"name":"Temple of the Lake","type":"Neutral good temple dedicated to the Lady of the Lake","description":" The Temple of the Lake was founded by the lady of the lake who after naming the king of the land desired to maintain a watch to ensure that he and his descendants would stay pure and honest leaders. The core ideals of healing and purity have being passed on through the order now know as the Maidens of the lake who man her temple. They are willing to heal any and all travelers who pass through no matter how nefarious as to judge them would be to make their mind impure, this means that even criminals can seek sanctuary at the temple so their wounds may heal. The temple itself is unique as the entire building is lightly flooded so that every inch of it is a pool a foot deep of pure spring water. This water never gets dirty and is perfectly clear, however someone trying to sneak though the temple will find that it slows them down and makes loud splashing noises no matter how carefully they walk."},{"name":"Bronzburg","type":"Remote village","description":" Nestled in valley between the Copper Hills and the Green Mountains is this quaint village. The site has been occupied for centuries as the hills were mined for their rich deposits of copper, which was sent north to be forged into bronze. When the mines went dry, the valley was largely forgotten; only a handful of families remain, growing vegetables and raising sheep, but hardly enough people to fill the old buildings. Two or three times a year a few travelers come to the village with dry goods and news of the outside world."},{"name":"The Village Square","type":"Small market","description":" An ancient oak tree dominates the grassy square at the center of the village. A handful of market stalls have been set up by farm women, selling turnips, carrots, onions, and cabbages mostly; a young boy is hawks salted mutton and sheep\u0027s cheese from a cart; and an old woman offers some crudely woven wool garments. A half dozen people gather at the far end where a peddler from outside the valley is drawing curiosities out of his enormous sack."},{"name":"The Shadowwood","type":"Ancient forest","description":" The Shadowwood is a dark and ancient forest, framed by jagged peaks to the east and west and frozen lands to the north. There are legends that an ancient king built a town at its southern edge, hoping to use the wood to fuel his forges, bringing iron out of the mountains. But the forest fought back, swallowing the town whole. Most travelers avoid the Shadowwood: many say only the dead walk among its trees, some say that there are still elves living there who wish to be left alone, and even the bravest of hunters will only venture a short distance in."},{"name":"King Cirthoeil\u0027s Keep","type":"Woodland fortress","description":" Carved into an enormous rock at the fork where two rivers meet, the wood elf king reigns over the forest from this fortress. Access on three sides is blocked by the rushing waters of the rivers, but vine-camouflaged draw bridges can be let down to allow escape to either bank. The only approach on land ends in a sheer rock wall, the natural formation of rock having been hewn into rough battlements, there is no gate, but ladders can be lowered from the top of the rock. Within, carved stone passages connect the chambers that make up this fully functioning fortress: the great hall, the armory, the kitchens, the residents\u0027 quarters."},{"name":"Steelmoon Academy","type":"Wizarding school","description":" The Steelmoon Academy is located atop a low peak in the foothills of the Great Mountains. It is said to be built upon the site of an ancient monastery of shadow monks who fled the place when a dragon claimed the territory. The inhabitants of the academy are reclusive, and they are led by a mysterious wizard called Gerwac, the Knowing. Admission to the academy is by invitation only, and those who study there rarely return to their hometowns."},{"name":"The Broken Road","type":"Mountain pass","description":" In the Age of Peace, the ancient people of the Western Kingdoms and the Southern States enjoyed a flourishing trade with the Eastern Empire, and that trade went along the Great Road that spanned the continent, snaking through a pass in the Mountains of Thunder. The ancients built several bridges and tunnels along with way-point stations to make the crossing possible, though still treacherous, for carts and wagons. When the Dragon-Emperor of the East tried to cross the mountains with his Army of 100,000 to invade the West, several wizards cast an earth-shattering spell that shook the world—breaking bridges, collapsing tunnels, and causing avalanches—, sending many of the easterners plummeting to their deaths and the rest fleeing for their lives. The place has since been known in the West as the Broken Road."},{"name":"The Enchanting Antique Shoppe","type":"Curiosity shop","description":" Next to a seedy looking tavern on Magpie Lane is a door marked with chipped paint, \"The Enchanting Antique Shoppe, D. Obskur, Prop.\" Down a flight of narrow, winding stairs is a the shop. It is little more than a musty closet with a high ceiling and wooden counter with an open door revealing a room with more shelves beyond. The flickering torchlight reveals all manner of odds and ends on the shelves: lanterns, statuettes, glass vials, glass bottles, spyglasses, unusual brass instruments, fine leather purses, richly embroidered silk pouches, and books of many shapes and sizes."},{"name":"The Necromancer\u0027s Laboratory","type":"Villain\u0027s den","description":" As you open the door with a strange looking mummified eye twitching above it, the heady smell of perservation fluids and decaying flesh rushes out to sting your nostrils. In the room, you first notice a large table containing a corpse. Opposite the table is a desk cluttered with parchment and books. Shelves are packed haphazardly with books, notes, and glass jars holding the preserved remains of all manner of small creatures and organs."},{"name":"The Buried Axe","type":"Dwarvish alehouse","description":" The sign above the place pictures a goblin\u0027s head with a large axe-blade buried squarely in its forehead. Inside, the light is dim. A coziness rises in the air from the close-packing of the patrons, the smell of roasted meat, and the heavy scent of drunken dwarves. The walls are decorated with pieces of weaponry, all dwarf-made, and tattered battle flags and banners. The barkeep eyes you as you enter and motions to an empty mug in his hand. \"Ale or mead?\" he calls out above the chatter and laughter and the clanging of mugs and the scraping of chairs.."},{"name":"The Dog and Pony","type":"Roadside Inn","description":" The wooden structure is sturdy enough, but it feels very old. The soup smells delicious, and several casks of ale are ready to be served. The sign out front touted, \"The finest, most extravagant entertainments for all appetites!\" However, inside, it\u0027s just a dopey looking kid strumming a lute."},{"name":"The Laughing Sheep","type":"City Tavern","description":" The wooden structure rises to a height of three stories. The common room is cozy and tightly packed with tables, a large spit turns a pig in the over-sized fireplace against the left wall. An oak bar stretches the length of the far wall, and to the right is a staircase that leads upstairs. Many of the city guard are crowded about the tables, drinking and eating roasted, and harassing the barmaids, all of whom are attractive, young, and plump."},{"name":"The Storm King\u0027s Temple of Winter","type":"Remote Temple Complex","description":" Far to north, on a hill over-looking a cold, wind-swept coastal plane is an enormous temple complex dedicated to the god of storms. With lower levels are built of stone and the upper build of ice, this temple houses one of the great libraries of the world; which has grown over the centuries and never lost a manuscript to a fire. The Brothers and Sisters of the Storm that live, worship, study, and train here include powerful healers and unmatched warriors. They are tolerant of outsiders who treat the place with it\u0027s due reverence, but woe to those who would defile it or jest at the power of the Storm."},{"name":"Xaranth","type":"City","description":" Built around the eggs of Tiamat and Bahamut, the city is concentric, with a clear plan and design to each segment."},{"name":"Chichester\u0027s Tavern","type":"Tavern","description":" This tavern is apprarently perfectly ordinary, until after everyone has gone home, and the barkeep Chitchester pulls on the elk\u0027s antler, opening a secret door leading to his underground base, built with the riches from, and to defend against enemies made during his extensive adventuring career."},{"name":"The Lair of Kenneth the Slow, Brown Dragon","type":"Lair","description":" Kenneth is a pitifully weak and timid dragon, and his lair reflects this, in the fact that it is a small cave and nothing more. It has a small side-cavern in which he keeps a few bookcases filled with titles such as \"Overcoming Anxiety: Public Speaking in Simple Steps\" and \"Confidence is Key: A Beginner\u0027s Guide to Extorting Villages.\" Other than this, there are no treasures."},{"name":"The Ancient Altar","type":"Altar","description":" Disused and covered in moss, and that couldn\u0027t possibly be a pool of blood seemingly fresh upon the slab? Could it? No that would just be insane..."},{"name":"The Deep Hatchet","type":"Tavern","description":" Got an issue bubbling up with your neighbour or associate? Don\u0027t let it fester, reconnect over a cold brew at the Deep Hatchet, never mind that most guests depart missing a large chunk of their spine, totally unrelated."},{"name":"The Poorly Lit Alley","type":"Alleyway","description":" Got some business to attend to? Or perhaps some \u0027business\u0027? Whatever your needs the poorly lit alley has been known to provide to the most esoteric of requests, but what giveth is soon taken away, weak jugulars be wary."},{"name":"Trading Ghost","type":"Trading Town","description":" An entire town lies in the mountains, it appears very well maintained with signs from multiple races across the faces of buildings and shops. Only, there\u0027s skeletons in the lanes, behind the counters and in the shops, obviously rotted clean from years of exposure. The carts continue to set up of their own accord beside the skeleton near the well, where the bucket goes up and down in an empty well. No sign of magic is apparent, but at night ghostly shapes sleep in their clean beds over skeletons centuries old."},{"name":"The Sanctuary","type":"Free Trade City","description":" SANCTUARY! Where anything goes! You\u0027re safe here folks, bring your wares, your people, your forbidden magics! Here in the desert no one can hear you scream about all these amazing deals!!!!!"},{"name":"The Tower O\u0027 Power","type":"Mage\u0027s Tower","description":" It climbs into the sky, a sign posted at the front says enter at your own risk, make it past the traps to speak to the Mage. The local boys have made a game of trying to get to the top, they say the Mage will grant a wish to whoever makes it. They\u0027ve only made it to the second floor though, seems like the tower fills with water and flushes em out rather regularly."},{"name":"Froog\u0027s Haven","type":"Farming Village","description":" A simple farming village on the Southern edge of the mountains, east of the River, West of the Forest, North of the Trade routes and a few days from the local Mage\u0027s Tower. Watch out for the Town\u0027s Elder though, she can talk for hours about the crops, and the goblins, and the time a Giant came through, and the nice lad she met growing up, and the Mage who came through another time."},{"name":"Bank of Moradin","type":"Bank","description":" Run by Dwarves, guarded by Constructs and Rune encrusted armor, rumour says that those who dare attempt to steal from it, are never seen again. And shortly after they try screams are heard from below the ground, and a green mist flows from the storm drains, and hooves are heard stomping around them."},{"name":"The Spire","type":"Magical Research Institute/Tourist Center","description":" Welcome to the Spire. First floor: Tourist center, gift shop, food court (Try our magically-generated sausages!). Magical items can be purchased based on availability in the various market stalls. Custom requests can be submitted through the Information Desk. Second Floor and above are not open freely to the general public. Access is only granted through tours or by appointment."},{"name":"Corantis","type":"City bisected by a river","description":" Each side of this large, sprawling city is dedicated to a different deity. To the west, most people devoutly worship Heironeous. To the east, Hextor reigns. Needless to say, things are rather tense, and the local government is having a somewhat difficult time."},{"name":"Sarumat of Nchzzar","type":"Dwarven Kingdom","description":" Many of the dwarven kingdoms of old collapsed millennia ago, pushing many of the stonefolk into a life above ground in the Bothvar hinterlands of the north. One of the few realms to have survived this collapse is Nchzzar, a kingdom whose name means “of Polished Basalt” in the old tongue. Nchzzar is all but totally alien to the surface dwarves that have permitted to visit the underground metropole. Art, philosophy, music, theology, and even politics follow unfamiliar, rigid designs emphasizing linearity and hierarchy. At its head is Sarru Enreddu XXXIV, now in the 312th year of his reign."},{"name":"The Shingles","type":"City Slums","description":" Officially known as the St. Beleth District, the waterfront slums of Thorenbergh have been known colloquially as the Shingles for the better part of a century. As the principle commercial port between Thorenberg and the Antarres, the Shingles have become a hub for the illicit trade of Raklak powder – a highly addictive substance containing traces of lich dust, Drow venom, and obsidian salt. Three gangsters control most criminal activity in the Shingles: Merewen, a half-elf who believes herself a true elf, heads the city’s most proficient cutpurses and padfoots; Grokk Madfinga, a giant orc who receives instructions from Grummsch via his left pinky, who runs the protection rackets; Scarlet Vera, an elderly Tiefling lady believed to be a high-ranking member in the Guild of Rats."},{"name":"Turnkey Alley","type":"Craftsman District","description":" “Go to Logoria, and find a solid door.” – proverb of the Keepers of Silence. There are no finer doorwrights and locksmiths in the world than those found in Turnkey Alley. One might think the trade one of lesser importance, but with the abundance of thieves, assassins, and generally unpleasant folk in the world, sometimes all one wishes is to have a thick door and a sturdy lock in their threshold. Anything involving doors and their construction can be found in Logoria, including the budding ‘metaphysical doorwrights’ – mages who enchant locks, ward doors, and craft items or scrolls with embedded portal magic."},{"name":"Mount Archos","type":"Semi-Autonomous Region","description":" A thousand shrines and monasteries dedicated to the god Pelor dot the sun-bleached face of Mount Archos. An enclave run by the Order of the Jagged Sun, Mount Archos is a holy site for many of the world’s humans, who tend towards the worship of Pelor. Officially, it is part of the Droghate of Il-Alargol, and pays a hefty church tax to its orcish overlords; despite this, the orcs tend to leave Archos to its own devices, preferring the steady stream of income to raiding along a different mountain pass. Men are generally prohibited from Mount Archos, although male pilgrims wearing a full, black veil are allowed to pray here in the company of a female companion. The monks of the Jagged Sun, all of them women or those who have given up their gender, name, and personhood to Pelor, enforce this rule strictly – visiting swift death upon those who would defy them."},{"name":"The Rhadamanthian Throne","type":"Monolithic Structure // Adjoining valley","description":" Countless bodies in various states of decomposition encircle the Rhadamanthian Throne – a site of important ritual significance to the Thassonic people. It is a solid pillar of dark, polished jade, covered in a dizzying array of historical and religious reliefs and text, extending up nearly 100 meters. The Thassonians believe that the Throne is an extension of their death god, and that by making a pilgrimage and leaving the bodies of the dead here, their loved ones may receive a more lenient judgement of their lives. Whatever the truth of the Throne, two things are evident: the stone from which it was carved extends naturally from beneath the earth, and that it emanates intense necrotic energy. Bodies here decay far more rapidly than normally, and tend to dry out and mummify rather than dry out. Some of the richest can afford to build tombs into the surrounding valley cliffs – most simply pile the bodies at the feet of the Throne wherever there is space."},{"name":"Rainbow Falls Castle","type":"Castle atop a waterfall","description":" Built precariously on a small, magically maintained island at the top of Rainbow Falls, the castle has stood for as long as anyone can remember. Despite being on the edge of a waterfall there has never been a case of someone falling off unintentionally."},{"name":"The Lost City of Quartz","type":"an abandoned city constructed of crystal","description":" A city of unknown origins made entirely of high quality quartz hidden away in the mountains of Deanor. Constructed by some long forgotten race, all the proportions are slightly off: doors too tall and thin, steps slightly too deep, and buildings constructed at odd angles. If any quartz is taken from the city limits it quickly fades to ordinary rocks and regrows in the city."},{"name":"Black Fall Mine","type":"Abandoned coal mine","description":" From out of the mouth of this mine a stream as black as pitch runs. No one knows what caused it, what is know that every time an adventuring party enters the river turns red."},{"name":"The Laughing Demon","type":"Tavern","description":" Nothing seems out of the ordinary here, unless you find mounted demon heads fixed in perpetual smiles odd."},{"name":"The Explorer\u0027s Rest","type":"Inn and tavern","description":" On the outskirts of the jungle where countless yuan-ti and human empires have fallen is this small wooden building. No one knows when it was built, but everyone knows of it. Any expeditions into the ruins of the jungle go through here first. For many adventurers, this is the last building they see."},{"name":"El\u0027Varoth","type":"Eladrin city-state","description":" One of the many city-states the high elves once ruled, this is the only one they still hold. It has no walls, yet none have ever dared to go to war with it. El\u0027Varoth is a continent-wide center for trade, the arts, and technology. The farmlands surrounding the city have a primarily human population, and the city is one of the most diverse on the planet, yet it is ruled over by the powerful fey families, constantly jockeying for power."},{"name":"The Narrows","type":"A Town Divided","description":" Two small farming communities make up the Narrows - though they fall under the same local government heading, they are affectionally called \u0027Narrows East\u0027 and \u0027Narrows West\u0027. High in the foot hills, the only road to reach the Narrows leads to Narrows West; a massive dividing canyon runs between the two towns, spanned by a handful of bridges running between stone pillar \u0027islands\u0027. Narrows West is a fairly idyllic farming town; everyone has plenty to eat and drink, warm shelter against the harsh winter, and are generally friendly. The apple orchards surrounding the town are bountiful year-round. Crossing the bridge, the difference is apparent; the Narrows East orchards are hard-pressed by blight and drought, and require constant tending. However, only the women and children work in the fields; the men are all pressed into the town Militia, patrolling the streets. In particular, the makeshift barricades surrounding the small glen of natural stand trees in the middle of town, which seem unnatural lively..."},{"name":"Wonderbringer\u0027s Home","type":"Monastery and Temple complex devoted to Gond","description":" One of the less popular deities, not as explosive or sexy as some, but useful and interesting just the same, Gond the Wonderbringer has inspired the worship of many hundreds of thousands, of all races (but particularly gnomes!) over the centuries, and it is here, in this otherwise desolate valley on the Isle of Lantan, that an enormous and populous complex of worship places, workshops, storage caverns, clockwork arenas, and warforged enclaves exists, along with vast, trackless lost catacombs of wonder, and abandoned areas full of mystery and intrigue to defy exploration and classification."},{"name":"The Eternal Forest","type":"An ancient, dark forest","description":" A slowly expanding forest, that can never be destroyed. Trees can be cut down, but new ones appear in their place moments later. A great source of lumber, but not a nice place to be a lumberjack. Some say the trees are alive, others blame it on spiders that live deep in the forest. Whatever it is, no one stays in the forest very long, for fear of their life."},{"name":"Maegor","type":"The City of the Living Dead","description":" A black sun shines darkly in the soot-like skies above the city of the living dead. Inside the sharp, obsidian-lined walls a race of black-eyed beings conduct their business alongside undead servitors of various sizes and stripes. They, too, walk the fine line between life and death. The black sun radiates negative energy down onto the city empowering the undead and, according to some of the more aged carcasses, the dark light keeps the Crawling Cancer from breaking loose and infecting the rest of the daylight world."},{"name":"Arbold","type":"Small city, heavy trading route","description":" Arbold, near the river of Dase, is either a big town or a small city, depending on who you ask. The University of Arcane Arts has a small campus here due to the proximity to a trade route, where they buy (and sometimes, sell) magic artifacts and exotic ingredients. However, the old Governor is known to be an specieist, and non-humans are harassed by some of the Guards. The citizens usually disagree with his beliefs, but don\u0027t expect them to help you."},{"name":"Delego city","type":"A city up in the north","description":" This city is run by druids, who were so desperate for money, turned to casinos. After the massive success they turned it into a full time business. As a result they have become corrupt, and somehow still maintain their druid powers."},{"name":"Silver Mesa","type":"A city on a mesa top","description":" The best collection of inventors the world has ever seen, 132 years ago was the first convention of Silver Mesa. Every year since the convention has grown larger, to the point that it is now a city."},{"name":"GOMA Cleavehide","type":"A ruined castle by the swamp undergoing renovations","description":" The ruins of Alsgoroth, once a proud city, now a pile of rubble filled to the brim with undead. However after an assault from a group of adventurers they now claim it to be their home. They don\u0027t tell anyone this, but GOMA stands for Group Of Misfit Adventurers."},{"name":"Junk Palace","type":"A pile of junk that is 3 miles wide","description":" Once the Efreeti told everyone where they could throw their junk, they turned a barren wasteland into a thriving business. Pay to get in and grab as much junk as you can carry from dawn to dusk. If you are not out by the time the gate closes, woe be unto you."},{"name":"The floating ruins","type":"An island that floats across the sky, and is difficult to find","description":" The ancient city of the gods, floats aimlessly across the clouds. It is said that there is a tree there, that once planted grows solid gold."},{"name":"Shevorth Mansion","type":"A lavish mansion on the edge of the mountains","description":" The inhabitant, a desert elf from the east, is very rich and is interested in the collection of dragon parts. He has furniture covered in the scales of exotic dragons. He is looking to finish his collection of dragons teeth."},{"name":"Pelor\u0027s Church","type":"A church for the people, on the edge of town","description":" Run by the prophet Zenith, the people love him. He has preached how they will come out of the hard times, and asks for lots of tithing to achieve his gods will."},{"name":"Misfits inn","type":"Tavern","description":" Any and all are welcome here! You won\u0027t even feel out of place because our employees are probably weirder than you! We have our lovely lady dwarf who would love to spit in your food, but can\u0027t even see that high. We also have our beloved half-orc Harry, who is striving to be the best barmaid this side of town."},{"name":"Rizgardi Library","type":"A sunken library in the desert","description":" Sometimes the sands shift enough to show you the top of this ancient library from the Rizgardian era. There are certainly ancient texts here that could answer a lot of your questions."},{"name":"Steelbeard\u0027s Clockwork Tower","type":"Wizard Tower, used to be clocktower","description":" Ever since the Steelbeard, great and powerful wizard known for his literature, moved into the city, he stayed in his tower studying, but nobody knows what exactly is he studying."},{"name":"The Shattermap Expanse","type":"Magically Afflicted Geography","description":" A large forested region centered around the capital of an ancient and forgotten world power, whose sudden destruction was enough to shatter both time and space both in the city and throughout the surrounding area. The geography in this region is constantly shifting through space, and often through time. These shifts generally occur imperceptibly, but they become more frequent and more obvious the closer you are to the center, where time has frozen completely around the moment of the cities destruction. Those who enter the city can move perhaps needing protection, but everything around them is frozen and colorless. Armies fill the streets, citizens fleeing and dying. In the castle may lie the source of the disruption, or something worse that spawned from it... All of this is unknown to the modern country who claims the surrounding area. For them, the Shattermap is simply a large and inconvenient mystery, one filled with strange solitary fae and small groups of outcasts and fugitives not worth chasing after. A large road through the forest is maintained using large magical anchor-stones, which absorb and trap magic surges and any fae aggressive enough to try to step onto the road. These stones are discharged (and the emerging fae dispatched) frequently at great risk and expense. Every year the king tries to discontinue this costly maintenance, but the road is used by several powerful merchant families. And so it remains, despite the occasional anchor failure and the accompanying caravans lost into the maw of the forest."},{"name":"Dryllis\u0027 Branch","type":"Giant tree","description":" A gigantic tree that holds a large meeting hall at ground level. Somehow this meeting hall is no detriment to the tree\u0027s health, and everything indicates that it\u0027s grown this way naturally. The table in the middle and the chairs seem to be grown by the tree as well. Used by the wood elves for important meetings. Small dwellings for the sages and elders can be found higher up the tree."},{"name":"Sam\u0027s Sailing Shelter","type":"A sailing tavern","description":" A ship that does not comply with the standard of trade or military use, this large sailing ship is more like a cruise ship. The owner, Sam, sails from location to location and transports passengers for a small fee. It can easily hold a hundred passengers and still have room left for personnel, supplies and entertainment. On-board facilities include a brothel, showers, gambling hall, training room and arena, restaurant and much, much more! The restaurant usually serves some kind of fish."},{"name":"Cutthroat\u0027s Slum","type":"Town district that isn\u0027t what it seems","description":" This part of town is rumored to be filled with beggars, murderers and other scum. A first look around when entering this district might confirm that belief, but if you stay for a bit longer and earn the trust of the locals you\u0027ll eventually get to the truth. The people living here are actually part of an underground resistance against the local tyrant. Underneath the layers of filth and gruffness one can find friendliness and assistance. This part of town is also home to the black market."},{"name":"Cydonia\u0027s Warehouse","type":"A temple in an abandoned warehouse","description":" While this may look like a normal warehouse near the docks, it holds a temple to Cydonia. The priests and believers follow her teachings; to steal from the rich and give to the poor. Their sneakily-obtained loot is stored in this warehouse and divided amongst the people later when the time is right. The stolen money is also used to fund food and drink for their members. It has no special features other than blending in with the nearby warehouses and a hidden connection with the sewers."},{"name":"The Bastard\u0027s Barrell","type":"Tavern/Brothel combination","description":" This bar is full of the scum of the Earth and piss water ale. All the same, you\u0027ll be hard pressed to find a place to sit because the drink is cheap and the girls are just good enough keep the masses coming back."},{"name":"The Jagged Saw","type":"Mountain Range","description":" Deep mountains rise to a razor spike amongst the clouds. The traveled path curves amongst ravines. Caves dot the mountain side, though most remain empty. A few are inhabited by goblin/orc war parties from the nearby region. Giant Spiders also lurk in the darkness of the ravines. Though the path is dangerous, it\u0027s the shortest route between two large towns, so many caravans take the risk of the journey then spending days going around."},{"name":"Unification City","type":"Capital city","description":" Unification City is the centerpoint of the human-elf-dwarf alliance, and is the largest city in the continent. It is dotted by massive skyscrapers left by a long-dead race, and surrounded and lined with a train system that quickly and efficiently transports citizens to their destination. The city, as well as the alliance, is ruled by a theocratic council of three humans, three dwarves, and three elves."},{"name":"Web Monument","type":"Monument trap","description":" What appears to be a monument built by an ancient civilization is actually a trap set by a particularly intelligent spider. The monument, which appears roughly similar to Stonehenge, is held together by nearly-invisible web and used to lure the curious to their demise."},{"name":"The Queen Boiler","type":"Steamboat","description":" The Queen Boiler is a steamboat that ferries wealthy passengers up and down dangerous rivers. The captain is known for placing the lives of his passengers before his own."},{"name":"Ridgecrest Barrow","type":"Kobold nest","description":" This former burial ground was turned into a kobold nest when the Dragon Queen Lady Guura decided that it would make an opportune location for commerce. The barrow\u0027s original gloom is covered by the kobold\u0027s obsession with shinies. The kobolds of Ridgecrest Barrow are peaceful but tricky. It is rare that a traveler enters without leaving with lighter pockets."},{"name":"Marrath","type":"Anarchic Abandoned City","description":" Marrath is the kind of place you go when you need to dump the bodies, and for very few other reasons. Built into the bottom of a large crater and long since deserted by the Dwarves when the seemingly rich silver veins beneath the city dried up, it now plays host to everything under the sun. Wary humans mix with cutthroat goblins, territorial Orcs and a few dangerous races from the Underdark. The city\u0027s main attraction is that it is an almost direct route down to the depths below, where rare creatures, forgotten secrets and valuable treasures await the daring."},{"name":"The Dark Side Of The Moon","type":"The Ronsil of locations","description":" More than just the other half of a celestial body, since it became host to Lu\u0027Nahan the Shadow of the Stars this has become a realm where the shadows of nothing roam. A Shadow of Nothing is a thought without purpose, an idle daydream given flesh by Lu\u0027Nahan. Plucked from the mind of one who suspects nothing of his influence and shaped for their ineffable purposes. On the Dark Side of the Moon these shadows are most plentiful, where their Lord of Cold resides. Though it seems to desire the heat and light of the world the sunlight will burn them and so he lurks in this dark place, waiting for the day he will descend."},{"name":"Justice","type":"Arena","description":" Beneath Grimehold Prison is Justice: a room fifteen feet wide, twenty feet long, and only six feet high. Its walls are earthen, its floors the same but beaten solid by countless footfalls. The low ceiling is made of wooden beams. Three trap doors are built into the ceiling: one at each end, and one in the center. Combatants are dropped into the room and made to fight to the death. The winner is freed and the loser is cremated."},{"name":"Jama\u0027s Solar","type":"Private Chamber","description":" Jama\u0027s solar is the highest chamber in Jama\u0027s tower. It is private. No one but Jama has entered it since the monks took possession of the castle. The square 15\u0027x15\u0027 room features a trap door, a north-facing window, a leaky roof, and a hearth. It is adorned with a small bookcase, a long wooden table covered in maps, an altar, and a dilapidated chair, as well as a few barrels of brewing mead."},{"name":"The Ginger Cat","type":"Brewery","description":" A halfling run brewery. Focus mostly on wit beers. All are welcome in their tasting room, but entrance to the brewing parlour is By Invitation Only. The establishment is frequented by a large ginger cat who has a knack for predicting trouble."},{"name":"Farmur Lobstones\u0027 Potatoe Farm and Apothakrey","type":"Farm","description":" Hob and Lobelia Lobstones are kindly folks, though no one seems to be able to tell if they are gnomes or halflings (some have even \"joked\" that they \"might be goblins\", which is surely laughable, yes?). Their potato yield is tremendous every year, with many potatoes growing to the size of melons. Aside from potatoes, customers can purchase here a number of potato-based elixers and remedies including \"eye-stane\" and \"spud-dato\" and \"tuber-draught.\" It\u0027s unclear what any of these elixers do."},{"name":"The Mushroom Hole","type":"Hole","description":" It\u0027s basically just a hole full of mushrooms."},{"name":"Sad-Crow\u0027s Nest","type":"-","description":" The Sad Crow is out, but for how long? The nest is neat; twigs and sticks and branches and trunks arranged in an impossible, impeccable vortex. In the middle are lackluster feathers. Broken eggshells, sticky with dried darkness: caustic, pungent. The crying has started, so it\u0027s time to leave."},{"name":"Oakheart Thicket","type":"Dryad grove in the middle of a city","description":" This grove consists of a great oak home to a very old and powerful dryad, surrounded by smaller oak trees with lesser dryads in them. The grove forms the heart of the elf/human city of Oakheart, who quite literally is built around the grove to protect it. The old dryad is calm and benevolent, and her and her dryads often take an active role in governing the city."},{"name":"Mo\u0027goro Stronghold","type":"Orc Stronghold","description":" A large palisade and several watchtowers surround a large stone fortress, all located on a cliff, with the banner of One-Eye waving from the top. Several rotting elf heads are placed on spears inside the fortress, where orc warriors relentlessly spar against one another. Two ogres are kept in chains, but look rather well-fed and content with their existence."},{"name":"Tabith","type":"Inconspicuous human town","description":" Housing 400 halflings, humans, elves and others, this town has a well-known inn and a bustling economy, trading often with larger cities near it. On the last full moon of spring and the first of autumn however, the Tabithians celebrate the coming and passing of summer in a big way. Everyone gets drunk on magical ale created by the town innkeeper, a druid, causing them to partially shift to animal form. A bunch of satyr are summoned to strike up the band, and the party continues in hedonistic fashion for an entire week. Quite a few babies are conceived during these feasts."},{"name":"Uglstrup","type":"Frost giant town","description":" This rather large town, the largest in the area, is filled with huge wooden houses with thatched rooves, and lies near the coast. The frost giants who live here rely on fishing, hunting and farming (during the summer) to keep themselves alive, but often go hungry, bored, or both due to the harsh living conditions, at which time the Jarl of Uglstrup sets out on his longships to raid the \"weaker races\" who live in the lands to the immediate south."},{"name":"Apothecary Mountain","type":"City and Landmark","description":" When the gnomes settled this towering mountain, they discovered the \"screaming spirits\" within the first week. Undeterred by the superstitions of other races, they determined that the \"spirits\" were actually large pockets of natural gasses that were trapped under the mountain. By the second week, they had determined that the gas escaping the natural vents in the mountain was flammable. By the third week, they had set up shop. Turns out, the gas provided a near infinite supply of natural heat, the mountain provided shelter, and the industry of the gnomes provided the clean conditions necessary to harvest and utilize the alchemical ingredients of the surrounding jungle. Thus, the City of Alchemy was born, and it\u0027s production inspired the vast trade networks across the southern jungles. The gasses are directed and used to heat massive vats and boiling chambers filled with various bubbling substances both magical and mundane. The entire city is kept well protected, and outsiders rarely see inside. This has led to the propagation of many mysterious rumors about the mixtures and experiments happening inside the mountain, both malicious and benign."},{"name":"The Salted Pork","type":"Tavern/Inn","description":" Often here you can find Halfings drinking and smoking. They\u0027ve just come from a grand adventure and are enjoying some well deserved leisure time. For a pint they are sure to share their story. However, they always seem to finish their drink on a cliff hanger, until another ale is brought."},{"name":"The Bristled Grisly Brewery","type":"Brewery","description":" A large bear of a man with a 3 foot brown beard and a prickly demeanor owns and operates the brewery. No one knows more about wheat, grain, barely, hops or ale than he does. If you insult him he will challenge you to a taste testing. He gives out quests to find rare ingredients to those he likes(or more accurately, tolerates)."},{"name":"Nuna\u0027s Garden","type":"Shrine of Glass","description":" In the quiet town of Leaflorn there stands a garden shrine for the folk hero \"Nuna\"; a recently passed alchemist that aided the townspeople with cures and poultices. Within this small garden beautiful flowers grow and a great tree has stood for years. The people of Leaflorn seem unconcerned that the bark of this oak is almost entirely transparent. The people also seem unconcerned that they themselves are beginning to fade."},{"name":"Tower of laughing Hob","type":"Tower","description":" Abandoned tower in the derelict portions of town. Locked by the rulers of the city for being \"unsafe\", many a tale is still told amongst the beggar children that if you place your ear up against the door, you can hear the faint sound of giggling children. If the party manages to enter the tower, they discover the interior is decorated all around by stone gargoyles that spout water from their mouths. The sounds of the water hitting the pool at the bottom of the tower echo around the tower causing a distorted sound reminiscent of a giggle. The adventurers must be careful ascending, as the stone stairs are very old and will give way under heavy stress."},{"name":"Laugathon\u0027s Litterfree Library","type":"Library, currently in use OR abandoned","description":" Wow, this library is INCREDIBLY organized. I mean really- the rest of the mansion is in shambles, and clearly hasn\u0027t been visited for years. Come to think of it, there aren\u0027t even any bugs in here... (Anything that falls to the floor is instantly put back on its shelf in its rightful place; trash that falls to the floor vanishes. Anything that needs to be studied must be placed on one of the rune-inscribed tables, otherwise it\u0027s put back immediately. This could range from an in-use library with some flavor to an abandoned library in an ancient manor, where anything that touches the floor simply vanishes...)"},{"name":"The Struggling Juggler","type":"Tavern","description":" A small but busy tavern near the heart of the city. It\u0027s a little overpriced, but the owner is more than willing to make sponsorship deals with adventurers in exchange for a discount."},{"name":"Old Stefan\u0027s Shack","type":"Farmhouse","description":" A ratty little shack on the outskirts of town. It changes hands every couple years or so; the current owner is Old Stefan, who didn\u0027t have anywhere else to go after his wife kicked him out. People say it\u0027s cursed, but that\u0027s crazy talk. It just happens to be on the edge of a werewolf-infested forest."},{"name":"Trisha\u0027s Tarts","type":"Pastry Shop","description":" People come from all around to taste the wonderful things baking in Trisha\u0027s kitchen. The smells wafting from within are absolutely delicious! It is strange that the building is in the middle of a cemetery..."},{"name":"Where in the Hells are we?","type":"You get a feeling of peace as you approach the fountain of the Goddess. The hum of the city streets seems to go silent as you take that first step up to approach it.","description":" Last week, we made some unholy dungeons, so to maintain balance, let\u0027s collect some holy places. These locations could be officially sanctioned holy sites, sites revered only by locals, or places where men and women of the cloth gather for prayer or socializing. The locations do not have to be developed deeply, but they should have enough suggested content that any DM could easily drop them into his or her world. I\u0027ll post a few examples."},{"name":"The Tempered Hare","type":"Blacksmith","description":" The regular beat of the smithy\u0027s hammer, the creaking turn of the water wheel, the murmur of shop talk on a busy day; The Tempered Hare is known by locals as a place of loud, clangorous peace, and it\u0027s not uncommon for the back room to host a game of draughts during a long summer\u0027s afternoon. The Smith himself - one Pitor Longshanks - always has a kind word, and has no trouble keeping conversation if you can stand the heat of his furnace."},{"name":"Urthgroth\u0027s Fall","type":"Battlefield","description":" In life, Urthgroth was a mighty Chieftan of the fractious Northern Warholds, renowned for his prowess with the greatspear, feared for his unwavering sense of destruction. In his final campaign, he laid waste to every village he came upon, at one point marching three days out of his way with more than a thousand Orcs to burn a coastal fishing town to the ground. In the end, he was felled by a pitchfork thrown by a desperate peasant in a wheat field, and the lingering nature of his gradual death gave him a level of retrospection he\u0027d rarely been afforded in life. After being raised into undeath by the camp necromancer, he devoted his brief lichdom to reuniting the Orc tribes under a banner of sustainable conquest, leading to a resurgence of the empire of old."},{"name":"Sunshale","type":"Desert Temple","description":" With deft flicks of their brooms, the lay monks sweep the encroaching desert sand out of the temple, weaving overlapping, ever-expanding concentric circles. Each monk sweeps from sunrise to sunset (or sunset to sunrise), murmuring quiet prayers throughout, pausing only at noon and midnight to take simple meals of rice porridge and steamed fish. Those who aren\u0027t sweeping sleep, pray, and participate in a simple bathing ritual in the heart of the temple. Very occasionally, a caravan of pilgrims will visit Sunshale, at which point the monks pause in their ceaseless guardianship, opening the gates that seal the cisterns buried deep beneath the sandstone foundation. The water that flows forth follows the shallow paths worn by generations of sweeping monks, and for an ephemeral moment the name of a forgotten God is carved in stone, only to sublimate in the desert wind a heartbeat later."},{"name":"The Godslaughter / The God\u0027s Laughter","type":"Tavern","description":" Legend tells of a Paladin - stout and faithful - who fell under the spell of strong drink. His God (everyone says it\u0027s theirs) chastised him for his excess, and demanded penitence. Drunk on the spirit of the grape, the Paladin forsook his Deity, nailing his holy symbol to the lintel above the door in the alehouse he had taken as his own. From that day onward, the establishment was known as The Godslaughter, a profane challenge to any who would avenge the breaking of the sacred oath. The Paladin (if he ever existed) is long gone, but the holy symbol is supposedly there if you care to look for it. The other legend, told by the smiling woman at the end of the bar, is also of a Paladin. But rather than forsaking his oath, he traded his warhammer and golden raiment for a jug of ale and an apron. Not all souls are saved through glorious acts, she says, or through the business end of a sword. Some simply need a listening ear, a friendly smile, and a bout of honest laughter over a bit of mulled wine."},{"name":"The Wren","type":"Ship","description":" Her make is hodgepodge - Eastern bow, a slim Northern line, masts and cabins hewn from dark Southern wood - with a crew just as diverse. Ne\u0027er-do-wells? There are a few. Just as many brigands, and a rapscallion or two for good measure. But the cargo she ships is honestly obtained, the captain a niece of a family of some small fortune. If you were to ply the seas from Luskan to Baldur\u0027s Gate, you\u0027d find a dozen like her. Still, those who book passage in her cramped guests\u0027 quarters ask for her by name on the return trip. When the actuaries see her name in insurance ledgers, they give her a favorable rate. The wind blows her way more often than not, and during a storm her canvas may tear, but it\u0027s never more than an hour\u0027s work to repair it. Some credit her namesake - Wrens are known to be a favorite of Tymora, and even in the depths of winter a mating pair nest in a snarl of rope in the forward rigging."},{"name":"The Goddess Fountain","type":"Urban Fountain","description":" The marble Goddess Fountain sits on a raised stone square just a few blocks from the docks, and depicts the Goddess pouring water from a pitcher into a basin. The fountain is a place of peace and prayer. Upon stepping up to it, you can\u0027t help but feel restful. To speak in the presence of the holy waters feels sinful. Pious elves sing soft hymns or whisper prayers, their words blending with the gentle splash of water as it splashes into the Goddess\u0027s basin and overflows to the pool below."},{"name":"Brightharbor","type":"Elvish Town","description":" Located on Sunset Isle, Brightharbor is the largest remaining elvish settlement in the world. The lower part of the old city is still a busy town, full of traders and crafters of many stripes, where small carracks and cogs do a deal of trade with the Western cities. The upper part of the old city is a nearly abandoned, peaceful ruin. Its beautiful stone houses overgrown with vines and flowers with a few residents tending small gardens and vineyards. Ancient Westerlings believed the gods themselves dwelt in Brightharbor."},{"name":"The Grey Goat","type":"Tavern","description":" Near the Temple District is this lively tavern. It\u0027s a favorite haunt for monks, priests, and priestesses of the temples that allow drinking (and of the temples that do not). Lively debates of philosophy, history, politics, and mysticism can be overheard. Every new moon, the proprietor opens a cask of imported elvish wine and serves it at the regular price of two silvers per pitcher."},{"name":"Baldrim\u0027s Vale","type":"Ruined Dwarf-Hold","description":" In a secluded mountain valley, unreachable except by one narrow mule-trail from the west and one narrow, rocky stair from the east, Baldrim\u0027s Vale was once a small, prosperous dwarf-hold ruled by Clan Greybeard for centuries. During the Fourth Hunting, the old Empire had fallen in such disarray that no warning reached Baldrim\u0027s Vale before Westron sellswords and thugs fell upon the hold, putting the town to the torch and slaughtering those attempting to flee. The raiders carried off what dwarvish treasures survived the fire. Now, the ruins of Baldrim\u0027s Vale are a site of grim pilgrimage for dwarves seeking answers to the tragedies of their people."},{"name":"House of Angels","type":"Brothel","description":" Located down a narrow but well-lit alleyway in the Temple District is this richly-decorated house of pleasure. Catering to priests and wealthy merchants, all clients must first be bathed in the \"Holy Font\" before being robed in silk and introduced to the residents. The residents are all beautiful, young, skilled in the art of love, and well-paid. The girls are taught to read and write, to sing and dance, to play the harp, and to sew. Once a girl reaches the age of twenty-three years, she is given a bag of silver and is turned out to seek her fortune. Some of the \"Angels\" marry highborn clients or are kept as mistresses, some become priestesses within the temples of their favorite clients, and others go on to establish themselves as professionals (courtesans or other trades)."},{"name":"The Shadowseer\u0027s Tent","type":"Lowly Residence","description":" On the outskirts of the village, an old crone with a bent back and who walks with a bent stick holds court in this flimsy structure of hide stretched over a half-dozen posts. Inside the tent, the only furnishings on the earthen floor are a straw mat, a firepit, a few claypots, a small pile of animal bones, and a large sack full of odds and ends—things she uses in her rituals to call on the dragon gods. When storms rage along the coast, the villagers mutter that the tent may blow away, but once the weather calms, it\u0027s still here and so is the occupant."},{"name":"The Dome of the Sun","type":"Enormous Temple Complex","description":" Rising hundreds of feet about the heart of the city is the shining, golden Dome of the Sun. A team of a twelve of the sunpriest\u0027s slaves scrub and polish the gilded brick roof, so that it shines from leagues away, a beacon of flashing light that guides travelers to the city from afar changing from red to yellow to white to pink as the day burns. Beneath the dome is the largest ceremonial chamber that features a pair of east and west circular windows of golden glass, each larger than even the merchants\u0027 houses, through which sunlight shines brightly during the sunrise and sunset prayers."},{"name":"Jaythan\u0027s Spring","type":"Wilderness Grotto","description":" A Holy-man, Jaythan traveled among the forests between villages removing curses and healing sicknesses. In a remote section of Redleaf Forest there is an outcrop of stone that had once been part of evil sacrifices. After Jaythan purged the area and struck the stone with his staff, there is now a spring gushing forth from from the spot. The spring cascades down into a pool which has a single tree growing next to it. Locals visit this pool to tie a torn off piece of their clothing to the limbs of the tree in prayers of supplication, and remove a piece of cloth a previous visitor had left to take back with them as a talisman to aid in answering of their prayer."},{"name":"The Moonshine on the Path","type":"Wayside Temple","description":" Travellers on the path to the nearby village are always delighted when they stumble on this clearing in the woods and the temple standing there, its door adorned with a silver plate that, should the moon not be up in the sky, gives a friendly glow in the night, just enough not to stumble on the way to the dormitory, where they can get a bowl of porridge before a well-earned rest. In the morning, they will awaken to the sound of one of the regular ceremonies, maybe refill their stock of herbs for a small donation, and leave a little more at ease."},{"name":"The Shrine in the woods","type":"Artifact shrine","description":" After a long life of endeavour, an old priest has built a small shrine in the woods for the discovery of his life, an artifact of the god of nature. Here, it fills the sorrounding trees and meadows with sparkling life, while he trains his apprentice to follow in his footsteps of pious guard - but is the boy listening?"},{"name":"The shielded reliquary","type":"Streetside shrine","description":" While the overwhelming majority of this towns inhabitants pray to other gods, some come to this reliquary, little more than a small statue, a place to kneel and a roof above, to gather faith and maybe forget the hostile hubbub outside for a few precious moments."},{"name":"Shrine of the Dragonturtle Shell","type":"Swamp clearing","description":" Lizardfolk have long held great reverence for the dragons of the world, unlike other races who seek dragons for power, glory, or riches. Centuries ago, the lizardfolk shaman of a local swamp tribe discovered a dying dragonturtle and thus prepared her body for the afterlife. In death, soft peat moss has grown over the the great dragonturtle shell which is circled about by mangrove trees. Today, lizardfolk bring their unborn young here to be blessed in ancient rituals and once the egg has hatched, a shaman will carve and decorate the empty egg with ornate images and sacred prayers then place it in the shrine for good fortune and a healthy life."},{"name":"Bedrock Farms","type":"Farm","description":" A large farm in the middle of a city. Easily enough open field to house 1000 people comfortably. The owner (an old fighter), has refused and rebuked every attempt to acquire the land, and continues to comfortably grow cabbages and corn."},{"name":"Shadowrim\u0027s Dawn","type":"Hidden Grove","description":" The climb takes hours and is always done in darkness to boot. Shadowrim looms over the valley to the west and has always darkened the deep vales, the short growing season allowed by the cold made even shorter by the meager amount of sun able to touch the earth each day. The folk of the vale worship Lathander, more in supplication than in gratefulness, I\u0027d thought. Then Maura took me up to the grove. After waking in the middle of the bleedin\u0027 night, she urged me on up rock faces near vertical at times. Just before dawn we came to a breakaway near the top of the face. Inside was open to the sky, with a tiny grove of plants and trees surrounding a wide flat bench. I sat with her on the flat stone in among the grasses. She pointed out through the hole we\u0027d crawled through, and as I looked, the sun rose over the pass between the Eastrun range and Gauntrym\u0027s dagger. It shone on our faces like the gods\u0027 love itself. It would be an hour before sun touched the town below, but for that time, we bathed in the glorious light."},{"name":"Hallmark Road","type":"Trading route/Main Road","description":" Long ago the kingdom that this road lies within was nearly defeated. With naught but 1 of their cities remaining, they prayed for a miracle. And a miracle was given. Sweeping along their lands, were 7 massive ancient Wyrms, burning their foes, and a single solitary Platinum dragon soaring above the clouds, barely visible. With renewed vigor the kingdom rallyed and charged, regaining their land, and slowly over many centuries the land healed. This road stretches from the last standing city, to the final city that was reclaimed. Along the roadside is a flag for each city and town retaken, and at the end of it 7 golden flags and a platinum flag, blowing in a neverending breeze."},{"name":"The Traveling Maze","type":"Wondrous Area","description":" A large hedge-maze. It moves with surprising speed, traveling more than 20 miles in a day. Rumor has it at the center of the maze is an ever increasing pile of treasure, however it cannot be accessed by magical means. Attempts to cast flight, dimension door, and most if not all other transportation and flight spells result in the magic being wasted. The same goes with attempts to polymorph, or beastshape into something capable of flight."},{"name":"The Octagon","type":"Inn","description":" A very popular Inn, very out of the way. The owner is an immensely muscular half orc. 5 times a day the tavern selects their champion, and him and the owner jump into the ring in the center of the tavern. If the champion wins, the whole tavern gets a round. To this day there have been 2 victorious champions. Perhaps your big friend there can win us a round?"},{"name":"The Ironwine Pit","type":"Tavern","description":" Somewhere hidden in the back alleys of the city you can find the Ironwine Pit, an old, rundown tavern like so many others. Old, creaking wood, an old fire place, a slightly crooked bar and an unfriendly human barkeep, all surrounded by shifty characters, scarred or hooded or both. But the actual heart of the tavern is hidden deep beneath the ground: the Blood Pit. An ancient arena of fighters long dead and champions long forgotten, fighting for glory, for gold and for faith. Originally devoted to an old goddess of strength and power, it was rediscovered by artists of the fist and blade, to be put back to its old use. All hidden from the city watch above."},{"name":"The Gleaming Fort","type":"Monastery","description":" On the edges of civilization, between treacherous mountains and wild, dangerous forests, lies the Gleaming Fort. Built high onto a peak, its golden roofs and the gems embedded within glisten in the sunlight and glow at night. Monks of all orders live here to watch over the towns at the feet of the mountains and to protect the lands from the dangers coming from beyond the explored world."},{"name":"Warden\u0027s Hill","type":"Small Island","description":" \"See that tiny dot in the middle of the lake? That\u0027s Warden\u0027s Hill. And let me tell you how glad I am that it is right there. You see, the borders between the planes are thin in these parts. We\u0027ve had our fair share of monsters and planar storms run through here throughout the ages. If it wasn\u0027t for that tiny island and the Warden\u0027s Bell, this town, and every other town at this godsforsaken lake, would be dead as a desert. That\u0027s why we send food over every week. I heard they need fifty men and an iron-capped tree trunk just to ring the bloody thing.\""},{"name":"Brightlodge","type":"Keep","description":" Golden keep closely resembling a cathedral. The paladins reside here, and it is blessed by the gods. This keep has never been taken or overrun, and will never be, so long as the paladins keep their oaths."},{"name":"House of the First Flame","type":"Dwarven Forge","description":" Inside, sweltering heat fills every inch of the building. A flame from the core of the elemental plane of fire is used to create masterful pieces by some of the best smiths from all of the dwarven clans. Worshipers of Moradin are known to take pilgrimages here to be surrounded by the constant clanging of hammer on metal. Edit: Formatting"},{"name":"Silbergarten","type":"Public Garden","description":" Paid for by generous donations from a dozen of the smaller religious organizations inhabiting the city, the Silbergarten is meant to be place of quiet reflection and introspection. In center of the garden, among the silver-leaved shrubs and trees that seem to always bear ripened fruit, stands a white, well-looked after gazebo, trimmed with spiraling patterns of gold and sapphire. There are never less that five gardeners looking after the plants, all volunteers. Many flock to the annual festival of lights held by the two largest contributing religious organizations."},{"name":"The Fountain of Dreams","type":"Forest Fountain","description":" Deep in the Canterbury Woods, lies a mythical fountain that allows for the drinker to delve into their previous lives. The fountain is protected by an elite force of faeries that tempt and test any traveler enticed by the possibility. The calm serenity of the fountain is earned."},{"name":"Library of the Damned","type":"Great Library full of Undead","description":" A great city fell to barbarian invaders, and while the battle raged, the librarians and staff of one of the worlds best libraries barricaded themselves inside the library in a desperate attempt to prevent the barbarians from destroying the collected knowledge contained within the institution. They had a collection of some of the rarest and most amazing tomes of knowledge and lore. The barbarians noted that the library was barricaded, and decided to set about destroying the rest of the town. They saved the library for last. Using great battering rams, they finally breached the front doors, and were greeted by an army of undead instead of scared library staff. Caught off guard, the barbarians were slaughtered to the last one. The library staff knew that the barbarians would breach the library eventually, and they would be no match for the barbarian horde. So, they paid the ultimate price to protect the library, by using a dark ceremony contained within one of the special books they kept off display and locked away in their vaults, they turned themselves into undead creatures whose sole mission is to protect their precious library. So, the library still stands, it\u0027s guardians being unable to be completely destroyed until the library itself is, but the library will not fall while they stand guard, and so they will guard it until the end of time."},{"name":"The Glittering Mine","type":"Underground mine.","description":" Former mine of the Stonewreath Clan this long abandoned mine stopped being working when the Clan vanished. It is now home to several religious orders and is held to be sacred by almost all. The precious stones are so near the surface that even slight amounts of light make the walls glitter like starlight which inspires the devotion to so many gods. It is large enough to easily accommodate all of them."},{"name":"Frozen Tree Temple","type":"A massive evergreen","description":" Located in the thick ice sheets of the worlds Poles this tree stands undaunted by the cold. Quite warm inside it is seen as sacred ground even by the beasts of the wastes. There was no hollowing out, every seeming structure inside is a natural growth. Plays host to the god of summer, nature and warmth."},{"name":"Lunar Mountain","type":"A small cave system with a hole through to the top of the mountain it lays below","description":" This small system of caves ends in an area with a hole above it, those uninitiated in local lore assume it to be nothing special. However on one night every year, at a specific time, the moon shines through leaving a trail of light to a stone outcropping not unlike an altar. It servers as sacred land to the followers of the Moon Goddess."},{"name":"The Creation Forge","type":"Eldritch Creation hidden somewhere hidden","description":" Long ago, the first Warforged were created here, wielding the powers of the Quori against the Giants. Constructs were imbued with life, sentience, and personality and were given the tools to assist those in need and those in the everlasting war against the Giants."},{"name":"Hyperion Falls","type":"Waterfall","description":" The silvery-blue waters of the river tumbles over an overhanging cliff, plummeting hundreds of feet to the canyon floor. Beneath the overhang, and behind the waterfall, there is a small shrine to the spirit of the Sun. Twice a year, the position of the Sun is such that it rises perfectly in line with the waterfall, appearing to climb the water, upwards against the torrent. At the Sun\u0027s zenith on each of these days, its light shines down the cascade, illuminating the whole column of water, and focusing a beam of light onto the shrine. The intense light sets a small, fuel-less fire atop the shrine that burns until the next sunrise. What few locals there are watch the moment when the Sun reaches its zenith, but visitors feel a compulsion to leave the small flame to burn through its solemn vigil in peace."},{"name":"Baths of Obscured Merriment","type":"Bathhouse","description":" Located in the center of the temple district, the Baths of Obscured Merriment has been the destination bathhouse for clergy and supplicants alike for as long as anyone can recall. In the early days, an enterprising young wizard took notice of the conflicting strictures of the different faiths of the city, and set about devising a set of enchantments that would protect clients from seeing anything they were not supposed to, or from revealing anything... untoward, while allowing for the socialization inherent in public baths. His work created a permanent fog around every bather, which would disperse or accumulate according to their desires, blocking varying amounts of sight and hearing. The current name of the establishment was decided immediately, and to this day holds true as folk of all faiths gather and socialize without fear of transgressing."},{"name":"What about that shadowy place?","type":"A single, dingy lantern swings on a rusted iron lamppost just outside the alleyway. You approach, back turned to the howling of the wind, and slide a single gold coin into a slot in the rough metal. A voice whispers from over your shoulder: \"So... What can the Thieves\u0027 Guild do for you tonight?\"","description":" Last week we did some elevated thinking, so let\u0027s bring it back to the seedier elements of society, far from any ivory towers. A collective of smugglers hiding in an abandoned warehouse, or maybe a gang of pirates precariously perched upon a beached ship. Any wretched hive of scum and villainy is fair game, here. The locations themselves don\u0027t necessarily have to be developed thoroughly; we\u0027re looking for places that could be dropped into any campaign by any DM. I\u0027ll provide some examples. Now..."},{"name":"The Wretched Ketch","type":"Dockside bar","description":" Built from the half-smashed hulk of a sailing vessel propped up against the cliffside, the Wretched Ketch gives even the seediest of taverns a run for their money. A dirt floor, dim lighting, and terrible alcohol characterize this watering hole for the worst of society almost as much as the terrible fish-and-excrement smell. At the very least, it\u0027s cheap--and the bedbugs are free of charge."},{"name":"Home Free","type":"Bolthole","description":" When one is in the business of liberating shiny objects from their rightful owners, sometimes it\u0027s necessary to go underground. Usually, one can get away with going to the next town over, or blending into a crowd. For the times when even those tried-and-true methods fail, you\u0027re Home Free. An otherwise unremarkable farmhouse in the middle of scenic nowhere conceals an underground vault, with preserved food, bedding, and healing supplies for three to four people. Just mention to the elderly couple above that you are \"Home Free,\" and they\u0027ll provide you with the key to the passage under the barn."},{"name":"Bitter Grin Cove","type":"Smugglers\u0027 Den","description":" Contrary to the name, Bitter Grin Cove is neither a cove, nor even on the sea at all. Instead, it\u0027s a series of abandoned dwarven warehouses, tunnels, and living quarters that a smuggling ring have repurposed for their own business ventures. Thousands of gold pieces\u0027 worth of ill-begotten goods pass through the Cove each week, and its low profile and misleading name help keep intrepid investigators off the trail."},{"name":"Harvand\u0027s House of Cheese","type":"Fence","description":" Once a legitimate business, customers who visit Harvand\u0027s looking for fine cheese will now leave a little confused. The cheese behind the counter is hard and cracked, and the man behind the counter wears leather armor behind his apron. But if you are looking to offload something that has a dubious history of acquisition, \u0027Harvand\u0027 will be able to help. And if you are looking to purchase, just ask, and he may have something for you at discount prices."},{"name":"Barrels Point","type":"Smuggler\u0027s Den","description":" Long ago a trading vessel foundered off the coast. Needing to offload weight, they dumped dozens of huge oak wine barrels into the sea. Now hoisted above the shoreline into the bushes, the remains of the barrels have been converted into a series of small buildings where smugglers may store goods and trade. They still smell pleasantly of aged oak."},{"name":"The Keyhole","type":"Thieves Den","description":" Privacy is hard to come by in the treeless frozen wastes to the north, so any cave is sure to by occupied, but the Keyhole is far from ideal. The only entrances are a narrow squeeze barely wide enough for a man, and a long drop down a rope from a ceiling hole 60ft in the air. Despite this, the Keyhole is warm, and furnishings have been brought in part-by-part to make this a relatively accommodating refuge for thieves and ne\u0027er-do-wells."},{"name":"The Angry Squid Tavern and Rooming Company","type":"Riverside inn","description":" this innocent looking inn on the side of a river is really a front to a smuggling ring, the inside is well kept and well lit, but the men the barman knows by name are not your average fisherman..."},{"name":"The Lord\u0027s Bridge","type":"Bolthole","description":" It\u0027s best not to think too hard about the architectural choices that led to the gap in the abutment of the Lord\u0027s Bridge, because in a pinch it makes for a great place to hide. The space inside is small but dry, and the entrance so cleverly hidden under the bridge that it almost looks as though someone has vanished into thin air."},{"name":"Deadfalls","type":"Thieves Den","description":" In the forest by this remote town lies a twisted tangle of fallen trees, bleached grey with age. The pile is impossible to climb over, but there is a way to pick a careful path under and through the logs and branches to the small hut beyond."},{"name":"The Museum of Curiosities","type":"Fence","description":" Anyone can enter the Museum of Curiosities (for a small fee). Within the huge room is crammed with objects, piled on the floor, slotted into shelves or hanging from the ceiling. Many are strange and interesting (stuffed sharks, a bone chandelier, books on invented creatures), but a great number are completely mundane. The proprietor, Varvick, is always happy to make new acquisitions without asking too many questions and hints that the items on display can also be purchased for a price."},{"name":"Summer Fair","type":"Black Market","description":" Despite it\u0027s name, the Summer Fair runs all year round. An eccentric noble loved the Fair so much, he invited it into the grounds of his Estate for free on the condition that it kept going permanently. Over the years, however, the purpose of the Fair has slowly changed and now besides the ordinary citizens buying snacks and enjoying performances, you can also find dubious stalls hawking even less legitimate goods."},{"name":"Patigan\u0027s Restaurant","type":"Thieves Guild","description":" When the head of the Thieves Guild enjoys the finer life, you end up with a place like Patigan\u0027s. Here Thieves can dine openly while they undertake negotiations, as the tables are widely placed in the large, decadent room, and there are plenty of private rooms available for more discreet meetings. The food is also excellent, and provides a good source of clean gold for the proprietor."},{"name":"The Blooded Leech","type":"Speakeasy?","description":" The bouncer is frighteningly well-armed, the bartender is aggressively indifferent to anything but cold silver, and the entire room seems to be built from nothing but moody back corners. But whisper the secret word into the ear of the right hooded stranger, and he\u0027ll lead you down a narrow corridor, out the back door, down a flight of stairs, and through the crumbling threshold of a derelict warehouse, where the man who sold you the password sharpens his long knife, waiting to relieve you of everything you own."},{"name":"Falter\u0027s Crag","type":"Mountain Fortress","description":" Built, abandoned, reclaimed, taken by force, and abandoned again, the old castle has forever been a stepping stone to greater, more important things. With none of the elegance of the lowland keeps, and with few of the defenses of the all-important valley strongholds, Falter has always served as a sort of waypoint, a staging ground for the next leg of whatever campaign it\u0027s been pulled into. Recently, however, an enterprising group of former highwaymen (who prefer the terms \u0027mercenaries\u0027 or \u0027sellspears\u0027) have occupied the old outbuildings and walls of the fortress, doing their best to make it somewhat presentable again. They\u0027re friendly enough to outsiders, and seem on guarded but cordial terms with the goatherds and herb-gatherers that roam the steep hills above the keep. But when pressed about why they\u0027ve taken up in the old fortress, or who employs them and pays for the growing supply of provisions and weapons, the mercenaries are carefully reticent."},{"name":"The Fox and the Butcher","type":"Grey Market","description":" You can\u0027t step into the Fox without somehow discussing The Old Proprietor, a businessman of impeccable taste and acumen, or so they say. Gallant. Chivalrous. Stalwart. On the wall above the till, the cleaver he supposedly carried into battle hangs from a bent nail, and when the draft kicks up from the harbor, it creaks back and forth in a rusty arc. What\u0027s strange is that there doesn\u0027t seem to be a new proprietor; the old woman who slowly wraps headless fish in brown paper certainly isn\u0027t one, nor the acne-scarred youth who sweeps the floor. Most don\u0027t seem to care, though - you can get things at the Fox that you can\u0027t get elsewhere, and they\u0027re always willing to buy low-risk merchandise. In the rare case that the constabulary come sniffing, The Old Proprietor\u0027s reputation (and a few silver) is almost always enough to send their search elsewhere."},{"name":"Grizzlegut\u0027s Boon","type":"Sellsword \u0026 Sailor Gathering Place","description":" Once the waterside home of Sea King Grizzlegut, this mansion now serves as a meeting place for mercenaries and their next line of work. Years of exploration and pillaging brought luxuries to the mansion, now decorated with exotic furniture, ornate artworks, and masses of intriguing texts. Sword and buyer alike can find respite in rooms built to house Grizzlegut\u0027s hefty crew."},{"name":"Underskin Watch","type":"Thieves hideout","description":" Latched doors open to a workshop saturated with the pungent odor of toxins and decay. Numerous chemists work at specialized tables speckled around the room, concocting every poison ever used in the folly of men. The Watch\u0027s visitors keep constant vigilance of every entrance and exit in exchange for the right to purchase the poisons of their choosing."},{"name":"Blackhall","type":"Regal Scumpit","description":" Each and every lord needs willing followers to do what he cannot, and so beneath every city lies a hall. A hall of black and cold, where loyal servants wait to carry out their next tasks. Separate from humanity, this hall houses secrets darker than the ones brought to it from the realm of men, secrets untold, but not forgotten."},{"name":"Roy\u0027s","type":"Dive Bar","description":" Welcome to Roys! Everyone here is called Roy. Cept the Bartender, thats good ole Barry. But everyone is called Roy that goes in. No one cares for your name outside the bar."},{"name":"Half Sunked","type":"Bar!","description":" Lord Bately ship, is just as stubbord as Lord Bately. On its last voyage, where it lost a part of its keel, and took on water. To only become irreparable once in sight of port. But it just got about half way."},{"name":"The Blue Oyster Bar","type":"Dockside Tavern","description":" A small, rickety wooden structure at the end of the Mill Street Pier, the Blue Oyster Bar is known for its fresh oysters, skunky ale, strong rum, and tales of the sea. If you want to hire a sailor, you should head to the city, but if you want to connect with a ship\u0027s captain, this is the place. Most of the best merchant vessel captains can be found here, but so can the best—and worst—pirate captains."},{"name":"The Plundering Dragon","type":"Dockside Inn and Tavern","description":" A half block up Mill Street from the waterfront is the Plundering Dragon, a warm place with a roaring fire and welcoming barmaids. The interior of this large inn and tavern is decorated with all manner of souvenirs brought back by sailors from the far reaches of the world. The girls are notorious for their wandering fingers, which easily find their way inside a man\u0027s purse. A joke goes that every feather, dress, seashell, spearhead, knife, and totem hanging on the walls has been \"twice-plundered\"—once from its native land and again from the sailor who carried it back."},{"name":"The Ox and Plowman","type":"Roadside Inn","description":" Travelers will find more welcome at the Ox and Plowman than from any in the nearby villages—filled with superstitious and fearful peasants. The two-story stone inn has a half-dozen rooms for rent and a cellar full of wine for drink. The owner and proprietor of the inn is a beautiful woman named Brynna who is rumored to be romantically involved with Jonan the Black Wolf, a notorious outlaw in the valley. Several ruffians who claim allegiance to the Black Wolf often come to eat, to drink, and to dice at the Ox and Plowman."},{"name":"Wreckrife Straits","type":"Smugglers\u0027 Run","description":" Between Cape Flounder Island and the mainland are the Wreckrife Straits, a winding and narrow path of rough waters that only the bravest or the most foolish captains will dare to sail. Rocks, reefs, and howling winds make this a dangerous passage even for small craft piloted by seasoned captains. Running the Straits cuts at least three days off the journey around Cape Flounder, a risk some smugglers are willing to take to avoid naval battles and to outrun rivals."},{"name":"Toad\u0027s Baitshop","type":"Riverside Storefront, Black Market Fence","description":" Toad\u0027s Baitshop isn\u0027t really the best place in town to go for live bait, fish line, and netting repairs, but you could do worse. However, if you\u0027re looking to unload something hot or to locate some stolen goods, Toad\u0027s is a good place to start. Old Toad is very discreet but stingy; he buys low and sells high. Ask him about his new \"sticky nightcrawlers\" if you want to see what\u0027s just come in."},{"name":"Tymon\u0027s Cooperage","type":"Workshop, Black Market Fence","description":" Tymon is as good a cooper as you\u0027ll find. He often has only a single apprentice at a time whom he assures you can trust. Tymon\u0027s shop has a cellar full of \"finished\" barrels awaiting shipment. Tymon has an unsual numbering system for each barrel crafted in his shop, a secret code of sorts, and he uses it to provide a \"holding service\" for local thieves. He rarely sells the stuff that comes into his shop directly, but his services are worth what he charges to hold things while the heat after a heist cools off. For considerably more, he\u0027ll even orchestrate a delivery of some \"finished\" barrels, allowing thieves to get their goods out of town without attracting attention from the constabulary."},{"name":"Meats and Meads","type":"Butcher Shop and Brewery","description":" Tucked away in a small unlit alley lies a rather simple looking establishment, pungent with the smell of rotting roasts and stale ales. Their primary export is their signature wine that bears a telling deep crimson color and a heavy metallic taste; many of the meats come in rather small lean cuts, uncommon for larger game animals. On occasion, people dressed in dark colors are seen dragging heavy bundles of cloth and fabric into the back of the store in the dead of night, only to leave empty handed."},{"name":"The Iron Maiden","type":"Armory","description":" A quick glance into the store would immediately leave you feeling cautious. Thorny sets of vicious looking armors stand on mannequins near the doorway, and a large selection of brutal weapons line the walls. You won\u0027t find any clubs or quarterstaves here, everything you see around you appears to be designed to draw blood, from notched whips, to morning stars, to vicious looking daggers. Various chains and shackles lie in bargain bins along the floor, and you may occasionally glance a bloodshot eye peering up from between the floorboards, or a muffled whimper from under your feet."},{"name":"The Widowmaker","type":"Gathering Hall","description":" A place where the ale never runs dry and the patrons are always in a good mood. At first glance, everything seems a little too neat, a place perfect to attract adventurers and wanderers. A giant board covered in job postings lies directly inside the door, and you\u0027ll notice that each of them ends with \"Please meet in the back for further details.\" Those who walk into that cellar never walk back out, and the job postings never seem to change, but otherwise it\u0027s a relatively safe place to eat, drink and be merry, though newcomers aren\u0027t recommended to frequent the establishment alone, just in case."},{"name":"Alchemist\u0027s Fire","type":"Apothecary","description":" The potions sold by the owner of the store are known to be functional at best, and the sickly pallor and various chemical burns along his exposed skin may be a little more telling. He wears an intricately crafted full faced mask in the shape of a bird\u0027s head at all times, and a dirty leather coat that bulges and stretches in odd places. It is recommended you ask to see his \"special selection\", as this is where his work really shines. Countless Poisons, Acids and deadly chemical mixtures of all sorts hide under his thick jacket, and he\u0027s open to any questions you may have about delivering them."},{"name":"The Kraken\u0027s Lunch","type":"Small seafood restaurant and bar near the docks.","description":" During normal hours they cater primarily to sailors and those that work the docks. Rumours abound however of shadier goings on once the lamps go off, however guards have never been able to prove anything."},{"name":"The Lost Cove","type":"Smugglers Den","description":" Off the coast of the nearby city, far enough where no one could easily see boats coming in or out lies a cove not on any map. Riches lay there waiting to be taken into the city and sold on the markets, brought in by merchants looking to offload cargo they could not otherwise sell and through more shady means."},{"name":"Emperors Jewels","type":"Thieves Guild","description":" Officially sanctioned, though never publicly mentioned, this guild sits behind a hidden door in the Imperial Gardens. They are led by The Faceless Man and given jobs by the emperor and other freelance contracts at their discretion."},{"name":"Stallion\u0027s Canter","type":"Fence/Tavern","description":" This mild-mannered-appearing tavern is actually a well known fence in the underworld. Using the right phrases and figures of speech, those in the know bargain with the fence (the barman), while appearing to discuss prices of drinks, food, bedding, and other accommodations. The goods are always left on the bargainer\u0027s horse, to be taken into a cellar by a \"stable hand\" after the bargaining is complete. Those ignorant of the tavern\u0027s true nature can enjoy an evening here, albeit at a higher price than they can expect from its nearby competitors."},{"name":"Dirty Meg\u0027s","type":"Chop Shop","description":" Dirty Meg is known for running a clean business, despite her dirty leanings. She gives fair deals and never cheats a customer, but knows when to ask questions and when to let things slide. She has an ironclad policy against squealing to the authorities on her clientele, but she\u0027s been known to dump a hot item at the customer\u0027s expense if the heat comes around."},{"name":"The Gilded Leaf","type":"Forest Tavern","description":" Many consider the elves to be graceful, elegant creatures nigh incapable of crime, and a first glance at the Gilded Leaf would confirm this suspicion. Built into a living tree, the Gilded Leaf seems warm and friendly, with smooth wood floors; a crackling hearth that burns with magical flame; and the smoothest wine an elf could ask for. Whisper the password (which you must coax out of a nearby fey) to the barkeep, however, and he\u0027ll direct you to the secret entrances leading to a thieves den built around the roots of the tree."},{"name":"Ectoplasm","type":"Sunken Ship Bar","description":" The treacherous waters of Baron\u0027s Reef has claimed many a merchant, navy, or pirate seeking a shortcut, leading to rumors of ghost ships and krakens pulling sailors to their doom. If you know the waters well, you can sail through the deadly rocks and half-submerged ships to Ectoplasm, a pirate hotspot built onto a massive partially sunken galleon. Whether you want exotic drink, thrilling gambling, or the finest (and only) wenches in the middle of the ocean, Ectoplasm has your vice."},{"name":"Cliffkeep","type":"Cliffside Fortress","description":" Hidden amidst the maze of canyons in the Sea of Sands, Cliffkeep is a secretive sandstone fortress built to serve an ancient guild of assassins. From the canyon floor or ridge, you can only see a few walls, windows, and buildings that sit about 150 feet off the canyon floor. However, secret tunnels and narrow, hidden crevices lead from the surrounding desert into the fortress, leading guards, bounty hunters, and armies to claim that their quarry simply vanish into the canyon. Cliffkeep is now the home of a marauding gang of bandits and thieves, but remnants of the assassins remain in secret rooms and trapped passages and vaults."},{"name":"Windún","type":"Mountain tavern","description":" Carved into the very rock itself, Windún is hidden from prying eyes and was once the proud place of rest for those who ventured toward the ancient dwarven empire of Yaar\u0027tag. Since the kingdom fell into disarray and avarice many winters ago, so too did its nefarious end meet Windún and corrupt its jovial character. Now, the tavern is a thieves inn where the most prestigious thieves and their orders congregate and sell wares to fences and the ever expanding under-market. The heavy smell of sweat and malted beer fills the air and as you enter, you notice faces lined with experience and scarred with villainy."},{"name":"The Pit","type":"Slave market","description":" Where winding, narrow alleys writhe gnarled through the city, here is that place where old wives scare children with tales of slavery and chattel. The Pit had always been a place of unrest and was first a gambling den. Over time, the stakes rose and the bets became higher. There are still games played today where the scum of the land laugh and drink whilst their property is beaten and shoved between new master and old. For the most part, clothed in rags and held by rusting chains, the slaves stand silently at the market, waiting to be bought and hoping to be freed."},{"name":"Ganga ni Wana","type":"?","description":" Compared to most places, the Wana seems relatively tame, albeit remote and some several miles from the nearest settlement. Drinks flow and the rich smell of food wafts over the tables. There is drunkenness and lechery abound, that is true. Yet it is usually no worse than any other tavern or inn by its debauchery. There are rumours, however, on what happens past the twilight hours, when most have left for their homes. A few new patrons stay behind, lured by the drink and other inviting pleasures. And some wandering travellers have claimed that in the quiet, bloodcurdling screams pierce through the silence before fading into nothing once more."},{"name":"Yduro","type":"Docklands","description":" Meandering walkways and streets that twist inward and crumble near the sea, the heady smell of fish lingering in the air and the shouts of fishmongers. Nobles, profligate and drunk, sprawled on the street and there is a metallic taste to the water around here. Yduro has steadily declined as multiple decrees have stifled its trade to other docks. Its good heavily monitored once they leave the area, the locals have turned upon each other, scrapping for every morsel of good food that now seldom comes through here. Poverty and starvation reign and they have engendered much sin of late."},{"name":"Ofþrycca","type":"Nefarious chemist","description":" Run by the dubious apothecary Ranwyn Oltarn, the little shop nestled within the sprawling alleys of the city is known to many as Ofþrycca or Oftha to the commoners. At any time of day, a thick, coloured smog emanates from its doors and the overwhelming smell of strange herbs chokes the street. Oltarn is rumoured to experiment on his patients, concocting strange recipes that detractors have accused makes the \u0027victim\u0027 suffer from a deep depression and a wasting sickness. There are some, in the darker underbelly of society, who swear by Oltarn\u0027s brews, claiming it gives them heightened awareness and prowess, if only afflicting them with strange visions at times."},{"name":"Dorgadoon","type":"Disused bell tower","description":" Currently inhabited by bandits and rouges, the Dorgadoon was once a majestic bell tower that called those within the Barony of Corval to prayer. A ruined church lies at the hard, stone base of Dorgadoon and every year, a lone pilgrim makes their march to the place, laying a single flower where the altar once stood. Who they are and why they do this is unknown and the Grasping Hand who inhabit the place now could not care less."},{"name":"The Watch","type":"Cultist church","description":" The Watch has long been a font of rumours and farmer saws. Shrouded in mystery and perched atop a cliff overlooking the sea, its first inhabitant was said to be a necromancer who had died many winters ago. In reality, the cult that had formed around him keep his life permanently upon the edge of death; it is believed by the Watch that the greatest secrets of necromancy are learned in this way and thus, his sallow corpse wheezes with the final vestiges of life, desperate for death but unable to grasp at it."},{"name":"Sangava","type":"Smuggler\u0027s stall","description":" Each week in the market square, a lone stall sets up and seems to sell almost nothing of worth. Some odd trinkets here and there and a few wrapped meats but, in all, unremarkable and this is precisely how the Sangavi like it. Carefully choosing their clients, the Sangavi have developed an extensive trade network formed through intense trust and brutal reprimands. And so, a few hours before the weekly market, a tunnel is dug beneath the stall\u0027s desired location and goods from strange and forbidden lands funnelled through. As silently as they arrived, the tunnel is sealed and the Sangavi merchant heads home once more."},{"name":"Black Flagon","type":"Inn and tavern","description":" A tavern buried within the poor district, the place is almost always visited by those who live in the area. The gentry believe the place to be fairly unassuming and allow the Flagon to proceed unchecked, believing it provides some relief to the commoners. In reality, the Black Flagon is the home of Fayvel\u0027s Own, a band of vagabonds and rogues who steal from anyone and anything. Rough and rowdy, the tavern is in a state of disrepair and it doesn\u0027t look as if it will be improved any time soon. Sodden clothes, wet with sweat and mead and stale fish linger in the air. Originally reselling artefacts and wondrous items, Fayvel\u0027s gang have become increasingly adept at hiding in plain sight and blending in with the nobility, such that they now sell information too. Their most recent exploits have uncovered some troubling news."},{"name":"Grog.","type":"Tavern","description":" The innkeeper of Grog is direct and to the point, as is perhaps evident from the name of his establishment. Heldar Tharynn is a stout dwarf who dislikes long conversation and is motivated by a certain sort of greed. Unable to competently fight any longer, Heldar pays good coin and provides free food and board to those who return with a sizable treasure from the elder dragon Y\u0027ntaraj for reasons unknown. Inevitably, word of this has attracted a certain sort of customer and many patrons of Grog often discuss how to reach the lair of the beast and slip past unseen. As of yet, very few have returned alive."},{"name":"Whispering Lady","type":"Information Source","description":" Nestled in the middle of the docks is an aging but clean building, once inside you are greeted in a small waiting room by a well dressed servent. If you have the coin you can go in and be seated at on of the many private tables, and booths in the building, or for a \"small\" fee the maitre d\u0027 will take you to one of the semi-permanent residents tables so you may buy, or sell information. Additionally this is the perfect place to meet informants, broker deals, or pass information, as the owner has made sure it is protected from all forms of divination and has standing agreements with both the City guard and the thieves guild for protection. Your Secrets are safe here."},{"name":"Dancing Bear","type":"Hell(AKA dive bar)","description":" Clapboard coats the outside of the building, each piece seemly put there at different times, the windows have no glass but rather have waxed cloth coverings, the cloth itself torn and patched. Upon entering you find a single room makes up the entire building, the \"kitchen\" is a fire pit in one corner with smoke allowed to flow freely through the room and up out the sheltered hole that serves as a chimney. The bar lines the far wall, made from old barrels and topped by sweat polished wood that seems to have come from a neighboring building at one time. As the door closes behind you with the screech of ungreased hinges and the slap of wood many of the patrons glance up, and you feel the weighing stare of armed men considering robing you."},{"name":"The Silken Veils","type":"Brothel","description":" Sitting alone with a small garden on each side, and a high iron fence all around the property, The Silken Veil does not even try to fit in with the squalor of it\u0027s surroundings. Fresh paint gleams on every inch exterior, and perfect glass sits in the two bay window frames in the front. Standing behind the glass are two Women coated head to toe in silk so sheer you swear you could see right through it if they were not wearing countless layers. As you walk in the front door you see several hulking men standing at their ease in corners, and if you listen closely you think you can hear the clinking of armor in the walls. A older women sits behind the front desk, and greet you warmly with a smile. Sitting infront of her is a large book with what appears to be drawings of women on each page."},{"name":"Grandma Gertrude\u0027s Gardening Grove","type":"Thieves Guild","description":" Most people think of Grandma Gertrude as a kindly sweet old lady who runs a Gardening shop on the edge of the city with quaint little gardens growing around her shop. What most don\u0027t know is that she was one time known as Grim Gertie, and was one of the most ruthless thieves of the lands. Now, she has settled down and taken over control of the local thieves guild using her gardening shop as a cover. She has dug various tunnels under the city, and thanks to dwarven contractors, they are more than mere tunnels. An elaborate maze of tunnels, laid with all sorts of traps, which can only be bypassed if Gertrude gives you a special pin to wear for gardening prowess. Inside this tunnel network, are training grounds, a black market, a barrister\u0027s office, an inn, a flop room, and a well secured fence\u0027s caged office area, where multiple fences buy stolen goods, depending on their specialty. One fence will only buy art items, another jewelry, etc."},{"name":"The Avaricium Arcane","type":"Thieves guild for those who mix magic with their larceny","description":" Near the docks stand a nondescript building with no windows, and only one door. The door is trapped with numerous magical traps that a rogue would have to bypass to open the door, but for those skilled enough to deactivate the magical traps and open the door, another ugly surprise awaits as all they will see is the wall. The real door is hidden under an illusion on another wall. Once they do manage to prove their skilled enough with magic to find the real door, they can enter inside where they find a small bar tended by unseen bar servants, a job listings board, and a fence or two buying and selling magic items, spellbooks, and other things a thieving mage might need."},{"name":"The Canopy","type":"Pirate hideout","description":" Hidden in the highest treetops of an ancient jungle resides an elven tribe who hunt for great treasure rather than for small game. Ropes and pulley systems are strung throughout the branches making movement between the many platforms swift and simple. Only the most skilled of acrobats can navigate this maze of loose planks and vines without falling to the jungle floor far, far below."},{"name":"Swan\u0027s Inn","type":"Town tavern \u0026 inn","description":" Built from the ground up during the town\u0027s earliest days, Swan\u0027s Inn perfectly balances the feeling of a seedy bar with the reputation of a respectable establishment. Despite being a well-known front for the local thieves\u0027 guild, it\u0027s the safest place to be in town--provided that you don\u0027t mind parting with your coin purse after a while."},{"name":"Carpenter’s Guild","type":"Thieves’ Den","description":" Masquerading as construction contractors this thieves’ den already has detailed blueprints of every mark they’re going to hit. Every member always carries around hammer and nails and will use these to defend themselves when caught. The locals aren’t sure what’s the bigger robbery, the heists they pull or the prices they charge"},{"name":"Spitting Distance","type":"Tavern","description":" This tavern is a favorite spot for criminals and lowlifes in the city, situated just above town hall there is a large deck from which the patrons can show their appreciation of the local governments efforts. The place is crowded every night of the week and it is easy to find a fence—or three—on any given night. Some government officials have taken to going to the bar after work and spending their nights cheek by jowl with pirates and smugglers. No one can tell who is worse."},{"name":"The Black Hand","type":"Thieve’s Den","description":" Located in Lars MegaDark’s mother’s basement, this thieves den demands that ACDC music plays all the time in their hideout. The members all wear only black and are forbidden to cut their hair. They are embroiled in a violent turf war with Queen’s Gambit (although no Queen’s Gambit member even recognizes the name “Black Hand”)"},{"name":"Neptune’s End","type":"Cultist Temple","description":" This warehouse has a ring of smugglers masquerading as a Cthulhu worshipping cult, protected under the cities freedom of religion laws. The dingy driftwood built temple and non-euclidean statues inside make a surprisingly good cover and some of the smugglers get really into the act."},{"name":"Salty Pete’s Delivery Service","type":"Parcel Delivery","description":" Salty Pete is a charismatic and brash veteran of the seas who can literally smell gold and opportunity. Based out of a squat 1 story shack of an office, his ships will get you past the local customs alright but they’re made to outpace things much worse, and much faster, out on the open sea."},{"name":"Third Eye Academy","type":"Psionic University","description":" Formally founded to advance the study of psionics, up to two thirds of the grant money given to the university is actually used to ground up the psionic crystals into a fine hallucinogenic powder which the “professors” sell on the side, pocketing the profit themselves."},{"name":"The Mermaid’s Tit","type":"Pirate Sloop","description":" Formally used to run down merchant vessels on the open water, Captain Gruntheim realized the party circuit is a lot more lucrative and converted his ship into a booze cruise that sails nobles around the royal harbor all night. For a hefty fee, you can rent out the entire deck and convince the captain to sail the ship into international waters for the really wild parties."},{"name":"The Drop","type":"Tavern","description":" This tavern makes quite the effort to attract adventurer and pirate alike and isn’t afraid to show off their own set of weapons and each bartender has enough war stories to fill a novel. This is all for good reason, since rumors fly that the local mob runs the especially big drops through this bar. In actuality, it isn’t a mob bar at all and they haven’t handled a single drop, but the tavern uses it as a marketing tactic, and the mob doesn’t want anyone talking about the real drop bars."},{"name":"The tavern for incredibly heroic heroes on heroic quests","type":"Tavern","description":" A tavern run by a couple of con-men aimed at catering specifically to adventurers selling scrolls of fireball (fake) and potions of healing (sewer water) in addition to the usual lodgings, food, and alcohol"},{"name":"Water\u0027s Edge","type":"Town","description":" Water\u0027s Edge is a small hamlet on the northern edge of the Blue Lake. The northern half of the town is bordered by another C-shaped lake that is about 100 yards wide and is known as Reese\u0027s Folly. Stretching south of town into the Blue Lake is a series of small islands that each hold one or two farms. The islands are connected by wooden bridges or rope drawn ferries. These islands are known to the locals as Reese\u0027s Pieces. The story goes that a dwarf named Reese bought the northern half of the Blue Lake and planned on dredging it to create land to sell off. His plan halted abruptly when he disappeared and was never seen again."},{"name":"I\u0027m thirsty! Where are we spilling our gold tonight?","type":"The sign on the door has a man in plate armor kneeling before a pig. \"She\u0027s in here,\" you think to yourself. \"Here goes nothing.\" As the old oak door swings open the scent of stale ale and sweat fill your head. The room before you is packed with dwarves each holding a mug in an uplifted arm, swaying to the music. The dwarves all sing as one: \"What do you do with a drunken fighter? What do you do with a drunken fighter?\"","description":" The taverns do not have to be developed deeply, but they should have enough suggested content that any DM could easily drop them into his or her world, filling in details as needed. I\u0027ll post a few examples."},{"name":"The Wollywog Inn","type":"Inn with Tavern","description":" At one time, the Wollywog Inn also had a brewery, however, erosion caused the basement wall facing the sea to collapse. Deciding to make lemonade from lemons, the owner converted the basement into a small boat dock for patrons arriving from sea."},{"name":"The Blackbird House","type":"Comfortable Urban Pub","description":" This is a pub and inn run by a protective, burnt-out wizard. A former drug addict, the owner now runs his business as an under-the-radar haven for all manner of casters in a city that doesn\u0027t look favorably on magic."},{"name":"The Bard and the Priest","type":"Countryside inn","description":" This is a cozy little spot where the pious bards drink and drunken priests sing. The proprietor often hops on the stage to perform unholy renditions of well-known sacred hymns."},{"name":"The Hound\u0027s Prince","type":"Roadside watering hole","description":" This place is a dive filled with humanity\u0027s leavings and those cruel enough to dice with them and to take their money. There are a few rooms for rent, but you would have better luck avoiding theft camping alongside the road."},{"name":"The Binding Demon","type":"Seedy urban tavern","description":" In nice taverns, you can avoid trouble. In this hole-in-the-wall, trouble gloms onto you. There may be something in the wine or it may be something in the food (which is abysmal), but no one visits this rowdy spot without waking the next day with a splitting headache."},{"name":"The Bumbling Warrior","type":"Roadside inn","description":" This tidy little spot on a hill has a view of a famous battlefield. Legend says that on this spot, a king of old camped with his army while pursuing an enemy horde, only to be slaughtered in the night by his enemy whose army had slipped off the road and doubled back around behind him in the woods."},{"name":"The Butcher and the Guard","type":"Village pub","description":" On the sign above the door of this neat little house is a kneeling man-at-arms with a fat, aproned man raising a cleaver poised to strike off the man\u0027s head. The meat served in this place is of excellent quality, locally raised. However, I would not recommend the blood sausage, I\u0027ve heard stories..."},{"name":"The Stallion and the Void","type":"Tidy urban tavern","description":" Located near the university, this place is a favorite spot among scholars and philosophers. Lively discussions of alchemy, astronomy, history, and metaphysics frequently occur at the long tables covered in mugs of ale."},{"name":"The Good Whale","type":"Dockside tavern","description":" Down by the water in the shadow of the Storm King\u0027s temple is a tavern that caters to merchants, ship\u0027s captains, and priests who demand that they drink in a respectable place. The floors and tables are respectably clean, the food is respectably priced, and the barmaids are all respectably good-looking."},{"name":"The Snake and Piglet","type":"Swampland cantina","description":" The signature plate at this place is fried snake and wild pig ribs, served with a side of greens tossed with a spicy lemon dressing. The drink specials range from overly, sweet fruity cocktails to skunky, watery beers. The clientele tend to be suspicious of outsiders, but they are fiercely loyal once you\u0027ve won them over. If you must participate in the alligator wrestling matches, let the alligator win once in a while—for the good of the sport."},{"name":"The Filthy Devil","type":"Desert cantina","description":" The beer is cheap, but the water is expensive at this scummy little oasis. There are no rooms for rent, but the surrounding salt flat is often cluttered with tents of caravans and other travelers stopping as they cross the wasteland. The proprietor is a devious little fellow who must have a fortune hidden around here somewhere with what he charges..."},{"name":"The Fermented Priest","type":"Countryside taproom","description":" Why are all these places full of drunken priests? Are they looking for answers to the same cosmological or metaphysical riddle? Among the patrons here are the local sheepherders who outnumber the priests four-to-one, but the pilgrims passing this way between the city and the High Temple on Mount Torrynts are much more interesting to chat with over an ale."},{"name":"The Goblin\u0027s Tooth","type":"Mining town pub","description":" A mangled, rusty pick axe has been affixed above the door of this rickety wooden structure. Inside, large barrels serve as tables and small barrels serve as stools for the local miners who spend their evenings here complaining of the guildbosses, the poor pay, and the spooky sights down in the mines. I heard one tale of a tunnel where shimmering lights danced over the walls in the shapes of seductive maidens and another tunnel where a presence follows close behind you whispering, \"Give us a kiss, give us a kiss...\""},{"name":"Darkmantle\u0027s Den","type":"Roadside Pub / Inn","description":" A little run down but always full of lively customers, the Darkmantle\u0027s Den is home to Rotgut. An unfortunately named dwarf and the owner of the place, so named because his family used to run a distillery in Dwarf country. Called cozy by its patrons it features 12 tables and ample room by the fireplace for all weary travelers looking for respite on the road. It sits roughly half a days walk between two small towns and sees much business in those going between the two."},{"name":"House Hunter Hall","type":"Pub","description":" Named because, according to the owner, it was built in the shell of a House Hunter he and his friends defeated long ago. The hall is made of stone and lit magically negating the need for torches and such, the tables are made out of what appear to be bones and the chairs are fashioned from stones. It is located in the heart of a grand city and trade hub where stories tell of a failed mimic invasion. Many patrons visit it only because it is the only pub within easy walking distance of the residential quarter and describe it as eerie. Once in a great while a drunken guest is said to vanish."},{"name":"Griphon\u0027s Garrison","type":"Tavern for local guards and stationed military","description":" Located directly next to the garrison house for the town guard and two blocks away from the barracks for the locally stationed military it is a favourite of both groups. The owner offers safe storage for rare goods in the basement as there is never a safer place in the town and all the regulars praise the quality of the food and alcohol as being better even than in the large cities. The place is a comfortable one for all patrons and with the second floor can easily seat 100 when the house is packed, the owner is considering renovations to fit the ever expanding clientele."},{"name":"The Welcome Traveller","type":"Mobile Pub","description":" This pub, rather unusually, is in the form of a caravan, which travels the countryside, stopping in any towns it comes across for a few days, then moving on again. The proprietor is a young, bright eyed Half-Elf called Darnell, who believes that the best way to get customers is to come to them, rather than waiting for them to come to him."},{"name":"The Embers","type":"Town Pub","description":" The first owner, over a century ago, instituted the tradition that the main, large fire in the centre of the pub would be built, lit and banked the minute the bottom of the sun touched the horizon. After that, it isn\u0027t fed at all. The pub will then remain open so long as there are at least some glowing embers in the fire."},{"name":"Nalds McDo\u0027s.","type":"Extremely sketchy joint on the wealthy side on town.","description":" Inside McDo\u0027s bar you find no bar but an empty room with wooden floors and bruise-green painted walls. There are no chairs, stools or tables. The sign out front prohibits you from taking chairs or tables in with you. The walls are empty, save for the menu, which lists a fine collection of imported spirits. The prices scrape against the sky. There are only two doors in Nalds McDo\u0027s: the entrance, and the anti-chamber that leads to the kitchen. The antichamber door is closed at all times except when the waitress zips through with your order. On the chance to peek, you\u0027ll find that the other door of the antichamber is closed as well. You\u0027ll also see holes in the walls with speartips pointing through. Despite the ridiculous prices, the spirits are the best you\u0027ll ever taste and will be worth every gold piece. But if you want to keep coming here, you\u0027ll obey these rules: 1) Do not ask about prices. 2) Do not ask about the origin of the merchandise. 3) Do not ask the waitress\u0027s name. 4) Do not tip the waitress. 5) Never, ever ask who Nalds McDo is or if this is actually his bar. Other than that, find a place to sit and enjoy your brew."},{"name":"The Singing Swordsman","type":"Friendly Urban Tavern","description":" This local eatery is commonly frequented by various adventuring parties. It is run by a wise and wily dwarf that doesn\u0027t accept monetary payment for any of his goods, instead chanting \"A rumor for an ale, a story for a meal, a song for a round, a secret for a feast!\""},{"name":"The Inn at the End of the Multiverse","type":"Inn, Tavern, can be anything it needs to be really","description":" This inn is both everywhere and nowhere at once as it resides in a pocket plane of existence that is only accessible by those who\u0027ve been \"stamped\" by a previous visitor to the Inn. Once marked, a player can visit this inn by finding wherever the nearest entrance happens to be. Trick is its always changing. Sometimes it\u0027s a regular door, sometimes it\u0027s a hole in the ground, sometimes it\u0027s a makeshift arch made by random branches in the woods. The entrance will always be within a half-days travel of the player, and they can find it through a general sense of its location (think along the lines of how birds know north and south when migrating). As they get closer the player(s) will be able to hear/smell things indicative of an Inn even if it makes no sense for it to be there. Once inside the Inn it\u0027s a lot like an inn of a major city. Patrons of all kinds can be found within. I personally have even used it as a fun way of having players interact with former characters of theirs or major legendary figures in D\u0026D or even other tabletop series. The breadth of available patrons, or other things like possible vendors and the like, is up to you. I\u0027ve used this inn as a means of weaving together one shot sessions as well via a sort of \"quest\" board located in the Inn that services anywhere in the multiverse."},{"name":"The Sinner\u0027s Spittoon","type":"Grimy Urban Tavern","description":" Always dimly lit, humid and full of unsavourable types, the Sinner\u0027s Spittoon is run by a racist Half-Orc who only allows humans inside - and he\u0027s too huge and menacing for anyone to let him know his true heritage."},{"name":"The Hammer and Tongs","type":"Tavern with Inn","description":" The sign outside has a simply branded image of a hammer between a pair of things. This spot was a favorite among locals until it closed. It was bought up by a middle aged priest who used it as his personal sanctuary to hide from his memories. Recently, he has adopted a young woman, formerly a prostitute. The ambitious lass recruited her former \"co-workers\" to work at the Hammer and Tongs in their free time, and the word on the wind is that these young women enjoy getting extra practice in, off the books. The air around the tavern is lively and tumultuous, the owner not being fully aware of what occurs in his former sanctuary. Below the tavern, a series of rat-folk tunnels connects to the cellar, and the owner has done business with the denizens below before."},{"name":"The Chieftain\u0027s Crossbow","type":"Hunter\u0027s Lodge","description":" Secluded in the dense forests on the tall mountains, this lodge appears to be no more than a shack. Upon entering, there is a small, lightly furnished room. One might notice a dull clamor coming from some unseen source. Beneath the floor rug is a trapdoor with ladder leading fifty feet down into the center of somewhat busy pub. The patrons are mostly hunters on long hunting trips and soldiers resting from long excursions. Large, burly men and women bus between table, balancing large platters of hardy meals and carrying pyramids of drinks. The smell of the fires along the outer walls fills the air."},{"name":"The Butcher and Elephant","type":"Rural Roadside Tavern","description":" This tavern is notable due to the pair of elephant tusks which sit over the entranceway. These originally belonged to a war beast which was left behind when it\u0027s owners were defeated in battle. A local butcher nursed the behemoth back to health and used him as a tourist attraction."},{"name":"The White Tiger","type":"Tavern on the West side of town","description":" Of the three remaining criminal gangs in town the White Tiger pub has the best equipped. Everyone in the place has proper arms and decent armour. The bar itself is a sprawling complex - one story spread across what seems like half of the west side."},{"name":"The Azure Dragon","type":"A bar on the Eastern side of town","description":" The Azure Dragon is five stories of slanted, falling down timber. It looks as if a strong breeze would knock the entire thing down. The criminal gang that frequents this establishment practice all manner of arcane arts from using alchemy to knock marks unconscious and burn holes in walls to sorcery to scree for the locations of things to steal."},{"name":"The Black Turtle","type":"Inn and tavern, just outside of town on the North Road","description":" The Black Turtle is dark and grotty. Its one of the few places to offer bed for coin in town but its not exactly the kind of place you\u0027d want to go to relax. The criminals that sit in the bar are a quiet lot and rarely speak, especially to outsiders. This probably just means that they will slit your throat without talking about it first, however."},{"name":"The Vermillion Bird","type":"A brewery south of town, by the river","description":" For a long time the criminals that ran the Vermillion Bird stayed out of the infighting between the town gangs by supplying the other three with liquor and mead. One day however a group attacked the brewery and burned the building to the ground. Only a scorched husk remains. Its a sad tale and the angry, rough looking old man next door will tell it for free. He lost three sons and a daughter in that fire."},{"name":"The philanthropist\u0027s flagon","type":"generous urban pub","description":" This pub is run by a rich adventurer. Every purchase made by a customer will have an equal drink or meal donated to the city\u0027s poor and hungry, and for every night a room is rented here an equal room is given to one of the city\u0027s homeless during that time. It is often filled with those whose love of justice outweighs their greed, and those who were able to find a job due to having more time to look for one since they didn\u0027t have to beg as much."},{"name":"The Hurling Crab","type":"Village Tavern","description":" Run by a third generation fisherman who is plagued by constant sea sickness so he left the trade. The Hurling Crab has a bar constructed from a ship wreak. Behind the bar on the wall is a well use harpoon. Tables are mounted on top of barrels. They serve ale, hard bread, cabbage soup, and if you have fish stories rum."},{"name":"The Abyss","type":"Rough underworld bar","description":" Down on the docks sits an outhouse like no other. During the day, the door is always locked from the inside, but at night the door is unlocked because it\u0027s actually the entryway into The Abyss. The Abyss is done in a demonic theme, with paintings of demons and devils lining the walls, serving wenches made up as succubi, and menu items like spicy Hellhound sausages. It\u0027s run by a busty human woman named Kariva, who is actually not a human woman, but rather a succubi using shapechange. And those servers dressed as succubi, oh yeah, they\u0027re actual succubi too."},{"name":"The Clockwork Keg","type":"A bar full of gnomish gadgets","description":" A gnome tinkerer worked up a device that brews ale that could actually stand it\u0027s own against some of the finest ales in the land. It quickly grew popular, and it\u0027s inventor decided to capitalize on it\u0027s growing popularity by opening his own tavern. But, in addition to having the finest gnome ale in the land, possibly the only gnome ale in the land, the tinkerer filled the bar with a number of his contraptions, such as the peanut catapult, the drink conveyor, and the automatic fireplace as just some of the various devices in the place. Order is kept by a large clockwork golem, who seems to be just another part of the scenery of the bar until trouble starts."},{"name":"That Horse House","type":"Inn with stables","description":" Inner-city traffic always is a nightmare - and even worse is that you\u0027ll have to find a place for your horse afterwards! This establishment, square in the centre of the city, has built large stables to accomodate its patrons mounts - and has has become infamous with its neighbours for the stench..."},{"name":"The Velvet Cave","type":"A secretive tavern/inn","description":" Located in a large city, this place has no signs advertising it\u0027s presence, yet it always has a crowd. In this nondescript building is the city\u0027s only gay bar/inn, and as such is usually packed with both men and women looking to meet others of a similar inclination. The ambiance is restrained though, the music is soft, and the place has a more upscale feel to it, even though it\u0027s food and drink prices are very reasonable. For those favoring privacy in their hook-ups, Inn rooms can be rented by the hour, and sometimes there is a wait to get an open room."},{"name":"The Peeing Puppy","type":"Combo tavern and animal shelter","description":" A powerful adventurer retired to open a tavern, but as she worked to get her establishment ready to open, she noticed that there were lots of stray animals in the city, and she changed her initial plans. She added an animal shelter to her tavern, and now takes care of thirsty patrons and homeless animals. Initially, some patrons decided to be less than friendly to the animals, but after the adventurer killed or maimed the first few patrons who hurt any of the animals, there are very few incidents."},{"name":"The Fallen Apple","type":"Roadside Inn","description":" Where the road passes through orchards covered with trees, the Fallen Apple makes use of all the damaged fruit to brew a variety of fruity wines, cordials and liquors. Famous for it\u0027s mildly sweetened \u0027Apple Ale\u0027, the Inn is run by a variety of members of the local farming households, who also split the profits, and even export their more potent spirits to far away towns."},{"name":"The Seahag","type":"Tavern off the beaten path","description":" A dilapidated wooden tavern and inn run by an old sea captain. Ole\u0027 Cap (as he calls himself) doesn\u0027t particularly like patrons, and has set up shop far off the normal crossroads. Ole\u0027 Cap just wanted to retire to land, and the only time he spent on land was in dockside bars."},{"name":"The drunken Bee","type":"Countryside tavern and brewery","description":" Adjacent to a honey farm, the special \"Drunken Bee Amber\"-Mead served in this cozy tavern comes from an alveary fed with flowers sprayed with the finest dwarven spirits every morning, hence the strong aftertaste and temporary blindness."},{"name":"The silent fiddle inn","type":"Urban inn","description":" The centrepiece of this alehouse is its gnomish entertainer, playing his tiny fiddle weeknights - barely loud enough not to be laughed down by the clientele."},{"name":"The loose board","type":"Rural brewpub","description":" This pub is overrun in the summer but remains shut in winter. The reason for that is the half-torn boarded wall for whose reparations the pinchpenny owner refuses to pay."},{"name":"Mariner\u0027s Hull","type":"Inn and Tavern in a coastal city","description":" Nautical themed inn catering to seamen taking a night ashore, especially the Captains and other officers of the ship. All rooms are single and small, but compared to ship bunks, they are downright expansive and offer each guest the privacy they lack aboard ship. Each room contains a hammock which can be suspended above the bed for those old salts who prefer it. The mounts for the hammock is a marvel combination of Gondish technology and spellcraft and causes the hammock to sway gently, mimicking the rolling waves of a calm ocean. Many an old salt has said it\u0027s the best sleep they\u0027ve ever had on land. A nights stay includes a trip to a small bath house, one pint of ale and one meal. Rooms are 8 sp per night. (see also, Trade Way Junction)"},{"name":"Trade Way Junction","type":"Inn and Tavern in a coastal trading city","description":" Often referred to (especially by seafarers) as \"Lubber\u0027s Junction\" this Coach \u0026 Wagon themed inn caters to Caravan Masters, coachmen and others usually found on caravan troupes. The inn prides itself a being the best place in the city to find overland transport for goods up and down the coast. Located close to Mariner\u0027s Hull, it\u0027s where Captains and Caravan Masters often meet to arrange transport for goods making the transition between land and sea, or for each to find clients needing transport for their merchandise. The top of each large table contains a map of area trade routes. Rooms are 1gp per night. (see also, Mariner\u0027s Hull)"},{"name":"MacNamara\u0027s Pub","type":"Small Public House in an large city","description":" A hidden gem, tucked away on a side street, out of the way of lots of traffic. The most notable thing about this place is the proprietor, \"Dark\" Darcey MacNamara (\"hound of the sea\"). She\u0027s a strong athletic black woman who looks like a cross between a pirate warrior and voodoo priestess. She\u0027s always friendly with a wide bright white smile and long dread-locks. But don\u0027t piss her off; she\u0027s defenestrated many an unruly patron. She is a bit of a mystery, but she\u0027s always there, day or night, and the Pub always seems open. Rumor is that Darcey is a retired pirate, but she might actually be an ancient silver dragon. The crowds are small, the drinks are superb (some are her private label, unavailable anywhere else in the region), and the food is amazing without being fancy. Meat Pie - similar to sheppard\u0027s pie Steak \u0026 Bread - steak sandwich on a hearty wheat loaf. The meat varies. Fresh Catch - something from the sea or river, served with grilled vegetables. Catch \u0026 Bread - Fresh Catch, grilled to perfection, served on a light loaf Fresh Paddy - a hamburger, but the meat changes (beef, goat, veal, venison, bison, etc.) Field Rations - a vegetarian option. changes daily, never looks like a salad Jambalaya - ingredients vary, usually fresh catch \u0026 sausage. Always spicy, always delicious. All meals are 5 sp. Drinks are 1 sp except for \"private label\" items which are 3 sp."},{"name":"Take Your Chances","type":"Pub","description":" This ordinary looking Pub is known for it\u0027s eclectic menu. The cook considers himself a bit of a chef, and thus encourages people to bring him various ingredients, which he then turns into unique dishes. So, a passing adventurer might bring him displacer beast meat, a farmer might have surprlus of beets, and the local cat might drop a dead bird at his doorstep, and the cook will take those ingredients, and use his extensive collection of spices and herbs to create a culinary masterpiece. Or at least he thinks it is, sometimes he\u0027s right and sometimes he\u0027s not. But, each night will bring some unusual dish for the brave gourmand."},{"name":"This is NOT a Tavern","type":"Totally a tavern","description":" In a city oddly obsessed with irony and sarcasm, ironic false advertising seems to be par for the course. Still, \"This is NOT a Tavern\" is a nice enough place. The food is palatable, the drinks are alcoholic, and the barmaids are tall glasses of water. They take no shit from anyone, though, so don\u0027t get handsy."},{"name":"Inn of Ill Repute","type":"Inn far from town","description":" A cozy, safe place deep in the wilderness. However, a sacrifice is required on each visit. The more powerful the creature sacrificed, the better the accommodations. To sacrifice a hero... well that demands special accommodations doesn\u0027t it?"},{"name":"The Essay","type":"City Tavern","description":" The Essay, situated close to the University, long ago evolved to cater for students, who now often use the excuse the next day \"I was up late, working on an essay...\" The Essay backs into a hill, with the partly underground lower floor a host to noisy discussions about philosophy and the occasional brawl, but the upper floor is filled with quite nooks with desks for quieter study over a beverage and plate of fried potatoes and onions."},{"name":"The Pilgrim\u0027s Peace","type":"Quiet Urban Pub","description":" This place is outside of the main city, and looks like a plain, humble establishment. The tone is muted, the only sounds are the crackling fire and the low conversations. The barman wears simple rough wool. No names are asked for here, everyone is called \"friend\". Know the right phrase, and you can be shown downstairs, to the Sinner\u0027s Sanctum."},{"name":"The Sinner\u0027s Sanctum","type":"Out-of-the-way Establishment","description":" This is the true face of the Pilgrim\u0027s Peace. Tell the barman \"I need a place to rest my head, just for tonight\" and hand him a silver, and he\u0027ll lead you down a rickety set of wooden stairs into a carved out room beneath the cellar. Here you can be put in contact with the criminal element of the city. As above, no names. You call people \"friend\"."},{"name":"The Jumping Church","type":"Repurposed Urban Pub","description":" The neighbourhood has gone downhill since the competing thieves\u0027 guilds moved in, and the biggest symbol of that decline was the converting of St Cuthbert\u0027s temple to a sleazy gambling den, whorehouse and drinking hole. The place got its name from the curious state of its foundations. The entire building is a few feet West of where it used to be. A cleric used to be buried under the East wall, and his resting place now lies outside. The story goes that St Cuthbert caused the temple to jump over his faithful servant, rather than have his remains remain in such a place."},{"name":"The Feast and Famine","type":"Rundown Urban Tavern","description":" Here in the poor part of town you can find the Feast and Famine, run by a man called Log and his elderly nan Gristlepot. They won\u0027t tell you their real names lightly, they have a past that they\u0027ve left behind. Log runs a system of discreetly trading favours with ever-richer people, and he employs passing adventurers to carry them out for him. Gristlepot runs a stew kitchen for the hungry poor in the area. A bowl for a copper, or free if you bring something for the pot."},{"name":"Wainwright\u0027s Shortcut","type":"Urban Dwarven Tavern","description":" Flush with all the art, song, and beer from Dwarven lands, this pub aims to be a hub for the homesick dwarves of the city. As such, it is built into a hill and carved out of earth and cladded with stone to feel just like the beerhall you drank in with your daddy. The name comes from a myth about the Wainwright, the Dwarf who calls you out of the ground when you die and wheels you back to the Living in his cart. \"No need to bury you, he\u0027ll know to find you here!\""},{"name":"The Rotter\u0027s Saucer","type":"Dive bar on the wrong side of town","description":" It was maybe a half century ago that the Saucer was on the right side of town, but times change and this once-reputable neighbourhood has fallen into decline. These days this dive bar is favoured by down-on-their-luck Halflings who sigh fondly about the old days and scheme to get their comfortable lives back."},{"name":"Last Retort","type":"Tavern and stage","description":" This elaborately-decorated tavern is most famous for its all-night rhyming competitions, which draw performers and wits from across town on the first night of the new moon. The reigning champion is Amberdel Quazitz, a gnome of gross size blessed with a nimble mind."},{"name":"The Prince and Wagon","type":"Beer garden","description":" This open-air patio is set up only in summer time, taking up most of the town square. Revellers and athletes come from the summer games to enjoy a pint in the sun and swap tales of their feats of strength and daring. The patrons are always good for a bet or a dare, as long as it\u0027s in good humour. Closed when raining."},{"name":"Gummy Murphy\u0027s","type":"Roadside Inn","description":" A very popular pub known for it\u0027s cheap prices and sultry waitresses. It is usually overcrowded after standard working hours, filled with those willing to lose the days coin on cheap grog and gambling. Given the size of the clientele fights break out with some frequency. ~~ ~~ ~~ ~~ ~~ ~~ ~~ ~~ Sporting a sign of the proprietor, an old toothless man, this Inn is one of the few places recommended for travelling families and the elderly. It sports some infamy for not serving any solid food."}]